# -*-coding: utf-8 -
'''
    @author: MD. Nazmuddoha Ansary,Asif Sushmit
'''
#--------------------
# imports
#--------------------
#------------------------------------------------------------------------------------------------------------------------------------------------------
#######################################################################################################################################################
#------------------------------------------------------------------------------------------------------------------------------------------------------
class bangla:
    iden                   =    "bangla"
    vowels                 =    ['অ', 'আ', 'ই', 'ঈ', 'উ', 'ঊ', 'ঋ', 'এ', 'ঐ', 'ও', 'ঔ']
    consonants             =    ['ক', 'খ', 'গ', 'ঘ', 'ঙ', 
                                'চ', 'ছ','জ', 'ঝ', 'ঞ', 
                                'ট', 'ঠ', 'ড', 'ঢ', 'ণ', 
                                'ত', 'থ', 'দ', 'ধ', 'ন', 
                                'প', 'ফ', 'ব', 'ভ', 'ম', 
                                'য', 'র', 'ল', 'শ', 'ষ', 
                                'স', 'হ','ড়', 'ঢ়', 'য়','ং', 'ঃ','ৎ']
    numbers                =    ['০', '১', '২', '৩', '৪', '৫', '৬', '৭', '৮', '৯']
    punctuations           =    ['!', '"', '#', '$', '%', '&', "'", '(', ')', '*', '+', ',', '-', '.', 
                                 '/', ':', ';', '<', '=', '>', '?', '@', '[', '\\', ']', '^', '_', '`',
                                 '{', '|', '}', '~', '।']
    # for grapheme decomp
    vowel_diacritics       =    ['া', 'ি', 'ী', 'ু', 'ূ', 'ৃ', 'ে', 'ৈ', 'ো', 'ৌ']
    consonant_diacritics   =    ['ঁ', 'র্', 'র্য', '্য', '্র', '্র্য', 'র্্র']
    modifiers              =    []
    connector              =    '্'
    allow_conn_ending      =    False
    # special charecters
    special_charecters     =    [connector,'\u200d']
    # for synthetic data creation
    top_exts               =    ['ই', 'ঈ', 'উ', 'ঊ', 'ঐ','ঔ','ট', 'ঠ',' ি', 'ী', 'ৈ', 'ৌ','ঁ','র্']
    bot_exts               =    ['ু', 'ূ', 'ৃ',]
    # dict graphemes
    dict_graphemes         =    ["ঁ","ং","ঃ","অ","অ্যা","আ","আঁ","ই","ইঁ","ঈ","উ","উঁ","ঊ","ঋ","এ","এঁ","এ্যা","ঐ","ও","ঔ","ক",
                                "কঁ","কা","কাঁ","কি","কিঁ","কী","কীঁ","কু","কুঁ","কূ","কূঁ","কৃ","কৃঁ","কে","কেঁ","কৈ","কো","কোঁ","কৌ","কৌঁ",
                                "ক্ক","ক্কা","ক্কি","ক্কী","ক্কু","ক্কূ","ক্কে","ক্কো","ক্ট","ক্টা","ক্টি","ক্টী","ক্টু","ক্টূ","ক্টে","ক্টো","ক্ট্য","ক্ট্যা","ক্ট্যি","ক্ট্যী",
                                "ক্ট্যু","ক্ট্যূ","ক্ট্যে","ক্ট্যো","ক্ট্র","ক্ট্রো","ক্ত","ক্তা","ক্তি","ক্তী","ক্তু","ক্তূ","ক্তৃ","ক্তে","ক্তো","ক্ত্র","ক্ত্রা","ক্ত্রি","ক্ত্রী","ক্ত্রু",
                                "ক্ত্রূ","ক্ত্রে","ক্ত্রো","ক্ন","ক্না","ক্নি","ক্নী","ক্নু","ক্নে","ক্নো","ক্ব","ক্বা","ক্বি","ক্বী","ক্বে","ক্বো","ক্য","ক্যা","ক্যি","ক্যী",
                                "ক্যু","ক্যূ","ক্যে","ক্যো","ক্র","ক্রা","ক্রি","ক্রী","ক্রু","ক্রূ","ক্রে","ক্রো","ক্র্যা","ক্ল","ক্লা","ক্লি","ক্লী","ক্লু","ক্লূ","ক্লে",
                                "ক্লো","ক্ষ","ক্ষা","ক্ষি","ক্ষী","ক্ষু","ক্ষূ","ক্ষে","ক্ষো","ক্ষৌ","ক্ষ্ণ","ক্ষ্ণা","ক্ষ্ণি","ক্ষ্ণী","ক্ষ্ণু","ক্ষ্ণূ","ক্ষ্ণে","ক্ষ্ণো","ক্ষ্ণৌ","ক্ষ্ব",
                                "ক্ষ্বা","ক্ষ্বি","ক্ষ্বী","ক্ষ্বু","ক্ষ্বূ","ক্ষ্বে","ক্ষ্বো","ক্ষ্ম","ক্ষ্মা","ক্ষ্মি","ক্ষ্মী","ক্ষ্মু","ক্ষ্মে","ক্ষ্মো","ক্ষ্য","ক্ষ্যা","ক্ষ্যি","ক্ষ্যী","ক্ষ্যু","ক্ষ্যূ",
                                "ক্ষ্যে","ক্ষ্যো","ক্স","ক্সা","ক্সি","ক্সী","ক্সু","ক্সূ","ক্সে","ক্সো","খ","খঁ","খা","খাঁ","খি","খিঁ","খী","খীঁ","খু","খুঁ",
                                "খূ","খূঁ","খৃ","খৃঁ","খে","খেঁ","খৈ","খো","খোঁ","খৌ","খৌঁ","খ্য","খ্যা","খ্যি","খ্যু","খ্যূ","খ্যে","খ্যো","খ্র","খ্রা",
                                "খ্রি","খ্রী","খ্রু","খ্রূ","খ্রে","খ্রো","গ","গঁ","গা","গাঁ","গি","গিঁ","গী","গীঁ","গু","গুঁ","গূ","গূঁ","গৃ","গৃঁ",
                                "গে","গেঁ","গৈ","গো","গোঁ","গৌ","গৌঁ","গ্গ","গ্গা","গ্গি","গ্গী","গ্গু","গ্গূ","গ্গে","গ্গো","গ্দ","গ্দা","গ্দি","গ্দী","গ্দু",
                                "গ্দূ","গ্দে","গ্দো","গ্ধ","গ্ধা","গ্ধি","গ্ধী","গ্ধু","গ্ধূ","গ্ধে","গ্ধো","গ্ধ্য","গ্ধ্যা","গ্ধ্যি","গ্ধ্যী","গ্ধ্যু","গ্ধ্যূ","গ্ধ্যে","গ্ধ্যো","গ্ন",
                                "গ্না","গ্নি","গ্নী","গ্নু","গ্নূ","গ্নে","গ্নো","গ্ন্য","গ্ন্যা","গ্ন্যি","গ্ন্যী","গ্ন্যু","গ্ন্যূ","গ্ন্যে","গ্ন্যো","গ্ব","গ্বা","গ্বি","গ্বী","গ্বু",
                                "গ্বূ","গ্বে","গ্বো","গ্ম","গ্মা","গ্মি","গ্মী","গ্মু","গ্মূ","গ্মে","গ্মো","গ্য","গ্যা","গ্যি","গ্যী","গ্যু","গ্যে","গ্যো","গ্র","গ্রা",
                                "গ্রি","গ্রী","গ্রু","গ্রূ","গ্রে","গ্রো","গ্র্য","গ্র্যা","গ্র্যি","গ্র্যী","গ্র্যু","গ্র্যূ","গ্র্যে","গ্র্যো","গ্ল","গ্লা","গ্লি","গ্লী","গ্লু","গ্লূ",
                                "গ্লে","গ্লো","গ্ল্যা","ঘ","ঘঁ","ঘা","ঘাঁ","ঘি","ঘিঁ","ঘী","ঘীঁ","ঘু","ঘুঁ","ঘূ","ঘূঁ","ঘৃ","ঘৃঁ","ঘে","ঘেঁ","ঘৈ",
                                "ঘো","ঘোঁ","ঘৌ","ঘৌঁ","ঘ্ন","ঘ্না","ঘ্নি","ঘ্নী","ঘ্নু","ঘ্নূ","ঘ্নে","ঘ্নো","ঘ্য","ঘ্যা","ঘ্যি","ঘ্যী","ঘ্যু","ঘ্যে","ঘ্যো","ঘ্র",
                                "ঘ্রা","ঘ্রি","ঘ্রী","ঘ্রু","ঘ্রূ","ঘ্রে","ঘ্রো","ঙ","ঙঁ","ঙা","ঙি","ঙী","ঙু","ঙুঁ","ঙূ","ঙে","ঙেঁ","ঙো","ঙোঁ","ঙৌ",
                                "ঙ্ক","ঙ্কা","ঙ্কি","ঙ্কী","ঙ্কু","ঙ্কূ","ঙ্কৃ","ঙ্কে","ঙ্কো","ঙ্ক্তি","ঙ্ক্য","ঙ্ক্যা","ঙ্ক্যি","ঙ্ক্যী","ঙ্ক্যু","ঙ্ক্যূ","ঙ্ক্যে","ঙ্ক্যো","ঙ্ক্ষ","ঙ্ক্ষা",
                                "ঙ্ক্ষি","ঙ্ক্ষী","ঙ্ক্ষু","ঙ্ক্ষূ","ঙ্ক্ষে","ঙ্ক্ষো","ঙ্খ","ঙ্খা","ঙ্খি","ঙ্খী","ঙ্খু","ঙ্খূ","ঙ্খে","ঙ্খো","ঙ্গ","ঙ্গা","ঙ্গি","ঙ্গী","ঙ্গু","ঙ্গূ",
                                "ঙ্গে","ঙ্গো","ঙ্গ্য","ঙ্গ্যা","ঙ্গ্যি","ঙ্গ্যী","ঙ্গ্যু","ঙ্গ্যূ","ঙ্গ্যে","ঙ্গ্যো","ঙ্ঘ","ঙ্ঘা","ঙ্ঘি","ঙ্ঘী","ঙ্ঘু","ঙ্ঘূ","ঙ্ঘে","ঙ্ঘো","ঙ্ঘ্য","ঙ্ঘ্যা",
                                "ঙ্ঘ্যি","ঙ্ঘ্যী","ঙ্ঘ্যু","ঙ্ঘ্যূ","ঙ্ঘ্যে","ঙ্ঘ্যো","ঙ্ঘ্রা","ঙ্ঘ্রি","ঙ্ঘ্রী","ঙ্ঘ্রু","ঙ্ঘ্রূ","ঙ্ঘ্রে","ঙ্ঘ্রো","ঙ্ম","ঙ্মা","ঙ্মি","ঙ্মী","ঙ্মু","ঙ্মূ","ঙ্মে",
                                "ঙ্মো","চ","চঁ","চা","চাঁ","চি","চিঁ","চী","চীঁ","চু","চুঁ","চূ","চূঁ","চৃ","চৃঁ","চে","চেঁ","চৈ","চো","চোঁ",
                                "চৌ","চৌঁ","চ্চ","চ্চা","চ্চি","চ্চী","চ্চু","চ্চূ","চ্চে","চ্চো","চ্ছ","চ্ছা","চ্ছি","চ্ছী","চ্ছু","চ্ছূ","চ্ছৃ","চ্ছে","চ্ছো","চ্ছ্ব",
                                "চ্ছ্বা","চ্ছ্বি","চ্ছ্বী","চ্ছ্বু","চ্ছ্বূ","চ্ছ্বে","চ্ছ্বো","চ্ছ্র","চ্ছ্রা","চ্ছ্রি","চ্ছ্রী","চ্ছ্রু","চ্ছ্রূ","চ্ছ্রে","চ্ছ্রো","চ্ঞ","চ্ঞা","চ্ঞি","চ্ঞী","চ্ঞু",
                                "চ্ঞূ","চ্ঞে","চ্ঞো","চ্য","চ্যা","চ্যি","চ্যী","চ্যু","চ্যূ","চ্যে","চ্যো","ছ","ছঁ","ছা","ছাঁ","ছি","ছিঁ","ছী","ছীঁ","ছু",
                                "ছুঁ","ছূ","ছূঁ","ছৃ","ছৃঁ","ছে","ছেঁ","ছৈ","ছো","ছোঁ","ছৌ","ছৌঁ","ছ্য","ছ্যা","ছ্যি","ছ্যী","ছ্যু","ছ্যূ","ছ্যে","ছ্যো",
                                "জ","জঁ","জা","জি","জিঁ","জী","জীঁ","জু","জুঁ","জূ","জূঁ","জৃ","জৃঁ","জে","জেঁ","জৈ","জো","জোঁ","জৌ","জৌঁ",
                                "জ্জ","জ্জা","জ্জি","জ্জী","জ্জু","জ্জূ","জ্জে","জ্জো","জ্জ্ব","জ্জ্বা","জ্জ্বি","জ্জ্বী","জ্জ্বু","জ্জ্বূ","জ্জ্বে","জ্জ্বো","জ্ঝ","জ্ঝা","জ্ঝি","জ্ঝী",
                                "জ্ঝু","জ্ঝূ","জ্ঝে","জ্ঝো","জ্ঞ","জ্ঞা","জ্ঞি","জ্ঞী","জ্ঞু","জ্ঞূ","জ্ঞে","জ্ঞো","জ্ব","জ্বা","জ্বি","জ্বী","জ্বু","জ্বূ","জ্বে","জ্বো",
                                "জ্য","জ্যা","জ্যি","জ্যী","জ্যু","জ্যূ","জ্যে","জ্যৈ","জ্যো","জ্র","জ্রা","জ্রি","জ্রী","জ্রু","জ্রূ","জ্রে","জ্রো","ঝ","ঝঁ","ঝা",
                                "ঝাঁ","ঝি","ঝিঁ","ঝী","ঝীঁ","ঝু","ঝুঁ","ঝূ","ঝূঁ","ঝৃ","ঝৃঁ","ঝে","ঝেঁ","ঝৈ","ঝো","ঝোঁ","ঝৌ","ঝৌঁ","ঞ","ঞঁ",
                                "ঞা","ঞি","ঞী","ঞু","ঞুঁ","ঞূ","ঞে","ঞো","ঞৌ","ঞ্চ","ঞ্চা","ঞ্চি","ঞ্চী","ঞ্চু","ঞ্চূ","ঞ্চে","ঞ্চো","ঞ্ছ","ঞ্ছা","ঞ্ছি",
                                "ঞ্ছী","ঞ্ছু","ঞ্ছূ","ঞ্ছে","ঞ্ছো","ঞ্জ","ঞ্জা","ঞ্জি","ঞ্জী","ঞ্জু","ঞ্জূ","ঞ্জে","ঞ্জো","ঞ্ঝ","ঞ্ঝা","ঞ্ঝি","ঞ্ঝী","ঞ্ঝু","ঞ্ঝূ","ঞ্ঝে",
                                "ঞ্ঝো","ট","টঁ","টা","টি","টিঁ","টী","টীঁ","টু","টুঁ","টূ","টূঁ","টৃ","টৃঁ","টে","টেঁ","টৈ","টো","টোঁ","টৌ",
                                "টৌঁ","ট্ট","ট্টা","ট্টি","ট্টী","ট্টু","ট্টূ","ট্টে","ট্টো","ট্ব","ট্বা","ট্বি","ট্বী","ট্বু","ট্বূ","ট্বে","ট্বো","ট্ম","ট্মা","ট্মি",
                                "ট্মী","ট্মু","ট্মূ","ট্মে","ট্মো","ট্য","ট্যা","ট্যি","ট্যী","ট্যু","ট্যূ","ট্যে","ট্যো","ট্র","ট্রা","ট্রি","ট্রী","ট্রু","ট্রূ","ট্রে",
                                "ট্রো","ট্র্য","ট্র্যা","ট্র্যি","ট্র্যী","ট্র্যু","ট্র্যূ","ট্র্যে","ট্র্যো","ঠ","ঠঁ","ঠা","ঠাঁ","ঠি","ঠিঁ","ঠী","ঠীঁ","ঠু","ঠুঁ","ঠূ",
                                "ঠূঁ","ঠৃ","ঠৃঁ","ঠে","ঠেঁ","ঠৈ","ঠো","ঠোঁ","ঠৌ","ঠৌঁ","ঠ্য","ঠ্যা","ঠ্যি","ঠ্যী","ঠ্যু","ঠ্যূ","ঠ্যে","ঠ্যো","ড","ডঁ",
                                "ডা","ডি","ডিঁ","ডী","ডীঁ","ডু","ডুঁ","ডূ","ডূঁ","ডৃ","ডৃঁ","ডে","ডেঁ","ডৈ","ডো","ডোঁ","ডৌ","ডৌঁ","ড্ড","ড্ডা",
                                "ড্ডি","ড্ডী","ড্ডু","ড্ডূ","ড্ডে","ড্ডো","ড্ব","ড্বা","ড্বি","ড্বী","ড্বু","ড্বূ","ড্বে","ড্বো","ড্ম","ড্মা","ড্মি","ড্মী","ড্মু","ড্মূ",
                                "ড্মে","ড্মো","ড্য","ড্যা","ড্যি","ড্যী","ড্যু","ড্যূ","ড্যে","ড্যো","ড্র","ড্রা","ড্রি","ড্রী","ড্রু","ড্রূ","ড্রে","ড্রো","ঢ","ঢঁ",
                                "ঢা","ঢি","ঢিঁ","ঢী","ঢীঁ","ঢু","ঢুঁ","ঢূ","ঢূঁ","ঢৃ","ঢৃঁ","ঢে","ঢেঁ","ঢৈ","ঢো","ঢোঁ","ঢৌ","ঢৌঁ","ঢ্য","ঢ্যা",
                                "ঢ্যি","ঢ্যী","ঢ্যু","ঢ্যূ","ঢ্যে","ঢ্যো","ঢ্র","ঢ্রা","ঢ্রি","ঢ্রী","ঢ্রু","ঢ্রূ","ঢ্রে","ঢ্রো","ণ","ণঁ","ণা","ণি","ণিঁ","ণী",
                                "ণীঁ","ণু","ণুঁ","ণূ","ণূঁ","ণৃ","ণৃঁ","ণে","ণেঁ","ণৈ","ণো","ণোঁ","ণৌ","ণৌঁ","ণ্ট","ণ্টা","ণ্টি","ণ্টী","ণ্টু","ণ্টূ",
                                "ণ্টে","ণ্টো","ণ্ঠ","ণ্ঠা","ণ্ঠি","ণ্ঠী","ণ্ঠু","ণ্ঠূ","ণ্ঠে","ণ্ঠো","ণ্ঠ্য","ণ্ঠ্যা","ণ্ঠ্যি","ণ্ঠ্যী","ণ্ঠ্যু","ণ্ঠ্যূ","ণ্ঠ্যে","ণ্ঠ্যো","ণ্ড","ণ্ডা",
                                "ণ্ডি","ণ্ডী","ণ্ডু","ণ্ডূ","ণ্ডে","ণ্ডো","ণ্ড্য","ণ্ড্যা","ণ্ড্যি","ণ্ড্যী","ণ্ড্যু","ণ্ড্যূ","ণ্ড্যে","ণ্ড্যো","ণ্ড্র","ণ্ড্রা","ণ্ড্রি","ণ্ড্রী","ণ্ড্রু","ণ্ড্রূ",
                                "ণ্ড্রে","ণ্ড্রো","ণ্ঢ","ণ্ঢা","ণ্ঢি","ণ্ঢী","ণ্ঢু","ণ্ঢূ","ণ্ঢে","ণ্ঢো","ণ্ণ","ণ্ণা","ণ্ণি","ণ্ণী","ণ্ণু","ণ্ণূ","ণ্ণে","ণ্ণো","ণ্ব","ণ্বা",
                                "ণ্বি","ণ্বী","ণ্বু","ণ্বূ","ণ্বে","ণ্বো","ণ্ম","ণ্মা","ণ্মি","ণ্মী","ণ্মু","ণ্মূ","ণ্মে","ণ্মো","ণ্য","ণ্যা","ণ্যি","ণ্যী","ণ্যু","ণ্যূ",
                                "ণ্যে","ণ্যো","ত","তঁ","তা","তাঁ","তি","তিঁ","তী","তীঁ","তু","তুঁ","তূ","তৃ","তৃঁ","তে","তেঁ","তৈ","তো","তোঁ",
                                "তৌ","তৌঁ","ত্ত","ত্তা","ত্তি","ত্তী","ত্তু","ত্তূ","ত্তে","ত্তো","ত্ত্ব","ত্ত্বা","ত্ত্বি","ত্ত্বী","ত্ত্বূ","ত্ত্বে","ত্ত্বো","ত্ত্য","ত্থ","ত্থা",
                                "ত্থি","ত্থী","ত্থু","ত্থূ","ত্থে","ত্থো","ত্ন","ত্না","ত্নি","ত্নী","ত্নু","ত্নূ","ত্নে","ত্নো","ত্ব","ত্বা","ত্বি","ত্বী","ত্বু","ত্বূ",
                                "ত্বে","ত্বো","ত্ম","ত্মা","ত্মি","ত্মী","ত্মু","ত্মূ","ত্মে","ত্মো","ত্ম্য","ত্ম্যা","ত্ম্যি","ত্ম্যী","ত্ম্যু","ত্ম্যূ","ত্ম্যে","ত্ম্যো","ত্য","ত্যা",
                                "ত্যি","ত্যী","ত্যু","ত্যূ","ত্যে","ত্যো","ত্র","ত্রা","ত্রি","ত্রী","ত্রু","ত্রূ","ত্রে","ত্রৈ","ত্রো","ত্র্য","ত্র্যা","ত্র্যি","ত্র্যী","ত্র্যু",
                                "ত্র্যূ","ত্র্যে","ত্র্যো","থ","থঁ","থা","থি","থিঁ","থী","থীঁ","থু","থুঁ","থূ","থূঁ","থৃ","থৃঁ","থে","থেঁ","থৈ","থো",
                                "থোঁ","থৌ","থৌঁ","থ্ব","থ্বা","থ্বি","থ্বী","থ্বু","থ্বূ","থ্বে","থ্বো","থ্য","থ্যা","থ্যি","থ্যী","থ্যু","থ্যূ","থ্যে","থ্যো","থ্র",
                                "থ্রা","থ্রি","থ্রী","থ্রু","থ্রূ","থ্রে","থ্রো","দ","দঁ","দা","দাঁ","দি","দিঁ","দী","দীঁ","দু","দুঁ","দূ","দূঁ","দূ্র্য",
                                "দৃ","দৃঁ","দে","দেঁ","দৈ","দো","দোঁ","দৌ","দৌঁ","দ্গ","দ্গা","দ্গি","দ্গী","দ্গু","দ্গূ","দ্গে","দ্গো","দ্ঘ","দ্ঘা","দ্ঘি",
                                "দ্ঘী","দ্ঘু","দ্ঘূ","দ্ঘে","দ্ঘো","দ্দ","দ্দা","দ্দি","দ্দী","দ্দু","দ্দূ","দ্দে","দ্দো","দ্দৌ","দ্ধ","দ্ধা","দ্ধি","দ্ধী","দ্ধু","দ্ধূ",
                                "দ্ধৃ","দ্ধে","দ্ধো","দ্ব","দ্বা","দ্বি","দ্বী","দ্বু","দ্বূ","দ্বৃ","দ্বে","দ্বৈ","দ্বো","দ্ব্য","দ্ব্যা","দ্ব্যি","দ্ব্যী","দ্ব্যু","দ্ব্যূ","দ্ব্যে",
                                "দ্ব্যো","দ্ভ","দ্ভা","দ্ভি","দ্ভী","দ্ভু","দ্ভূ","দ্ভে","দ্ভো","দ্ভ্রা","দ্ম","দ্মা","দ্মি","দ্মী","দ্মু","দ্মূ","দ্মে","দ্মো","দ্য","দ্যা",
                                "দ্যি","দ্যী","দ্যু","দ্যূ","দ্যে","দ্যো","দ্র","দ্রা","দ্রি","দ্রী","দ্রু","দ্রূ","দ্রে","দ্রো","দ্রৌ","দ্র্য","দ্র্যা","দ্র্যি","দ্র্যী","দ্র্যু",
                                "দ্র্যে","দ্র্যো","ধ","ধঁ","ধা","ধাঁ","ধি","ধিঁ","ধী","ধীঁ","ধু","ধুঁ","ধূ","ধূঁ","ধৃ","ধৃঁ","ধে","ধেঁ","ধৈ","ধো",
                                "ধোঁ","ধৌ","ধৌঁ","ধ্ন","ধ্না","ধ্নি","ধ্নী","ধ্নু","ধ্নূ","ধ্নে","ধ্নো","ধ্ব","ধ্বা","ধ্বি","ধ্বী","ধ্বু","ধ্বূ","ধ্বে","ধ্বো","ধ্ম",
                                "ধ্মা","ধ্মি","ধ্মী","ধ্মু","ধ্মূ","ধ্মে","ধ্মো","ধ্য","ধ্যা","ধ্যি","ধ্যী","ধ্যু","ধ্যূ","ধ্যে","ধ্যো","ধ্র","ধ্রা","ধ্রি","ধ্রী","ধ্রু",
                                "ধ্রূ","ধ্রে","ধ্রো","ন","নঁ","না","নি","নিঁ","নী","নীঁ","নু","নুঁ","নূ","নূঁ","নৃ","নৃঁ","নে","নেঁ","নৈ","নো",
                                "নোঁ","নৌ","নৌঁ","ন্জী","ন্জু","ন্ট","ন্টা","ন্টি","ন্টী","ন্টু","ন্টূ","ন্টে","ন্টো","ন্ট্রা","ন্ট্রি","ন্ট্রো","ন্ঠ","ন্ঠা","ন্ঠি","ন্ঠী",
                                "ন্ঠু","ন্ঠূ","ন্ঠে","ন্ঠো","ন্ড","ন্ডা","ন্ডি","ন্ডী","ন্ডু","ন্ডূ","ন্ডে","ন্ডো","ন্ড্র","ন্ড্রা","ন্ড্রি","ন্ড্রী","ন্ড্রু","ন্ড্রূ","ন্ড্রে","ন্ড্রো",
                                "ন্ত","ন্তা","ন্তি","ন্তী","ন্তু","ন্তূ","ন্তে","ন্তো","ন্ত্ব","ন্ত্বা","ন্ত্বি","ন্ত্বী","ন্ত্বু","ন্ত্বূ","ন্ত্বে","ন্ত্বো","ন্ত্য","ন্ত্যা","ন্ত্যি","ন্ত্যী",
                                "ন্ত্যু","ন্ত্যূ","ন্ত্যে","ন্ত্যো","ন্ত্র","ন্ত্রা","ন্ত্রি","ন্ত্রী","ন্ত্রু","ন্ত্রূ","ন্ত্রে","ন্ত্রো","ন্ত্র্য","ন্ত্র্যা","ন্ত্র্যি","ন্ত্র্যী","ন্ত্র্যু","ন্ত্র্যূ","ন্ত্র্যে","ন্ত্র্যো",
                                "ন্থ","ন্থা","ন্থি","ন্থী","ন্থে","ন্দ","ন্দা","ন্দি","ন্দী","ন্দু","ন্দূ","ন্দে","ন্দো","ন্দ্ব","ন্দ্বা","ন্দ্বি","ন্দ্বী","ন্দ্বু","ন্দ্বূ","ন্দ্বে",
                                "ন্দ্বো","ন্দ্য","ন্দ্যা","ন্দ্যি","ন্দ্যী","ন্দ্যু","ন্দ্যূ","ন্দ্যে","ন্দ্যো","ন্দ্র","ন্দ্রা","ন্দ্রি","ন্দ্রী","ন্দ্রু","ন্দ্রূ","ন্দ্রে","ন্দ্রো","ন্ধ","ন্ধা","ন্ধি",
                                "ন্ধী","ন্ধু","ন্ধূ","ন্ধূ্র","ন্ধে","ন্ধো","ন্ধ্য","ন্ধ্যা","ন্ধ্যি","ন্ধ্যী","ন্ধ্যু","ন্ধ্যূ","ন্ধ্যে","ন্ধ্যো","ন্ধ্র","ন্ধ্রা","ন্ধ্রি","ন্ধ্রী","ন্ধ্রু","ন্ধ্রে",
                                "ন্ধ্রো","ন্ন","ন্না","ন্নি","ন্নী","ন্নু","ন্নূ","ন্নে","ন্নো","ন্ন্য","ন্ন্যা","ন্ন্যি","ন্ন্যী","ন্ন্যু","ন্ন্যূ","ন্ন্যে","ন্ন্যো","ন্ব","ন্বা","ন্বি",
                                "ন্বী","ন্বু","ন্বূ","ন্বে","ন্বো","ন্ম","ন্মা","ন্মি","ন্মী","ন্মু","ন্মূ","ন্মে","ন্মো","ন্য","ন্যা","ন্যি","ন্যী","ন্যু","ন্যূ","ন্যে",
                                "ন্যো","ন্স","ন্সা","ন্সি","ন্সী","ন্সু","ন্সূ","ন্সে","ন্সো","ন্হ","ন্হা","ন্হি","ন্হী","ন্হু","ন্হূ","ন্হে","ন্হো","প","পঁ","পা",
                                "পাঁ","পি","পিঁ","পী","পীঁ","পু","পুঁ","পূ","পূঁ","পৃ","পৃঁ","পে","পেঁ","পৈ","পো","পোঁ","পৌ","পৌঁ","প্ট","প্টা",
                                "প্টি","প্টী","প্টু","প্টূ","প্টে","প্টো","প্ত","প্তা","প্তি","প্তী","প্তু","প্তূ","প্তে","প্তো","প্ন","প্না","প্নি","প্নী","প্নু","প্নূ",
                                "প্নে","প্নো","প্প","প্পা","প্পি","প্পী","প্পু","প্পূ","প্পে","প্পো","প্য","প্যা","প্যি","প্যী","প্যু","প্যূ","প্যে","প্যো","প্র","প্রা",
                                "প্রি","প্রী","প্রু","প্রূ","প্রে","প্রো","প্র্য","প্র্যা","প্র্যি","প্র্যী","প্র্যু","প্র্যূ","প্র্যে","প্র্যো","প্ল","প্লা","প্লি","প্লী","প্লু","প্লূ",
                                "প্লে","প্লো","প্ল্য","প্ল্যা","প্ল্যি","প্ল্যী","প্ল্যু","প্ল্যূ","প্ল্যে","প্ল্যো","প্স","প্সা","প্সি","প্সী","প্সু","প্সূ","প্সে","প্সো","ফ","ফঁ",
                                "ফা","ফাঁ","ফি","ফিঁ","ফী","ফীঁ","ফু","ফুঁ","ফূ","ফৃ","ফৃঁ","ফে","ফেঁ","ফৈ","ফো","ফোঁ","ফৌ","ফৌঁ","ফ্ট","ফ্ফ",
                                "ফ্যা","ফ্র","ফ্রা","ফ্রি","ফ্রী","ফ্রু","ফ্রূ","ফ্রে","ফ্রো","ফ্র্যা","ফ্ল","ফ্লা","ফ্লি","ফ্লী","ফ্লু","ফ্লূ","ফ্লে","ফ্লো","ফ্ল্য","ফ্ল্যা",
                                "ফ্ল্যি","ফ্ল্যী","ফ্ল্যু","ফ্ল্যূ","ফ্ল্যে","ফ্ল্যো","ব","বঁ","বা","বাঁ","বি","বিঁ","বী","বীঁ","বু","বুঁ","বূ","বূঁ","বৃ","বৃঁ",
                                "বে","বেঁ","বৈ","বো","বোঁ","বৌ","বৌঁ","ব্জ","ব্জা","ব্জি","ব্জী","ব্জু","ব্জূ","ব্জে","ব্জো","ব্দ","ব্দা","ব্দি","ব্দী","ব্দু",
                                "ব্দূ","ব্দে","ব্দো","ব্ধ","ব্ধা","ব্ধি","ব্ধী","ব্ধু","ব্ধূ","ব্ধে","ব্ধো","ব্ব","ব্বা","ব্বি","ব্বী","ব্বু","ব্বূ","ব্বে","ব্বো","ব্য",
                                "ব্যা","ব্যি","ব্যী","ব্যু","ব্যূ","ব্যে","ব্যো","ব্র","ব্রা","ব্রি","ব্রী","ব্রু","ব্রূ","ব্রে","ব্রো","ব্র্যা","ব্ল","ব্লা","ব্লি","ব্লী",
                                "ব্লু","ব্লূ","ব্লে","ব্লো","ব্ল্য","ব্ল্যা","ব্ল্যি","ব্ল্যী","ব্ল্যু","ব্ল্যূ","ব্ল্যে","ব্ল্যো","ভ","ভঁ","ভা","ভাঁ","ভি","ভিঁ","ভী","ভীঁ",
                                "ভু","ভুঁ","ভূ","ভূঁ","ভৃ","ভৃঁ","ভে","ভেঁ","ভৈ","ভো","ভোঁ","ভৌ","ভৌঁ","ভ্য","ভ্যা","ভ্যি","ভ্যী","ভ্যু","ভ্যূ","ভ্যে",
                                "ভ্যো","ভ্র","ভ্রা","ভ্রি","ভ্রী","ভ্রু","ভ্রূ","ভ্রে","ভ্রো","ভ্ল","ভ্লা","ভ্লি","ভ্লী","ভ্লু","ভ্লূ","ভ্লে","ভ্লো","ম","মঁ","মা",
                                "মি","মিঁ","মী","মীঁ","মু","মুঁ","মূ","মূঁ","মূ্ন","মৃ","মৃঁ","মে","মেঁ","মৈ","মো","মোঁ","মৌ","মৌঁ","ম্ন","ম্না",
                                "ম্নি","ম্নী","ম্নু","ম্নে","ম্নো","ম্প","ম্পা","ম্পি","ম্পী","ম্পু","ম্পূ","ম্পৃ","ম্পে","ম্পো","ম্প্র","ম্প্রা","ম্প্রি","ম্প্রী","ম্প্রু","ম্প্রূ",
                                "ম্প্রে","ম্প্রো","ম্ফ","ম্ফা","ম্ফি","ম্ফী","ম্ফু","ম্ফূ","ম্ফে","ম্ফো","ম্ব","ম্বা","ম্বি","ম্বী","ম্বু","ম্বূ","ম্বে","ম্বো","ম্ভ","ম্ভা",
                                "ম্ভি","ম্ভী","ম্ভু","ম্ভূ","ম্ভে","ম্ভো","ম্ভ্র","ম্ভ্রা","ম্ভ্রি","ম্ভ্রী","ম্ভ্রু","ম্ভ্রূ","ম্ভ্রে","ম্ভ্রো","ম্ম","ম্মা","ম্মি","ম্মী","ম্মু","ম্মূ",
                                "ম্মে","ম্মো","ম্য","ম্যা","ম্যি","ম্যী","ম্যু","ম্যূ","ম্যে","ম্যো","ম্র","ম্রা","ম্রি","ম্রী","ম্রু","ম্রূ","ম্রে","ম্রো","ম্ল","ম্লা",
                                "ম্লি","ম্লী","ম্লু","ম্লূ","ম্লে","ম্লো","য","যঁ","যা","যি","যিঁ","যী","যীঁ","যু","যুঁ","যূ","যূঁ","যৃ","যৃঁ","যে",
                                "যেঁ","যৈ","যো","যোঁ","যৌ","যৌঁ","য্য","য্যা","য্যি","য্যী","য্যু","য্যূ","য্যে","য্যো","র","রঁ","রা","রাঁ","রি","রিঁ",
                                "রী","রীঁ","রু","রুঁ","রূ","রূঁ","রৃ","রৃঁ","রে","রেঁ","রৈ","রো","রোঁ","রৌ","রৌঁ","র্ক","র্কা","র্কি","র্কী","র্কু",
                                "র্কূ","র্কে","র্কো","র্ক্য","র্ক্যা","র্ক্যু","র্ক্যে","র্ক্যো","র্ক্স","র্ক্সী","র্খ","র্খা","র্খি","র্খী","র্খু","র্খূ","র্খে","র্খো","র্খ্য","র্খ্যা",
                                "র্খ্যু","র্খ্যে","র্খ্যো","র্গ","র্গা","র্গি","র্গী","র্গু","র্গূ","র্গে","র্গো","র্গ্য","র্গ্যা","র্গ্যু","র্গ্যূ","র্গ্যে","র্গ্যো","র্ঘ","র্ঘা","র্ঘি",
                                "র্ঘী","র্ঘু","র্ঘূ","র্ঘে","র্ঘো","র্ঘ্য","র্ঘ্যা","র্ঘ্যু","র্ঘ্যূ","র্ঘ্যে","র্ঘ্যো","র্চ","র্চা","র্চি","র্চী","র্চু","র্চূ","র্চে","র্চো","র্চ্য",
                                "র্চ্যা","র্চ্যু","র্চ্যূ","র্চ্যে","র্চ্যো","র্ছ","র্ছা","র্ছি","র্ছী","র্ছু","র্ছূ","র্ছে","র্ছো","র্ছ্য","র্ছ্যা","র্ছ্যু","র্ছ্যূ","র্ছ্যে","র্ছ্যো","র্জ",
                                "র্জা","র্জি","র্জী","র্জু","র্জূ","র্জে","র্জো","র্জ্য","র্জ্যা","র্জ্যু","র্জ্যূ","র্জ্যে","র্জ্যো","র্ঝ","র্ঝা","র্ঝি","র্ঝী","র্ঝু","র্ঝূ","র্ঝে",
                                "র্ঝো","র্ঝ্য","র্ঝ্যা","র্ঝ্যু","র্ঝ্যূ","র্ঝ্যে","র্ঝ্যো","র্ট","র্টা","র্টি","র্টী","র্টু","র্টূ","র্টে","র্টো","র্ট্য","র্ট্যা","র্ট্যু","র্ট্যূ","র্ট্যে",
                                "র্ট্যো","র্ঠ","র্ঠা","র্ঠি","র্ঠী","র্ঠু","র্ঠূ","র্ঠে","র্ঠো","র্ঠ্য","র্ঠ্যা","র্ঠ্যু","র্ঠ্যূ","র্ঠ্যে","র্ঠ্যো","র্ড","র্ডা","র্ডি","র্ডী","র্ডু",
                                "র্ডূ","র্ডে","র্ডো","র্ড্য","র্ড্যা","র্ড্যু","র্ড্যূ","র্ড্যে","র্ড্যো","র্ঢ","র্ঢা","র্ঢি","র্ঢী","র্ঢু","র্ঢূ","র্ঢে","র্ঢো","র্ঢ্য","র্ঢ্যা","র্ঢ্যু",
                                "র্ঢ্যূ","র্ঢ্যে","র্ঢ্যো","র্ণ","র্ণা","র্ণি","র্ণী","র্ণু","র্ণূ","র্ণে","র্ণো","র্ণ্য","র্ণ্যা","র্ণ্যু","র্ণ্যূ","র্ণ্যে","র্ণ্যো","র্ত","র্তা","র্তি",
                                "র্তী","র্তু","র্তূ","র্তৃ","র্তে","র্তো","র্ত্ত","র্ত্তী","র্ত্য","র্ত্যা","র্ত্যু","র্ত্যূ","র্ত্যে","র্ত্যো","র্ত্রী","র্ত্রে","র্থ","র্থা","র্থি","র্থী",
                                "র্থু","র্থূ","র্থে","র্থো","র্থ্য","র্থ্যা","র্থ্যু","র্থ্যূ","র্থ্যে","র্থ্যো","র্দ","র্দা","র্দি","র্দী","র্দু","র্দূ","র্দৃ","র্দে","র্দো","র্দ্দ",
                                "র্দ্দা","র্দ্ধ","র্দ্ধে","র্দ্ব","র্দ্বি","র্দ্য","র্দ্যা","র্দ্যু","র্দ্যূ","র্দ্যে","র্দ্যো","র্দ্র","র্ধ","র্ধা","র্ধি","র্ধী","র্ধু","র্ধূ","র্ধে","র্ধো",
                                "র্ধ্ব","র্ধ্বে","র্ধ্য","র্ধ্যা","র্ধ্যু","র্ধ্যূ","র্ধ্যে","র্ধ্যো","র্ন","র্না","র্নি","র্নী","র্নু","র্নূ","র্নে","র্নো","র্ন্ত","র্ন্য","র্ন্যা","র্ন্যু",
                                "র্ন্যূ","র্ন্যে","র্ন্যো","র্প","র্পা","র্পি","র্পী","র্পু","র্পূ","র্পে","র্পো","র্প্য","র্প্যা","র্প্যু","র্প্যূ","র্প্যে","র্প্যো","র্ফ","র্ফা","র্ফি",
                                "র্ফী","র্ফু","র্ফূ","র্ফে","র্ফো","র্ফ্য","র্ফ্যা","র্ফ্যু","র্ফ্যূ","র্ফ্যে","র্ফ্যো","র্ব","র্বা","র্বি","র্বী","র্বু","র্বূ","র্বৃ","র্বে","র্বো",
                                "র্ব্ব","র্ব্য","র্ব্যা","র্ব্যু","র্ব্যূ","র্ব্যে","র্ব্যো","র্ভ","র্ভা","র্ভি","র্ভী","র্ভু","র্ভূ","র্ভে","র্ভো","র্ভ্য","র্ভ্যা","র্ভ্যু","র্ভ্যূ","র্ভ্যে",
                                "র্ভ্যো","র্ম","র্মা","র্মি","র্মী","র্মু","র্মূ","র্মে","র্মো","র্ম্ম","র্ম্য","র্ম্যা","র্ম্যু","র্ম্যূ","র্ম্যে","র্ম্যো","র্য","র্যা","র্যি","র্যী",
                                "র্যু","র্যূ","র্যে","র্যো","র্য্য","র্য্যা","র্য্যু","র্য্যূ","র্য্যে","র্য্যো","র্র","র্রা","র্রি","র্রী","র্রু","র্রূ","র্রে","র্রো","র্র্য","র্র্যা",
                                "র্র্যু","র্র্যূ","র্র্যে","র্র্যো","র্ল","র্লা","র্লি","র্লী","র্লু","র্লূ","র্লে","র্লো","র্ল্ড","র্ল্য","র্ল্যা","র্ল্যু","র্ল্যূ","র্ল্যে","র্ল্যো","র্শ",
                                "র্শা","র্শি","র্শী","র্শু","র্শূ","র্শে","র্শো","র্শ্ব","র্শ্বি","র্শ্বে","র্শ্য","র্শ্যা","র্শ্যু","র্শ্যূ","র্শ্যে","র্শ্যো","র্ষ","র্ষা","র্ষি","র্ষী",
                                "র্ষু","র্ষূ","র্ষে","র্ষো","র্ষ্য","র্ষ্যা","র্ষ্যু","র্ষ্যূ","র্ষ্যে","র্ষ্যো","র্স","র্সা","র্সি","র্সী","র্সু","র্সূ","র্সে","র্সো","র্স্ট","র্স্থা",
                                "র্স্য","র্স্যা","র্স্যু","র্স্যূ","র্স্যে","র্স্যো","র্হ","র্হা","র্হি","র্হী","র্হু","র্হূ","র্হে","র্হো","র্হ্য","র্হ্যা","র্হ্যু","র্হ্যূ","র্হ্যে","র্হ্যো",
                                "র্ড়","র্ড়া","র্ড়ি","র্ড়ী","র্ড়ু","র্ড়ূ","র্ড়ে","র্ড়ো","র্ড়্য","র্ড়্যা","র্ড়্যু","র্ড়্যূ","র্ড়্যে","র্ড়্যো","র্ঢ়","র্ঢ়া","র্ঢ়ি","র্ঢ়ী","র্ঢ়ু","র্ঢ়ূ",
                                "র্ঢ়ে","র্ঢ়ো","র্ঢ়্য","র্ঢ়্যা","র্ঢ়্যু","র্ঢ়্যূ","র্ঢ়্যে","র্ঢ়্যো","র্য়","র্য়া","র্য়ি","র্য়ী","র্য়ু","র্য়ূ","র্য়ে","র্য়ো","র্য়্য","র্য়্যা","র্য়্যু","র্য়্যূ",
                                "র্য়্যে","র্য়্যো","র‍্যা","ল","লঁ","লা","লি","লিঁ","লী","লীঁ","লু","লুঁ","লূ","লূঁ","লৃ","লৃঁ","লে","লেঁ","লৈ","লো",
                                "লোঁ","লৌ","লৌঁ","ল্ক","ল্কা","ল্কি","ল্কী","ল্কু","ল্কূ","ল্কে","ল্কো","ল্ক্য","ল্ক্যা","ল্ক্যি","ল্ক্যী","ল্ক্যু","ল্ক্যূ","ল্ক্যে","ল্ক্যো","ল্গ",
                                "ল্গা","ল্গি","ল্গী","ল্গু","ল্গূ","ল্গে","ল্গো","ল্ট","ল্টা","ল্টি","ল্টী","ল্টু","ল্টূ","ল্টে","ল্টো","ল্ড","ল্ডা","ল্ডি","ল্ডী","ল্ডু",
                                "ল্ডূ","ল্ডে","ল্ডো","ল্প","ল্পা","ল্পি","ল্পী","ল্পু","ল্পূ","ল্পে","ল্পো","ল্ফ","ল্ফা","ল্ফি","ল্ফী","ল্ফু","ল্ফূ","ল্ফে","ল্ফো","ল্ব",
                                "ল্বা","ল্বি","ল্বী","ল্বু","ল্বূ","ল্বে","ল্বো","ল্ভ","ল্ভা","ল্ভি","ল্ভী","ল্ভু","ল্ভূ","ল্ভে","ল্ভো","ল্ম","ল্মা","ল্মি","ল্মী","ল্মু",
                                "ল্মূ","ল্মে","ল্মো","ল্য","ল্যা","ল্যি","ল্যী","ল্যু","ল্যূ","ল্যে","ল্যো","ল্ল","ল্লা","ল্লি","ল্লী","ল্লু","ল্লূ","ল্লে","ল্লো","শ",
                                "শঁ","শা","শি","শিঁ","শী","শীঁ","শু","শুঁ","শূ","শূঁ","শৃ","শৃঁ","শে","শেঁ","শৈ","শো","শোঁ","শৌ","শৌঁ","শ্চ",
                                "শ্চা","শ্চি","শ্চী","শ্চু","শ্চূ","শ্চে","শ্চো","শ্ছ","শ্ছা","শ্ছি","শ্ছী","শ্ছু","শ্ছূ","শ্ছে","শ্ছো","শ্ন","শ্না","শ্নি","শ্নী","শ্নু",
                                "শ্নূ","শ্নে","শ্নো","শ্ব","শ্বা","শ্বি","শ্বী","শ্বু","শ্বূ","শ্বে","শ্বো","শ্ম","শ্মা","শ্মি","শ্মী","শ্মু","শ্মূ","শ্মে","শ্মো","শ্য",
                                "শ্যা","শ্যি","শ্যী","শ্যু","শ্যূ","শ্যে","শ্যো","শ্র","শ্রা","শ্রি","শ্রী","শ্রু","শ্রূ","শ্রে","শ্রো","শ্ল","শ্লা","শ্লি","শ্লী","শ্লু",
                                "শ্লে","শ্লো","ষ","ষঁ","ষা","ষি","ষিঁ","ষী","ষীঁ","ষু","ষুঁ","ষূ","ষূঁ","ষৃ","ষৃঁ","ষে","ষেঁ","ষৈ","ষো","ষোঁ",
                                "ষৌ","ষৌঁ","ষ্ক","ষ্কা","ষ্কি","ষ্কী","ষ্কু","ষ্কূ","ষ্কৃ","ষ্কে","ষ্কো","ষ্ক্র","ষ্ক্রা","ষ্ক্রি","ষ্ক্রী","ষ্ক্রু","ষ্ক্রে","ষ্ক্রো","ষ্ট","ষ্টা",
                                "ষ্টি","ষ্টী","ষ্টু","ষ্টূ","ষ্টূ্র","ষ্টে","ষ্টো","ষ্ট্য","ষ্ট্যা","ষ্ট্যি","ষ্ট্যী","ষ্ট্যু","ষ্ট্যূ","ষ্ট্যে","ষ্ট্যো","ষ্ট্র","ষ্ট্রা","ষ্ট্রি","ষ্ট্রী","ষ্ট্রু",
                                "ষ্ট্রে","ষ্ট্রো","ষ্ঠ","ষ্ঠা","ষ্ঠি","ষ্ঠী","ষ্ঠু","ষ্ঠূ","ষ্ঠে","ষ্ঠো","ষ্ঠ্য","ষ্ঠ্যা","ষ্ঠ্যি","ষ্ঠ্যী","ষ্ঠ্যু","ষ্ঠ্যূ","ষ্ঠ্যে","ষ্ঠ্যো","ষ্ণ","ষ্ণা",
                                "ষ্ণি","ষ্ণী","ষ্ণু","ষ্ণূ","ষ্ণে","ষ্ণো","ষ্ণ্য","ষ্ণ্যা","ষ্ণ্যি","ষ্ণ্যী","ষ্ণ্যু","ষ্ণ্যূ","ষ্ণ্যে","ষ্ণ্যো","ষ্ণ্হ","ষ্প","ষ্পা","ষ্পি","ষ্পী","ষ্পু",
                                "ষ্পূ","ষ্পে","ষ্পো","ষ্প্র","ষ্প্রা","ষ্প্রি","ষ্প্রী","ষ্প্রু","ষ্প্রূ","ষ্প্রে","ষ্প্রো","ষ্ফ","ষ্ফা","ষ্ফি","ষ্ফী","ষ্ফু","ষ্ফূ","ষ্ফে","ষ্ফো","ষ্ব",
                                "ষ্বা","ষ্বি","ষ্বী","ষ্বু","ষ্বূ","ষ্বে","ষ্বো","ষ্ম","ষ্মা","ষ্মি","ষ্মী","ষ্মু","ষ্মূ","ষ্মে","ষ্মো","ষ্ম্য","ষ্ম্যা","ষ্ম্যি","ষ্ম্যী","ষ্ম্যু",
                                "ষ্ম্যূ","ষ্ম্যে","ষ্ম্যো","ষ্য","ষ্যা","ষ্যি","ষ্যী","ষ্যু","ষ্যূ","ষ্যে","ষ্যো","ষ্ূক্র","স","সঁ","সা","সাঁ","সি","সিঁ","সী","সীঁ",
                                "সু","সুঁ","সূ","সূঁ","সৃ","সৃঁ","সে","সেঁ","সৈ","সো","সোঁ","সৌ","সৌঁ","স্ক","স্কা","স্কি","স্কী","স্কু","স্কূ","স্কৃ",
                                "স্কে","স্কো","স্ক্যা","স্ক্র","স্ক্রা","স্ক্রি","স্ক্রী","স্ক্রু","স্ক্রূ","স্ক্রে","স্ক্রো","স্খ","স্খা","স্খি","স্খী","স্খু","স্খূ","স্খে","স্খো","স্ট",
                                "স্টা","স্টি","স্টী","স্টু","স্টূ","স্টে","স্টো","স্ট্য","স্ট্যা","স্ট্যি","স্ট্যী","স্ট্যু","স্ট্যূ","স্ট্যে","স্ট্যো","স্ট্র","স্ট্রা","স্ট্রি","স্ট্রী","স্ট্রু",
                                "স্ট্রূ","স্ট্রে","স্ট্রো","স্ট্র্যা","স্ত","স্তা","স্তি","স্তী","স্তু","স্তূ","স্তৃ","স্তে","স্তো","স্ত্য","স্ত্যা","স্ত্যি","স্ত্যী","স্ত্যু","স্ত্যূ","স্ত্যে",
                                "স্ত্যো","স্ত্র","স্ত্রা","স্ত্রি","স্ত্রী","স্ত্রু","স্ত্রূ","স্ত্রে","স্ত্রো","স্থ","স্থা","স্থি","স্থূ","স্থে","স্থ্য","স্থ্যে","স্ন","স্না","স্নি","স্নী",
                                "স্নু","স্নূ","স্নে","স্নো","স্প","স্পা","স্পি","স্পী","স্পু","স্পূ","স্পৃ","স্পে","স্পো","স্প্যা","স্প্রা","স্প্রি","স্ফ","স্ফা","স্ফি","স্ফী",
                                "স্ফু","স্ফূ","স্ফে","স্ফো","স্ব","স্বা","স্বি","স্বী","স্বু","স্বূ","স্বে","স্বৈ","স্বো","স্ম","স্মা","স্মি","স্মী","স্মু","স্মূ","স্মৃ",
                                "স্মে","স্মো","স্য","স্যা","স্যি","স্যী","স্যু","স্যূ","স্যে","স্যো","স্র","স্রা","স্রি","স্রী","স্রু","স্রূ","স্রে","স্রো","স্ল","স্লা",
                                "স্লি","স্লী","স্লূ","স্লে","স্লো","স্সু","স্হ","স্হা","স্হি","স্হী","স্হু","স্হূ","স্হে","স্হো","স্হ্য","স্হ্যা","স্হ্যি","স্হ্যী","স্হ্যু","স্হ্যূ",
                                "স্হ্যে","স্হ্যো","হ","হঁ","হা","হাঁ","হি","হিঁ","হী","হীঁ","হু","হুঁ","হূ","হূঁ","হৃ","হৃঁ","হে","হেঁ","হৈ","হো",
                                "হোঁ","হৌ","হৌঁ","হ্ণ","হ্ণা","হ্ণি","হ্ণী","হ্ণু","হ্ণূ","হ্ণে","হ্ণো","হ্ন","হ্না","হ্নি","হ্নী","হ্নু","হ্নূ","হ্নে","হ্নো","হ্ব",
                                "হ্বা","হ্বি","হ্বী","হ্বু","হ্বূ","হ্বে","হ্বো","হ্ম","হ্মা","হ্মি","হ্মী","হ্মু","হ্মূ","হ্মে","হ্মো","হ্য","হ্যা","হ্যি","হ্যী","হ্যু",
                                "হ্যূ","হ্যে","হ্যো","হ্র","হ্রা","হ্রি","হ্রী","হ্রু","হ্রূ","হ্রে","হ্রো","হ্ল","হ্লা","হ্লি","হ্লী","হ্লু","হ্লূ","হ্লে","হ্লো","ৎ",
                                "ড়","ড়ঁ","ড়া","ড়ি","ড়িঁ","ড়ী","ড়ীঁ","ড়ু","ড়ুঁ","ড়ূ","ড়ূঁ","ড়ৃ","ড়ে","ড়েঁ","ড়ৈ","ড়ো","ড়োঁ","ড়ৌ","ড়ৌঁ","ড়্গ",
                                "ড়্গা","ড়্গি","ড়্গী","ড়্গু","ড়্গূ","ড়্গে","ড়্গো","ঢ়","ঢ়ঁ","ঢ়া","ঢ়ি","ঢ়িঁ","ঢ়ী","ঢ়ীঁ","ঢ়ু","ঢ়ুঁ","ঢ়ূ","ঢ়ূঁ","ঢ়ৃ","ঢ়ে",
                                "ঢ়েঁ","ঢ়ৈ","ঢ়ো","ঢ়োঁ","ঢ়ৌ","ঢ়ৌঁ","য়","য়ঁ","য়া","য়ি","য়িঁ","য়ী","য়ীঁ","য়ু","য়ুঁ","য়ূ","য়ূঁ","য়ৃ","য়ে","য়েঁ",
                                "য়ৈ","য়ো","য়োঁ","য়ৌ","য়ৌঁ","য়্যা"] 
    roots                    =  ["ং","ঃ","অ","আ","ই","ঈ","উ","ঊ","ঋ","এ","ঐ","ও","ঔ","ক","ক্ক","ক্ট","ক্ত","ক্ন","ক্ব","ক্ম","ক্ল",
                                "ক্ষ","ক্ষ্ণ","ক্ষ্ব","ক্ষ্ম","ক্স","খ","গ","গ্গ","গ্দ","গ্ধ","গ্ন","গ্ব","গ্ম","গ্ল","ঘ","ঘ্ন","ঙ","ঙ্ক","ঙ্ক্ত","ঙ্ক্ষ",
                                "ঙ্খ","ঙ্গ","ঙ্ঘ","ঙ্ম","চ","চ্চ","চ্ছ","চ্ছ্ব","চ্ঞ","চ্ব","ছ","জ","জ্জ","জ্জ্ব","জ্ঝ","জ্ঞ","জ্ব","ঝ","ঞ","ঞ্চ",
                                "ঞ্ছ","ঞ্জ","ঞ্ঝ","ট","ট্ট","ট্ব","ট্ম","ঠ","ড","ড়্গ","ড্ড","ড্ব","ড্ম","ঢ","ণ","ণ্ট","ণ্ঠ","ণ্ড","ণ্ঢ","ণ্ণ",
                                "ণ্ব","ণ্ম","ত","ত্ত","ত্ত্ব","ত্থ","ত্ন","ত্ব","ত্ম","থ","থ্ব","দ","দ্গ","দ্ঘ","দ্দ","দ্দ্ব","দ্ধ","দ্ব","দ্ভ","দ্ম",
                                "ধ","ধ্ন","ধ্ব","ধ্ম","ন","ন্জ","ন্ট","ন্ঠ","ন্ড","ন্ত","ন্ত্ব","ন্থ","ন্দ","ন্দ্ব","ন্ধ","ন্ন","ন্ব","ন্ম","ন্স","ন্হ",
                                "প","প্ট","প্ত","প্ন","প্প","প্ল","প্স","ফ","ফ্ট","ফ্ফ","ফ্ল","ব","ব্জ","ব্দ","ব্ধ","ব্ব","ব্ল","ভ","ভ্ব","ভ্ল",
                                "ম","ম্ন","ম্প","ম্ফ","ম্ব","ম্ভ","ম্ম","ম্ল","য","র","ল","ল্ক","ল্গ","ল্ট","ল্ড","ল্প","ল্ফ","ল্ব","ল্ভ","ল্ম",
                                "ল্ল","শ","শ্চ","শ্ছ","শ্ন","শ্ব","শ্ম","শ্ল","ষ","ষ্ক","ষ্ট","ষ্ঠ","ষ্ণ","ষ্ণ্হ","ষ্প","ষ্ফ","ষ্ব","ষ্ম","স","স্ক",
                                "স্খ","স্ট","স্ত","স্ত্ব","স্থ","স্ন","স্প","স্ফ","স্ব","স্ম","স্ল","স্স","স্হ","হ","হ্ণ","হ্ন","হ্ব","হ্ম","হ্ল","ৎ",
                                "ড়","ড়্গ","ঢ়","য়",'প্ব', 'ক্ষ্ন','ম্ষ', 'ছ্ব', 'ষ্ন', 'ল্থ','শ্ট','গ্ণ']
    
    # vocab
    unicodes                 =    ['']+sorted(vowels+consonants+vowel_diacritics+consonant_diacritics+special_charecters+numbers+punctuations) 
    components               =    ['']+sorted(roots+vowel_diacritics+consonant_diacritics+special_charecters+numbers+punctuations)
    valid                    =    ['']+sorted(dict_graphemes+numbers+punctuations)
#------------------------------------------------------------------------------------------------------------------------------------------------------
#######################################################################################################################################################
#------------------------------------------------------------------------------------------------------------------------------------------------------

class gujrati:
    iden                   =    "gujrati"

    numbers                =    ['૦', '૧', '૨', '૩', '૪', '૫', '૬', '૭', '૮' , '૯'] 
    punctuations           =    ['!', '"', '#', '$', '%', '&', "'", '(', ')', '*', '+', ',', '-', '.', 
                                 '/', ':', ';', '<', '=', '>', '?', '@', '[', '\\', ']', '^', '_', '`',
                                 '{', '|', '}', '~', '।', '॥'] # dari nite hobe. 
    # for grapheme decomp
    vowel_diacritics       =    ['ૢ', 'ૣ', 'ૃ', 'ૄ', 'ા', 'િ', 'ી', 'ુ', 'ૂ', 'ૃ', 'ૄ', 'ૅ', 'ે', 'ૈ', 'ૉ', 'ો', 'ૌ' ] 
    vocalics               =    []
    # vocalics added with vowel_diacritics here
    consonant_diacritics   =    ['ૺ', 'ૻ', 'ૼ', '૽', '૾', '૿', 'ઁ', 'ં', 'ઃ']+vocalics
    modifiers              =    []
    connector              =    '્'
    special_charecters     =    [connector,'\u200d']
    allow_conn_ending      =    True
    # vocab parts
    _unicodes              =    ['-','ઁ','ં','ઃ','અ','આ','ઇ','ઈ','ઉ','ઊ','ઋ','ઍ','એ','ઐ','ઑ','ઓ','ઔ','ક','ખ','ગ','ઘ',
                                'ઙ','ચ','છ','જ','ઝ','ઞ','ટ','ઠ','ડ','ઢ','ણ','ત','થ','દ','ધ','ન','પ','ફ','બ','ભ',
                                'મ','ય','ર','લ','ળ','વ','શ','ષ','સ','હ','઼','ઽ','ા','િ','ી','ુ','ૂ','ૃ','ૄ','ૅ',
                                'ે','ૈ','ૉ','ો','ૌ','્','ૐ','૦','૧','૨','૩','૪','૫','૬','૭','૮','૯','૱']
    _components            =    ['-','ઁ','ં','ઃ','અ','આ','ઇ','ઈ','ઉ','ઊ','ઋ','ઍ','એ','ઐ','ઑ','ઓ','ઔ','ક','ક્ક','ક્ચ',
                                'ક્ઝ','ક્ટ','ક્ટ્ર','ક્ટ્સ','ક્ડ','ક્ત','ક્ધ','ક્ન','ક્મ','ક્ય','ક્ર','ક્લ','ક્વ','ક્શ','ક્ષ','ક્ષ્મ','ક્ષ્ય','ક્સ','ક્સ્ચ','ક્સ્ટ',
                                'ક્સ્ટ્ર','ક્સ્ડ','ક્સ્પ','ક્સ્લ','ખ','ખ્ખ','ખ્ત','ખ્ય','ખ્ર','ખ્સ','ગ','ગ્ગ','ગ્ગ્સ','ગ્ઝ','ગ્દ','ગ્ધ','ગ્ન','ગ્બ','ગ્મ','ગ્ય',
                                'ગ્ર','ગ્લ','ગ્વ','ગ્શ','ગ્સ','ઘ','ઘ્ધ','ઘ્ય','ઙ્ક','ચ','ચ્ચ','ચ્છ','ચ્ય','છ','છ્ય','જ','જ્જ','જ્ઞ','જ્ય','જ્ર',
                                'જ્વ','જ્હ','ઝ','ઝ્ળ','ટ','ટ્ટ','ટ્ત્ઝ','ટ્ય','ટ્ર','ટ્વ','ટ્સ','ઠ','ઠ્ઠ','ડ','ડ્જ','ડ્ઝ','ડ્ડ','ડ્ય','ડ્ર','ડ્વ',
                                'ડ્સ','ઢ','ઢ્ઢ','ઢ્ય','ણ','ણ્ય','ત','ત્ક','ત્ઝ','ત્ત','ત્ત્વ','ત્ન','ત્પ','ત્મ','ત્ય','ત્ર','ત્ર્ય','ત્વ','ત્સ','ત્સ્ન',
                                'ત્સ્ય','થ','થ્થ','થ્ય','થ્ર','થ્લ','થ્વ','દ','દ્ઉ','દ્ઘ','દ્દ','દ્ધ','દ્ભ','દ્ય','દ્ર','દ્વ','ધ','ધ્ધ','ધ્ય','ધ્ર',
                                'ધ્વ','ન','ન્ક','ન્ગ','ન્ચ','ન્જ','ન્ઝ','ન્ટ','ન્ટ્ર','ન્ટ્સ','ન્ડ','ન્ડ્ઝ','ન્ડ્ર','ન્ડ્સ','ન્ત','ન્દ','ન્દ્ર','ન્ધ','ન્ન','ન્ફ',
                                'ન્ફ્ર','ન્ફ્લ','ન્મ','ન્મ્ય','ન્ય','ન્લ','ન્વ','ન્શ','ન્સ','ન્સ્ટ','ન્સ્ટ્ર','ન્સ્પ','ન્હ','પ','પ્ટ','પ્ત','પ્ન','પ્પ','પ્ય','પ્ર',
                                'પ્લ','પ્શ','પ્સ','ફ','ફ્ટ','ફ્ત','ફ્ફ','ફ્ય','ફ્ર','ફ્લ','બ','બ્જ','બ્દ','બ્ધ','બ્બ','બ્ય','બ્ર','બ્લ','બ્સ','ભ',
                                'ભ્ય','ભ્ર','મ','મ્ક','મ્ત','મ્થ','મ્ન','મ્પ','મ્પ્ન','મ્પ્ય','મ્પ્લ','મ્બ','મ્મ','મ્ય','મ્વ','મ્સ','મ્હ','ય','ર','ર્આ',
                                'ર્ઇ','ર્ઓ','ર્ક','ર્ક્ય','ર્ક્ષ','ર્ક્સ','ર્ગ','ર્ઘ','ર્ચ','ર્ચ્ય','ર્જ','ર્ઝ','ર્ટ','ર્ટ્ર','ર્ટ્સ','ર્ડ','ર્ડ્સ','ર્ણ','ર્ત','ર્થ',
                                'ર્થ્ર','ર્દ','ર્ધ','ર્ન','ર્ન્ટ','ર્ન્ડ','ર્ન્સ્ટ','ર્પ','ર્ફ','ર્બ','ર્ભ','ર્મ','ર્મ્ય','ર્ય','ર્ર','ર્લ','ર્લ્ડ','ર્લ્સ','ર્વ','ર્વ્ય',
                                'ર્શ','ર્શ્ય','ર્ષ','ર્ષ્ય','ર્સ','ર્સ્ટ','લ','લ્ક','લ્જ','લ્ટ','લ્ટ્ર','લ્ડ','લ્થ','લ્ન્ટ','લ્પ','લ્પ્સ','લ્ફ','લ્બ','લ્મ','લ્મ્સ',
                                'લ્ય','લ્લ','લ્વ','લ્સ','લ્હ','ળ','ળ્ય','વ','વ્ઝ','વ્ય','વ્ર','વ્સ','વ્હ','શ','શ્ક','શ્ગ','શ્ચ','શ્ડ','શ્ત','શ્ન',
                                'શ્બ','શ્મ','શ્ય','શ્ર','શ્ર્ચ','શ્ર્ન','શ્ર્વ','શ્લ','શ્વ','ષ','ષ્ક','ષ્ક્ર','ષ્ટ','ષ્ટ્ર','ષ્ટ્ર્ચ','ષ્ટ્ર્ર','ષ્ઠ','ષ્ણ','ષ્ન','ષ્પ',
                                'ષ્ફ','ષ્મ','ષ્ય','સ','સ્ક','સ્ક્ય','સ્ક્ર','સ્ક્વ','સ્ચ','સ્જ','સ્ટ','સ્ટ્ર','સ્ટ્સ','સ્ડ','સ્ત','સ્ત્ર','સ્થ','સ્થ્ય','સ્ન','સ્પ',
                                'સ્પ્લ','સ્ફ','સ્બ','સ્મ','સ્ય','સ્ર્ટ','સ્લ','સ્વ','સ્સ','સ્સ્ટ્ર','હ','હ્ન','હ્મ','હ્ય','઼','ઽ','ા','િ','િ્ર','ી',
                                'ુ','ુ્ર','ૂ','ૂ્ર','ૃ','ૄ','ૅ','ે','ે્ર','ૈ','ૉ','ો','ૌ','્','ૐ','૦','૧','૨','૩','૪',
                                '૫','૬','૭','૮','૯','૱',]
    dict_graphemes         =    ['-','ઁ','ં','ઃ','અ','આ','ઇ','ઈ','ઉ','ઊ','ઋ','ઍ','એ','એિ','ઐ','ઑ','ઓ','ઓે','ઔ','ક','કા',
                                'કિ','કિા','કી','કુ','કૂ','કૃ','કે','કૈ','કૉ','કો','કૌ','ક્ક','ક્કા','ક્કિ','ક્કી','ક્ચ','ક્ઝિ','ક્ઝી','ક્ઝુ','ક્ટ',
                                'ક્ટિ','ક્ટી','ક્ટે','ક્ટો','ક્ટ્ર','ક્ટ્રે','ક્ટ્રો','ક્ટ્સ','ક્ડ','ક્ત','ક્તા','ક્તિ','ક્તો','ક્ધ','ક્નો','ક્મ','ક્ય','ક્યા','ક્યુ','ક્યૂ',
                                'ક્યો','ક્ર','ક્રા','ક્રિ','ક્રી','ક્રુ','ક્રૂ','ક્રે','ક્રો','ક્લ','ક્લા','ક્લિ','ક્લી','ક્લે','ક્લો','ક્વા','ક્વિ','ક્વી','ક્વે','ક્વો',
                                'ક્શ','ક્ષ','ક્ષા','ક્ષિ','ક્ષી','ક્ષે','ક્ષો','ક્ષ્મી','ક્ષ્યા','ક્સ','ક્સા','ક્સિ','ક્સી','ક્સે','ક્સ્ચે','ક્સ્ટ','ક્સ્ટ્રા','ક્સ્ડ','ક્સ્પો','ક્સ્લુ',
                                'ખ','ખા','ખિ','ખી','ખુ','ખૂ','ખે','ખૈ','ખો','ખ્ખી','ખ્ખુ','ખ્ખો','ખ્ત','ખ્તા','ખ્ય','ખ્યા','ખ્યુ','ખ્યો','ખ્રિ','ખ્સ',
                                'ખ્સો','ગ','ગા','ગિ','ગી','ગુ','ગૂ','ગૃ','ગૅ','ગે','ગૉ','ગો','ગૌ','ગ્ગા','ગ્ગ્સ','ગ્ઝ','ગ્દ','ગ્ધ','ગ્ન','ગ્ની',
                                'ગ્ને','ગ્નો','ગ્બા','ગ્મા','ગ્ય','ગ્યા','ગ્યુ','ગ્યો','ગ્ર','ગ્રા','ગ્રિ','ગ્રી','ગ્રુ','ગ્રૂ','ગ્રે','ગ્રો','ગ્લા','ગ્લિ','ગ્લી','ગ્લે',
                                'ગ્લૉ','ગ્લો','ગ્વા','ગ્વિ','ગ્શુ','ગ્સ','ઘ','ઘા','ઘી','ઘુ','ઘૂ','ઘૃ','ઘે','ઘો','ઘ્ધ','ઘ્ય','ઙ્કો','ચ','ચા','ચિ',
                                'ચી','ચુ','ચૂ','ચે','ચૈ','ચૉ','ચો','ચૌ','ચ્ચ','ચ્ચા','ચ્ચે','ચ્છ','ચ્છા','ચ્છી','ચ્છુ','ચ્યા','ચ્યુ','ચ્યો','છ','છા',
                                'છિ','છી','છુ','છૂ','છે','છો','છ્યુ','છ્યો','જ','જા','જિ','જી','જુ','જૂ','જે','જૈ','જો','જ્જ','જ્જિ','જ્જો',
                                'જ્ઞ','જ્ઞા','જ્ઞાા','જ્ઞાો','જ્ઞિ','જ્ઞે','જ્ય','જ્યા','જ્યુ','જ્યો','જ્ર','જ્વા','જ્વે','જ્હો','ઝ','ઝા','ઝિ','ઝી','ઝુ','ઝૂ',
                                'ઝે','ઝેૄ','ઝો','ઝ્ળી','ટ','ટા','ટિ','ટી','ટુ','ટૂ','ટે','ટૉ','ટો','ટૌ','ટ્ટ','ટ્ટા','ટ્ટી','ટ્ટે','ટ્ત્ઝ','ટ્યા',
                                'ટ્યુ','ટ્યૂ','ટ્યો','ટ્ર','ટ્રા','ટ્રિ','ટ્રી','ટ્રે','ટ્રો','ટ્વી','ટ્સ','ઠ','ઠા','ઠિ','ઠી','ઠુ','ઠે','ઠો','ઠ્ઠ','ઠ્ઠી',
                                'ડ','ડા','ડિ','ડી','ડુ','ડૂ','ડે','ડૉ','ડો','ડ્જ','ડ્ઝ','ડ્ડ','ડ્ડી','ડ્ડો','ડ્યા','ડ્યુ','ડ્યૂ','ડ્યો','ડ્ર','ડ્રા',
                                'ડ્રિ','ડ્રી','ડ્રે','ડ્રો','ડ્વ','ડ્વા','ડ્વો','ડ્સ','ડ્સે','ઢ','ઢા','ઢિ','ઢી','ઢુ','ઢે','ઢો','ઢ્ઢા','ઢ્યા','ણ','ણા',
                                'ણિ','ણી','ણુ','ણૂ','ણે','ણો','ણ્ય','ણ્યા','ણ્યુ','ણ્યો','ત','તા','તિ','તી','તુ','તૂ','તૃ','તે','તૈ','તો',
                                'ત્કા','ત્કૃ','ત્ઝે','ત્ત','ત્તા','ત્તિ','ત્તી','ત્તે','ત્ત્વ','ત્ત્વિ','ત્ત્વો','ત્ન','ત્ની','ત્પ','ત્પા','ત્મ','ત્મા','ત્મિ','ત્ય','ત્યા',
                                'ત્યિ','ત્યુ','ત્યે','ત્યો','ત્ર','ત્રા','ત્રિ','ત્રી','ત્રુ','ત્રે','ત્રો','ત્ર્ય','ત્વ','ત્વી','ત્વો','ત્સ','ત્સા','ત્સ્ના','ત્સ્યો','થ',
                                'થા','થિ','થી','થુ','થૂ','થે','થો','થ્થ','થ્થા','થ્થુ','થ્થો','થ્યુ','થ્રી','થ્લે','થ્વી','દ','દા','દિ','દી','દુ',
                                'દૂ','દૃ','દે','દૈ','દો','દૌ','દ્ઉ','દ્ઘા','દ્દ','દ્દા','દ્દી','દ્દે','દ્ધ','દ્ધા','દ્ધિ','દ્ધુ','દ્ધો','દ્ભ','દ્ય','દ્યા',
                                'દ્યુ','દ્યો','દ્ર','દ્રા','દ્રિ','દ્રી','દ્રે','દ્રો','દ્વ','દ્વા','દ્વિ','દ્વે','ધ','ધા','ધિ','ધી','ધુ','ધૂ','ધે','ધો',
                                'ધ્ધ','ધ્ધા','ધ્ધિ','ધ્ધો','ધ્ય','ધ્યા','ધ્યુ','ધ્યે','ધ્યો','ધ્ર','ધ્રા','ધ્રુ','ધ્રો','ધ્વ','ન','ના','નિ','ની','નુ','નૂ',
                                'નૃ','ને','નૈ','નો','નૌ','ન્ક','ન્કા','ન્કિ','ન્કો','ન્ગ','ન્ચ','ન્ચા','ન્ચિ','ન્ચુ','ન્ચે','ન્જ','ન્જિ','ન્જી','ન્જે','ન્ઝ',
                                'ન્ઝી','ન્ઝે','ન્ટ','ન્ટિ','ન્ટી','ન્ટે','ન્ટો','ન્ટ્ર','ન્ટ્રા','ન્ટ્રી','ન્ટ્રો','ન્ટ્સ','ન્ડ','ન્ડા','ન્ડિ','ન્ડી','ન્ડે','ન્ડો','ન્ડ્ઝ','ન્ડ્રો',
                                'ન્ડ્સ','ન્તી','ન્દ','ન્દિ','ન્દી','ન્દો','ન્દ્ર','ન્દ્રા','ન્દ્રિ','ન્દ્રી','ન્ધા','ન્ન','ન્ના','ન્ને','ન્નૈ','ન્ફ','ન્ફિ','ન્ફો','ન્ફ્રા','ન્ફ્રે',
                                'ન્ફ્લે','ન્મ','ન્મા','ન્મે','ન્મ્યુ','ન્ય','ન્યા','ન્યુ','ન્યૂ','ન્યો','ન્લ','ન્લી','ન્વ','ન્વિ','ન્વે','ન્શ','ન્શિ','ન્સ','ન્સા','ન્સિ',
                                'ન્સી','ન્સુ','ન્સે','ન્સો','ન્સ્ટ','ન્સ્ટિ','ન્સ્ટી','ન્સ્ટે','ન્સ્ટ્રુ','ન્સ્પો','ન્હ','ન્હા','ન્હે','ન્હો','પ','પા','પિ','પી','પુ','પૂ',
                                'પૃ','પૅ','પે','પૈ','પૉ','પો','પૌ','પ્ટ','પ્ટે','પ્ત','પ્તા','પ્તિ','પ્ન','પ્ના','પ્ની','પ્નો','પ્પ','પ્પા','પ્યા','પ્યુ',
                                'પ્યૂ','પ્ર','પ્રા','પ્રિ','પ્રી','પ્રુ','પ્રે','પ્રૉ','પ્રો','પ્રૌ','પ્લ','પ્લા','પ્લી','પ્લે','પ્લો','પ્શ','પ્સ','ફ','ફા','ફિ',
                                'ફી','ફુ','ફૂ','ફૅ','ફે','ફૈ','ફો','ફ્ટ','ફ્તી','ફ્ફ','ફ્યુ','ફ્ર','ફ્રા','ફ્રિ','ફ્રી','ફ્રે','ફ્લા','ફ્લે','ફ્લો','બ',
                                'બા','બિ','બી','બુ','બૂ','બૅ','બે','બૈ','બૉ','બો','બૌ','બ્જે','બ્દ','બ્દો','બ્ધ','બ્બા','બ્બી','બ્બે','બ્યુ','બ્યૂ',
                                'બ્ર','બ્રા','બ્રિ','બ્રી','બ્રૂ','બ્રે','બ્રો','બ્લ','બ્લા','બ્લિ','બ્લી','બ્લુ','બ્લૂ','બ્લે','બ્લો','બ્સ','ભ','ભા','ભિ','ભી',
                                'ભુ','ભૂ','ભે','ભૈ','ભો','ભૌ','ભ્ય','ભ્યા','ભ્યો','ભ્ર','ભ્રા','મ','મા','મિ','મી','મુ','મૂ','મૃ','મૅ','મે',
                                'મૈ','મો','મૌ','મ્કિ','મ્ત','મ્થી','મ્ની','મ્પ','મ્પા','મ્પિ','મ્પી','મ્પે','મ્પો','મ્પ્ના','મ્પ્નુ','મ્પ્યુ','મ્પ્લા','મ્પ્લી','મ્પ્લે','મ્પ્લો',
                                'મ્બ','મ્બા','મ્બુ','મ્બે','મ્બો','મ્મ','મ્મા','મ્મી','મ્મુ','મ્ય','મ્યા','મ્યુ','મ્યો','મ્વે','મ્સ','મ્સે','મ્હો','ય','યા','યિ',
                                'યી','યુ','યૂ','યે','યો','ર','રા','રિ','રી','રુ','રૂ','રૃ','રે','રૈ','રો','ર્આે','ર્ઇ','ર્ઓિ','ર્ક','ર્કા',
                                'ર્કિ','ર્કી','ર્કે','ર્ક્યુ','ર્ક્ષ','ર્ક્સ','ર્ગ','ર્ગે','ર્ગો','ર્ઘ','ર્ચ','ર્ચા','ર્ચિ','ર્ચી','ર્ચ્યુ','ર્ચ્યૂ','ર્જ','ર્જા','ર્જિ','ર્જી',
                                'ર્જુ','ર્ઝ','ર્ઝા','ર્ટ','ર્ટા','ર્ટિ','ર્ટી','ર્ટે','ર્ટો','ર્ટ્રે','ર્ટ્સ','ર્ડ','ર્ડિ','ર્ડે','ર્ડ્સ','ર્ણ','ર્ણા','ર્ત','ર્તા','ર્તિ',
                                'ર્તી','ર્તુ','ર્થ','ર્થા','ર્થિ','ર્થી','ર્થો','ર્થ્રા','ર્દ','ર્દા','ર્દિ','ર્દી','ર્દૂ','ર્દે','ર્ધ','ર્ધા','ર્ધિ','ર્ન','ર્ના','ર્નિ',
                                'ર્નિી','ર્ની','ર્ને','ર્ન્ટ','ર્ન્ડિ','ર્ન્સ્ટ','ર્પ','ર્પે','ર્પેા','ર્પો','ર્ફિ','ર્ફે','ર્ફો','ર્બ','ર્બા','ર્બિ','ર્બે','ર્ભ','ર્ભા','ર્મ',
                                'ર્મા','ર્મિ','ર્મિા','ર્મી','ર્મે','ર્મો','ર્મ્યુ','ર્ય','ર્યા','ર્યિ','ર્યુ','ર્યે','ર્યેા','ર્યો','ર્ર','ર્લ','ર્લા','ર્લિ','ર્લે','ર્લ્ડ',
                                'ર્લ્સ','ર્લ્સે','ર્વ','ર્વા','ર્વિ','ર્વિે','ર્વી','ર્વે','ર્વો','ર્વ્ય','ર્શ','ર્શા','ર્શિ','ર્શી','ર્શે','ર્શ્યુ','ર્ષ','ર્ષા','ર્ષિ','ર્ષે',
                                'ર્ષો','ર્ષ્યા','ર્સ','ર્સિ','ર્સી','ર્સે','ર્સ્ટ','લ','લા','લિ','લી','લુ','લૂ','લે','લૈ','લૉ','લો','લૌ','લ્ક','લ્જિ',
                                'લ્ટ','લ્ટા','લ્ટિ','લ્ટી','લ્ટે','લ્ટો','લ્ટ્રા','લ્ડ','લ્ડિ','લ્ડી','લ્ડે','લ્ડો','લ્થ','લ્ન્ટ','લ્પ','લ્પા','લ્પિ','લ્પે','લ્પો','લ્પ્સ',
                                'લ્ફ','લ્બ','લ્મ','લ્મી','લ્મે','લ્મો','લ્મ્સ','લ્ય','લ્યા','લ્યુ','લ્યૂ','લ્યે','લ્યો','લ્લ','લ્લા','લ્લાી','લ્લિ','લ્લી','લ્લુ','લ્લે',
                                'લ્લો','લ્વ','લ્વી','લ્વે','લ્સ','લ્સી','લ્સે','લ્હા','લ્હી','ળ','ળા','ળિ','ળી','ળુ','ળે','ળો','ળ્યા','ળ્યુ','ળ્યો','વ',
                                'વા','વિ','વી','વુ','વૂ','વૃ','વે','વૈ','વૉ','વો','વૌ','વ્ઝ','વ્ય','વ્યા','વ્યુ','વ્યૂ','વ્યો','વ્ર','વ્સ','વ્હા',
                                'વ્હી','વ્હો','શ','શા','શિ','શી','શુ','શૂ','શૅ','શે','શૈ','શૉ','શો','શૌ','શ્ક','શ્કા','શ્કે','શ્ગ','શ્ચ','શ્ચિ',
                                'શ્ડ','શ્તી','શ્ન','શ્નો','શ્બૂ','શ્મા','શ્મી','શ્ય','શ્યા','શ્યુ','શ્યૂ','શ્ર','શ્રા','શ્રિ','શ્રી','શ્રુ','શ્રે','શ્રો','શ્ર્ચ','શ્ર્ન',
                                'શ્ર્વ','શ્ર્વા','શ્ર્વિ','શ્લે','શ્વ','શ્વા','શ્વિ','શ્વી','શ્વે','ષ','ષા','ષિ','ષી','ષુ','ષે','ષો','ષ્ક','ષ્કા','ષ્ક્રી','ષ્ટ',
                                'ષ્ટા','ષ્ટિ','ષ્ટે','ષ્ટ્ર','ષ્ટ્રા','ષ્ટ્રિ','ષ્ટ્રી','ષ્ટ્ર્ચા','ષ્ટ્ર્ર','ષ્ટ્ર્રી','ષ્ઠ','ષ્ઠા','ષ્ણ','ષ્ણા','ષ્ણુ','ષ્ણે','ષ્ના','ષ્નો','ષ્પા','ષ્પી',
                                'ષ્ફ','ષ્મા','ષ્ય','ષ્યો','સ','સા','સિ','સી','સુ','સૂ','સૃ','સૅ','સે','સૈ','સૉ','સો','સૌ','સ્ક','સ્કા','સ્કિ',
                                'સ્કી','સ્કુ','સ્કૂ','સ્કૃ','સ્કે','સ્કો','સ્ક્યા','સ્ક્રિ','સ્ક્રી','સ્ક્રે','સ્ક્વો','સ્ચા','સ્ચૈ','સ્જિ','સ્ટ','સ્ટા','સ્ટિ','સ્ટી','સ્ટુ','સ્ટે',
                                'સ્ટો','સ્ટ્ર','સ્ટ્રા','સ્ટ્રિ','સ્ટ્રી','સ્ટ્રે','સ્ટ્રો','સ્ટ્સ','સ્ડ','સ્ત','સ્તા','સ્તિ','સ્તી','સ્તુ','સ્તે','સ્તો','સ્ત્ર','સ્ત્રા','સ્ત્રી','સ્ત્રો',
                                'સ્થ','સ્થા','સ્થિ','સ્થી','સ્થ્ય','સ્ના','સ્ને','સ્પ','સ્પા','સ્પિ','સ્પી','સ્પૂ','સ્પે','સ્પો','સ્પ્લે','સ્ફૂ','સ્ફે','સ્ફો','સ્બી','સ્મ',
                                'સ્મા','સ્મિ','સ્મી','સ્મૃ','સ્મૈ','સ્મો','સ્ય','સ્યા','સ્યુ','સ્યો','સ્ર્ટ','સ્લા','સ્લિ','સ્લે','સ્લો','સ્વ','સ્વા','સ્વિ','સ્વી','સ્વે',
                                'સ્સા','સ્સિ','સ્સી','સ્સે','સ્સ્ટ્રી','હ','હા','હિ','હી','હુ','હૂ','હૃ','હે','હૈ','હો','હ્ને','હ્મ','હ્મા','હ્ય','હ્યા',
                                'હ્યુ','હ્યૂ','઼','઼ૂ','ઽ','િ્ર','ુ્ર','ૂ્ર','ૂ્રુ','ે્ર','્','ૐ','૦','૧','૨','૩','૪','૫','૬','૭',
                                '૮','૯','૱',]
    # vocab 
    unicodes               =    ['']+sorted(_unicodes+numbers+punctuations)
    components             =    ['']+sorted(_components+numbers+punctuations)
    valid                  =    ['']+sorted(dict_graphemes+numbers+punctuations)
#------------------------------------------------------------------------------------------------------------------------------------------------------
#######################################################################################################################################################
#------------------------------------------------------------------------------------------------------------------------------------------------------

class panjabi:
    iden                   =    "panjabi"

    numbers                =    ['੦', '੧', '੨', '੩', '੪', '੫', '੬', '੭', '੮', '੯' ]   #['૦', '' ] 
    punctuations           =    ['!', '"', '#', '$', '%', '&', "'", '(', ')', '*', '+', ',', '-', '.', 
                                 '/', ':', ';', '<', '=', '>', '?', '@', '[', '\\', ']', '^', '_', '`',
                                 '{', '|', '}', '~', '।', '॥'] # dari nite hobe. 
    # for grapheme decomp
    vowel_diacritics       =    ['ੀ', 'ੂ', 'ਿ', 'ੁ', 'ੇ', 'ੋ', 'ੈ', 'ੌ', 'ਾ' ]
    vocalics               =    []
    consonant_diacritics   =    ['ੰ', 'ਂ','ੱ', 'ੑ', 'ੵ', 'ਃ']+vocalics # last one from sikh holy book. # second one also historical
    modifiers              =    []
    connector              =    '੍' 
    special_charecters     =    [connector,'\u200d', '\u200c' ]
    allow_conn_ending      =    True
    # vocab parts
    _unicodes              =    ['-','।','ਁ','ਂ','ਃ','ਅ','ਆ','ਇ','ਈ','ਉ','ਊ','ਏ','ਐ','ਓ','ਔ','ਕ','ਖ','ਗ','ਘ','ਙ','ਚ',
                                'ਛ','ਜ','ਝ','ਞ','ਟ','ਠ','ਡ','ਢ','ਣ','ਤ','ਥ','ਦ','ਧ','ਨ','ਪ','ਫ','ਬ','ਭ','ਮ','ਯ',
                                'ਰ','ਲ','ਲ਼','ਵ','ਸ਼','ਸ','ਹ','਼','ਾ','ਿ','ੀ','ੁ','ੂ','ੇ','ੈ','ੋ','ੌ','੍','ੑ','ਖ਼',
                                'ਗ਼','ਜ਼','ੜ','ਫ਼','੦','੧','੨','੩','੪','੫','੬','੭','੮','੯','ੰ','ੱ','ੲ','ੳ','ੴ','ੵ']
    _components            =    ['-','।','ਁ','ਂ','ਃ','ਅ','ਆ','ਇ','ਈ','ਉ','ਉ੍ਰ','ਊ','ਏ','ਐ','ਓ','ਔ','ਕ','ਕ੍ਰ','ਖ','ਗ',
                                'ਗ੍ਰ','ਗ੍ਹ','ਘ','ਙ','ਚ','ਛ','ਜ','ਜ੍ਹ','ਝ','ਞ','ਟ','ਟ੍ਰ','ਠ','ਡ','ਡ੍ਰ','ਡ੍ਹ','ਢ','ਣ','ਤ','ਤ੍ਰ',
                                'ਤ੍ਹ','ਥ','ਥ੍ਰ','ਦ','ਦ੍ਰ','ਧ','ਧ੍ਰ','ਨ','ਨ੍ਨ','ਨ੍ਫ','ਨ੍ਮ','ਨ੍ਰ','ਨ੍ਹ','ਪ','ਪ੍ਯ','ਪ੍ਰ','ਪ੍ਹ','ਫ','ਫ੍ਯ','ਫ੍ਰ',
                                'ਬ','ਬ੍ਰ','ਭ','ਭ੍ਰ','ਮ','ਮ੍ਰ','ਮ੍ਹ','ਯ','ਰ','ਰ੍ਹ','ਲ','ਲ੍ਰ','ਲ੍ਹ','ਲ਼','ਵ','ਵ੍ਰ','ਸ਼','ਸ਼੍ਰ','ਸ','ਸ੍ਰ',
                                'ਸ੍ਵ੍ਵ','ਹ','ਹ੍ਰ','਼','਼੍ਰ','਼੍ਹ','ਾ','ਾ੍ਰ','ਿ','ਿ੍ਤ','ਿ੍ਰ','ੀ','ੁ','ੂ','ੇ','ੈ','ੋ','ੌ','੍ਰ','ੑ',
                                'ਖ਼','ਗ਼','ਜ਼','ਜ਼੍ਰ','ਜ਼੍ਹ','ੜ','ੜ੍ਹ','ਫ਼','੦','੧','੨','੩','੪','੫','੬','੭','੮','੯','ੰ','ੱ',
                                'ੲ','ੲ੍ਹ','ੳ','ੴ','ੵ']
    dict_graphemes         =    ['-','।','ਁ','ਂ','ਂਿ','ਃ','ਅ','ਅੇ','ਆ','ਆਾ','ਇ','ਈ','ਈੇ','ਈੌ','ਉ','ਉਾ','ਉੁ','ਉੂ','ਉੇ','ਉ੍ਰ','ਊ',
                                'ਊੁ','ਏ','ਏੇ','ਐ','ਓ','ਔ','ਕ','ਕਾ','ਕਿ','ਕੀ','ਕੁ','ਕੂ','ਕੇ','ਕੈ','ਕੋ','ਕੌ','ਕ੍ਰ','ਕ੍ਰਾ','ਕ੍ਰਿ','ਕ੍ਰੀ',
                                'ਕ੍ਰੇ','ਕ੍ਰੋ','ਖ','ਖਾ','ਖਿ','ਖੀ','ਖੁ','ਖੂ','ਖੇ','ਖੈ','ਖੋ','ਖੌ','ਗ','ਗਾ','ਗਿ','ਗੀ','ਗੁ','ਗੂ','ਗੇ','ਗੈ',
                                'ਗੋ','ਗੌ','ਗ੍ਰ','ਗ੍ਰਾ','ਗ੍ਰਿ','ਗ੍ਰੀ','ਗ੍ਰੇ','ਗ੍ਰੈ','ਗ੍ਰੋ','ਗ੍ਹਾ','ਘ','ਘਾ','ਘਿ','ਘੀ','ਘੁ','ਘੂ','ਘੇ','ਘੋ','ਙ','ਚ',
                                'ਚਾ','ਚਿ','ਚੀ','ਚੁ','ਚੂ','ਚੇ','ਚੈ','ਚੋ','ਚੌ','ਛ','ਛਾ','ਛਿ','ਛੀ','ਛੁ','ਛੂ','ਛੇ','ਛੋ','ਜ','ਜਾ','ਜਿ',
                                'ਜੀ','ਜੁ','ਜੂ','ਜੇ','ਜੈ','ਜੋ','ਜੌ','ਜ੍ਹਾ','ਝ','ਝਾ','ਝਿ','ਝੀ','ਝੁ','ਝੂ','ਝੇ','ਝੋ','ਝੌ','ਞ','ਟ','ਟਾ',
                                'ਟਿ','ਟੀ','ਟੁ','ਟੂ','ਟੇ','ਟੈ','ਟੋ','ਟੌ','ਟ੍ਰ','ਟ੍ਰਾ','ਟ੍ਰਿ','ਟ੍ਰੀ','ਟ੍ਰੇ','ਟ੍ਰੈ','ਟ੍ਰੋ','ਠ','ਠਾ','ਠਿ','ਠੀ','ਠੁ',
                                'ਠੂ','ਠੇ','ਠੈ','ਠੋ','ਡ','ਡਾ','ਡਿ','ਡੀ','ਡੁ','ਡੂ','ਡੇ','ਡੈ','ਡੋ','ਡੌ','ਡ੍ਰਾ','ਡ੍ਰੇ','ਡ੍ਰੋ','ਡ੍ਹ','ਡ੍ਹਾ','ਢ',
                                'ਢਾ','ਢਿ','ਢੀ','ਢੁ','ਢੂ','ਢੇ','ਢੋ','ਣ','ਣਾ','ਣਿ','ਣੀ','ਣੁ','ਣੂ','ਣੇ','ਣੈ','ਣੋ','ਣੌ','ਤ','ਤਾ','ਤਿ',
                                'ਤੀ','ਤੁ','ਤੂ','ਤੇ','ਤੈ','ਤੋ','ਤੌ','ਤ੍ਰ','ਤ੍ਰਾ','ਤ੍ਰਿ','ਤ੍ਰੈ','ਤ੍ਹਾ','ਥ','ਥਾ','ਥਿ','ਥੀ','ਥੁ','ਥੂ','ਥੇ','ਥੈ',
                                'ਥੋ','ਥੌ','ਥ੍ਰੀ','ਥ੍ਰੋ','ਦ','ਦਾ','ਦਿ','ਦੀ','ਦੀਾ','ਦੁ','ਦੂ','ਦੇ','ਦੈ','ਦੋ','ਦੌ','ਦ੍ਰ','ਦ੍ਰਿ','ਧ','ਧਾ','ਧਿ',
                                'ਧੀ','ਧੁ','ਧੂ','ਧੇ','ਧੋ','ਧੌ','ਧ੍ਰੋ','ਨ','ਨਾ','ਨਿ','ਨੀ','ਨੁ','ਨੂ','ਨੇ','ਨੈ','ਨੋ','ਨੌ','ਨ੍ਨਾ','ਨ੍ਫ','ਨ੍ਮੇ',
                                'ਨ੍ਰਿ','ਨ੍ਹ','ਨ੍ਹਾ','ਨ੍ਹਿ','ਨ੍ਹੀ','ਨ੍ਹੇ','ਪ','ਪਾ','ਪਿ','ਪੀ','ਪੁ','ਪੂ','ਪੇ','ਪੈ','ਪੋ','ਪੌ','ਪ੍ਯਾ','ਪ੍ਰ','ਪ੍ਰਾ','ਪ੍ਰਿ',
                                'ਪ੍ਰੀ','ਪ੍ਰੇ','ਪ੍ਰੈ','ਪ੍ਰੋ','ਪ੍ਹ','ਫ','ਫਾ','ਫਿ','ਫੀ','ਫੁ','ਫੂ','ਫੇ','ਫੈ','ਫੋ','ਫੌ','ਫ੍ਯ','ਫ੍ਰੀ','ਬ','ਬਾ','ਬਿ',
                                'ਬੀ','ਬੁ','ਬੁੂ','ਬੂ','ਬੇ','ਬੈ','ਬੋ','ਬੌ','ਬ੍ਰ','ਬ੍ਰਾ','ਬ੍ਰਿ','ਬ੍ਰੇ','ਬ੍ਰੈ','ਭ','ਭਾ','ਭਿ','ਭੀ','ਭੁ','ਭੂ','ਭੇ',
                                'ਭੈ','ਭੋ','ਭੌ','ਭ੍ਰਿ','ਮ','ਮਾ','ਮਿ','ਮੀ','ਮੁ','ਮੁਾ','ਮੂ','ਮੇ','ਮੈ','ਮੋ','ਮੌ','ਮ੍ਰ','ਮ੍ਰਿ','ਮ੍ਹ','ਮ੍ਹਾ','ਯ',
                                'ਯਾ','ਯੁ','ਯੂ','ਯੇ','ਯੋ','ਯੌ','ਰ','ਰਾ','ਰਿ','ਰਿੂ','ਰੀ','ਰੁ','ਰੂ','ਰੇ','ਰੈ','ਰੋ','ਰੌ','ਰ੍ਹਾ','ਰ੍ਹਿ','ਰ੍ਹੀ',
                                'ਰ੍ਹੇ','ਲ','ਲਾ','ਲਿ','ਲੀ','ਲੁ','ਲੂ','ਲੇ','ਲੈ','ਲੋ','ਲੌ','ਲ੍ਰਾ','ਲ੍ਹ','ਲ੍ਹਾ','ਲ੍ਹਿ','ਲ੍ਹੀ','ਲ੍ਹੇ','ਲ਼','ਲ਼ਾ','ਲ਼ਿ',
                                'ਲ਼ੀ','ਵ','ਵਾ','ਵਿ','ਵੀ','ਵੀਾ','ਵੁ','ਵੂ','ਵੇ','ਵੈ','ਵੋ','ਵੌ','ਵ੍ਰਿ','ਸ਼','ਸ਼ਾ','ਸ਼ਿ','ਸ਼ੀ','ਸ਼ੁ','ਸ਼ੂ','ਸ਼ੇ',
                                'ਸ਼ੈ','ਸ਼ੋ','ਸ਼ੌ','ਸ਼੍ਰੀ','ਸ਼੍ਰੇ','ਸ਼੍ਰੋ','ਸ','ਸਾ','ਸਿ','ਸੀ','ਸੁ','ਸੂ','ਸੇ','ਸੈ','ਸੋ','ਸੌ','ਸ੍ਰਿ','ਸ੍ਰੀ','ਸ੍ਰੋ','ਸ੍ਵ੍ਵ',
                                'ਹ','ਹਾ','ਹਿ','ਹੀ','ਹੁ','ਹੂ','ਹੇ','ਹੈ','ਹੋ','ਹੌ','ਹ੍ਰਿ','਼','਼ਾ','਼ਿ','਼ੀ','਼ੁ','਼ੂ','਼ੇ','਼ੈ','਼ੋ',
                                '਼ੌ','਼੍ਰੀ','਼੍ਰੇ','਼੍ਹ','਼੍ਹੀ','਼੍ਹੇ','ਾ੍ਰ','ਿ੍ਤ','ਿ੍ਰ','ੑ','ੑਾ','ਖ਼','ਖ਼ਾ','ਖ਼ਿ','ਖ਼ੀ','ਖ਼ੁ','ਖ਼ੂ','ਖ਼ੈ','ਖ਼ੋ','ਖ਼ੌ',
                                'ਗ਼','ਗ਼ਾ','ਗ਼ੀ','ਗ਼ੁ','ਗ਼ੈ','ਜ਼','ਜ਼ਾ','ਜ਼ਿ','ਜ਼ੀ','ਜ਼ੁ','ਜ਼ੂ','ਜ਼ੇ','ਜ਼ੈ','ਜ਼ੋ','ਜ਼੍ਰ','ਜ਼੍ਹ','ੜ','ੜਾ','ੜਿ','ੜੀ',
                                'ੜੁ','ੜੂ','ੜੇ','ੜੈ','ੜੋ','ੜ੍ਹ','ੜ੍ਹਾ','ੜ੍ਹਿ','ੜ੍ਹੀ','ੜ੍ਹੇ','ੜ੍ਹੋ','ਫ਼','ਫ਼ਾ','ਫ਼ਿ','ਫ਼ੀ','ਫ਼ੁ','ਫ਼ੇ','ਫ਼ੈ','ਫ਼ੌ','੦',
                                '੧','੨','੩','੪','੫','੬','੭','੮','੯','ੰ','ੰੀ','ੰ੍ਰ','ੱ','ੲ','ੲ੍ਹੀ','ੳ','ੴ','ੵਾ']
    # vocab 
    unicodes               =    ['']+sorted(_unicodes+numbers+punctuations)
    components             =    ['']+sorted(_components+numbers+punctuations)
    valid                  =    ['']+sorted(dict_graphemes+numbers+punctuations)
#------------------------------------------------------------------------------------------------------------------------------------------------------
#######################################################################################################################################################
#------------------------------------------------------------------------------------------------------------------------------------------------------

class odiya:
    iden                   =    "odiya"

    numbers                =    ['୦', '୧', '୨', '୩', '୪', '୫', '୬', '୭', '୮', '୯' ] # ['୲', '୳', '୴', '୵', '୶', '୷'] these are legacy numerals
    punctuations           =    ['!', '"', '#', '$', '%', '&', "'", '(', ')', '*', '+', ',', '-', '.', 
                                 '/', ':', ';', '<', '=', '>', '?', '@', '[', '\\', ']', '^', '_', '`',
                                 '{', '|', '}', '~', '।', '॥'] 
    # for grapheme decomp
    vowel_diacritics       =    ['ି', 'ୀ', 'ୁ', 'ୂ', 'େ', 'ୋ', 'ା', 'ୈ', 'ୌ', 'ୖ', 'ୗ' ] 
    vocalics               =    ['ୃ', 'ୄ', 'ୢ', 'ୣ']
    consonant_diacritics   =    ['ଂ', 'ଁ', 'ଃ']+vocalics  
    modifiers              =    []
    connector              =    '୍' 
    special_charecters     =    [connector,'\u200d', '\u200c']
    allow_conn_ending      =    True
    # vocab parts
    _unicodes              =    ['-','।','ଁ','ଂ','ଃ','ଅ','ଆ','ଇ','ଈ','ଉ','ଊ','ଋ','ଏ','ଐ','ଓ','ଔ','କ','ଖ','ଗ','ଘ','ଙ',
                                'ଚ','ଛ','ଜ','ଝ','ଞ','ଟ','ଠ','ଡ','ଢ','ଣ','ତ','ଥ','ଦ','ଧ','ନ','ପ','ଫ','ବ','ଭ','ମ',
                                'ଯ','ର','ଲ','ଳ','ଵ','ଶ','ଷ','ସ','ହ','଼','ା','ି','ୀ','ୁ','ୂ','ୃ','ୄ','େ','ୈ','ୋ',
                                'ୌ','୍','ୖ','ୗ','ଡ଼','ଢ଼','ୟ','ୠ','ୡ','ୢ','ୣ','୦','୧','୨','୩','୪','୫','୬','୭','୮',
                                '୯','୰','ୱ']
    _components            =    ['-','।','ଁ','ଂ','ଃ','ଅ','ଆ','ଇ','ଈ','ଉ','ଊ','ଋ','ଏ','ଐ','ଓ','ଓ୍ଵ','ଔ','କ','କ୍-','କ୍କ',
                                'କ୍ଟ','କ୍ଟ୍ର','କ୍ତ','କ୍ନ','କ୍ମ','କ୍ର','କ୍ଲ','କ୍ଳ','କ୍ଵ','କ୍ଷ','କ୍ଷ୍କ','କ୍ଷ୍ନ','କ୍ଷ୍ମ','କ୍ଷ୍ୟ','କ୍ସ','କ୍ୟ','କ୍ୱ','ଖ','ଖ୍ମ','ଖ୍ଯ',
                                'ଖ୍ର','ଖ୍ୟ','ଖ୍ୱ','ଗ','ଗ୍ଐ','ଗ୍ଗ','ଗ୍ଧ','ଗ୍ନ','ଗ୍ନ୍ୟ','ଗ୍ମ','ଗ୍ର','ଗ୍ଲ','ଗ୍ଳ','ଗ୍ୟ','ଗ୍ୱ','ଘ','ଘ୍ନ','ଘ୍ର','ଙ୍କ','ଙ୍କ୍ର',
                                'ଙ୍ଖ','ଙ୍ଗ','ଙ୍ଗ୍ର','ଙ୍ଗ୍ଲ','ଙ୍ଗ୍ସ','ଙ୍ଘ','ଚ','ଚ୍-','ଚ୍ଚ','ଚ୍ଛ','ଚ୍ମ','ଚ୍ୟ','ଛ','ଜ','ଜ୍ଜ','ଜ୍ଜ୍ଵ','ଜ୍ଜ୍ୱ','ଜ୍ଞ','ଜ୍ଞ୍ନ','ଜ୍ମ',
                                'ଜ୍ଯ','ଜ୍ର','ଜ୍ଵ','ଜ୍ୟ','ଜ୍ୱ','ଝ','ଞ','ଞ୍ଚ','ଞ୍ଛ','ଞ୍ଜ','ଞ୍ଝ','ଟ','ଟ୍କ','ଟ୍ଟ','ଟ୍ର','ଟ୍ଲ','ଟ୍ସ','ଟ୍ୟ','ଟ୍ୱ','ଠ',
                                'ଠ୍ୟ','ଡ','ଡ୍-','ଡ୍ଡ','ଡ୍ର','ଡ୍ୟ','ଢ','ଣ','ଣ୍ଟ','ଣ୍ଟ୍ର','ଣ୍ଠ','ଣ୍ଡ','ଣ୍ଡ୍ର','ଣ୍ଢ','ଣ୍ତ','ଣ୍ମ','ଣ୍ଵ','ଣ୍ୟ','ଣ୍ୱ','ତ',
                                'ତ୍କ','ତ୍ତ','ତ୍ତ୍ର','ତ୍ତ୍ଵ','ତ୍ତ୍ୟ','ତ୍ତ୍ୱ','ତ୍ନ','ତ୍ପ','ତ୍ବ','ତ୍ମ','ତ୍ମ୍ୟ','ତ୍ର','ତ୍ଵ','ତ୍ସ','ତ୍ୟ','ତ୍ୱ','ଥ','ଥ୍ର','ଥ୍ୟ','ଦ',
                                'ଦ୍ଗ','ଦ୍ଘ','ଦ୍ଜ','ଦ୍ଦ','ଦ୍ଦ୍ୟ','ଦ୍ଧ','ଦ୍ଧ୍ଯ','ଦ୍ବ','ଦ୍ଭ','ଦ୍ମ','ଦ୍ଯ','ଦ୍ର','ଦ୍ର୍ୟ','ଦ୍ଵ','ଦ୍ୟ','ଦ୍ୱ','ଧ','ଧ୍ବ','ଧ୍ଯ','ଧ୍ଵ',
                                'ଧ୍ୟ','ଧ୍ୱ','ନ','ନ୍-','ନ୍ଗ','ନ୍ଟ','ନ୍ଡ','ନ୍ଡ୍ର','ନ୍ତ','ନ୍ତ୍ର','ନ୍ଥ','ନ୍ଦ','ନ୍ଦ୍ର','ନ୍ଦ୍ୱ','ନ୍ଧ','ନ୍ଧ୍ର','ନ୍ଧ୍ୟ','ନ୍ନ','ନ୍ନ୍ୟ','ନ୍ଫ',
                                'ନ୍ବ','ନ୍ମ','ନ୍ଯ','ନ୍ର','ନ୍ଵ','ନ୍ସ','ନ୍ୟ','ନ୍ୱ','ପ','ପ୍ଟ','ପ୍ତ','ପ୍ନ','ପ୍ପ','ପ୍ର','ପ୍ଲ','ପ୍ଳ','ପ୍ସ','ପ୍ୟ','ଫ','ଫ୍ଟ',
                                'ଫ୍ତ','ଫ୍ଫ','ଫ୍ର','ଫ୍ଲ','ଫ୍ଳ','ଫ୍ୟ','ବ','ବ୍-','ବ୍ଜ','ବ୍ଡ','ବ୍ଦ','ବ୍ଧ','ବ୍ନ','ବ୍ବ','ବ୍ର','ବ୍ଲ','ବ୍ଳ','ବ୍ସ','ବ୍ୟ','ଭ',
                                'ଭ୍ର','ଭ୍ୟ','ମ','ମ୍-','ମ୍ନ','ମ୍ପ','ମ୍ପ୍ର','ମ୍ପ୍ଲ','ମ୍ପ୍ୟ','ମ୍ଫ','ମ୍ଫ୍ର','ମ୍ବ','ମ୍ବ୍ର','ମ୍ଭ','ମ୍ଭ୍ର','ମ୍ମ','ମ୍ମ୍ଯ','ମ୍ମ୍ୟ','ମ୍ର','ମ୍ଲ',
                                'ମ୍ଳ','ମ୍ଵ','ମ୍ସ','ମ୍ୟ','ମ୍ୱ','ଯ','ଯ୍ୟ','ର','ର୍କ','ର୍କ୍ଲ','ର୍କ୍ସ','ର୍ଖ','ର୍ଗ','ର୍ଘ','ର୍ଘ୍ଯ','ର୍ଘ୍ୟ','ର୍ଚ','ର୍ଚ୍ଚ','ର୍ଚ୍ଛ','ର୍ଜ',
                                'ର୍ଜ୍ଜ','ର୍ଜ୍ୟ','ର୍ଟ','ର୍ଟ୍ସ','ର୍ଡ','ର୍ଣ','ର୍ଣ୍ଣ','ର୍ଣ୍ନ','ର୍ତ','ର୍ତ୍ତ','ର୍ତ୍ତ୍ର','ର୍ତ୍ତ୍ୟ','ର୍ତ୍ୟ','ର୍ଥ','ର୍ଥ୍ର','ର୍ଥ୍ୟ','ର୍ଦ','ର୍ଦ୍ଦ','ର୍ଦ୍ଦ୍ୟ','ର୍ଦ୍ଧ',
                                'ର୍ଦ୍ଧ୍ବ','ର୍ଦ୍ଧ୍ଵ','ର୍ଦ୍ଧ୍ୱ','ର୍ଦ୍ର','ର୍ଧ','ର୍ଧ୍ହ','ର୍ନ','ର୍ନ୍ତ','ର୍ପ','ର୍ଫ','ର୍ବ','ର୍ଭ','ର୍ମ','ର୍ଯ','ର୍ଯ୍ୟ','ର୍ର','ର୍ଲ','ର୍ଳ','ର୍ଶ','ର୍ଶ୍ବ',
                                'ର୍ଶ୍ଵ','ର୍ଶ୍ୱ','ର୍ଷ','ର୍ସ','ର୍ହ','ର୍ୟ','ର୍ୟ୍ୟ','ର୍ୱ','ଲ','ଲ୍ଗ','ଲ୍ଟ','ଲ୍ଟ୍ର','ଲ୍ଡ','ଲ୍ତ','ଲ୍ଥ','ଲ୍ପ','ଲ୍ଫ','ଲ୍ବ','ଲ୍ଭ','ଲ୍ମ',
                                'ଲ୍ର','ଲ୍ଲ','ଲ୍ସ','ଲ୍ହ','ଲ୍ୟ','ଳ','ଳ୍କ','ଳ୍ପ','ଳ୍ମ','ଳ୍ଳ','ଵ','ଶ','ଶ୍ଚ','ଶ୍ନ','ଶ୍ବ','ଶ୍ମ','ଶ୍ଯ','ଶ୍ର','ଶ୍ଲ','ଶ୍ଳ',
                                'ଶ୍ଵ','ଶ୍ଶ','ଶ୍ସ','ଶ୍ୟ','ଶ୍ୱ','ଷ','ଷ୍କ','ଷ୍କ୍ର','ଷ୍ଟ','ଷ୍ଟ୍ର','ଷ୍ଟ୍ୟ','ଷ୍ଠ','ଷ୍ଣ','ଷ୍ପ','ଷ୍ପ୍ର','ଷ୍ଫ','ଷ୍ମ','ଷ୍ଵ','ଷ୍ୟ','ସ',
                                'ସ୍-','ସ୍ଏ','ସ୍କ','ସ୍କ୍ର','ସ୍କ୍ଲ','ସ୍ଖ','ସ୍ଙ','ସ୍ଚ','ସ୍ଟ','ସ୍ଟ୍ର','ସ୍ତ','ସ୍ତ୍ର','ସ୍ତ୍ୟ','ସ୍ଥ','ସ୍ଥ୍ୟ','ସ୍ନ','ସ୍ପ','ସ୍ପ୍ର','ସ୍ଫ','ସ୍ବ',
                                'ସ୍ମ','ସ୍ଯ','ସ୍ର','ସ୍ଲ','ସ୍ଳ','ସ୍ଵ','ସ୍ସ','ସ୍ସ୍ସ୍ବ','ସ୍ୟ','ସ୍ୱ','ହ','ହ୍ନ','ହ୍ବ','ହ୍ମ','ହ୍ର','ହ୍ଲ','ହ୍ଵ','ହ୍ହ','ହ୍ୟ','ହ୍ୱ',
                                '଼','ା','ି','ୀ','ୁ','ୁ୍ୟ','ୂ','ୃ','ୄ','େ','େ୍ର','ୈ','ୋ','ୌ','୍','ୖ','ୗ','ଡ଼','ଢ଼','ୟ',
                                'ୠ','ୡ','ୢ','ୣ','୦','୧','୨','୩','୪','୫','୬','୭','୮','୯','୰','ୱ','ୱ୍ଏ',]
    dict_graphemes         =    ['-','।','ଁ','ଂ','ଃ','ଅ','ଆ','ଇ','ଈ','ଉ','ଊ','ଋ','ଋି','ଏ','ଏା','ଐ','ଓ','ଓ୍ଵା','ଔ','କ','କା',
                                'କି','କୀ','କୁ','କୂ','କେ','କୈ','କୋ','କୌ','କ୍-','କ୍କ','କ୍କା','କ୍ଟ','କ୍ଟା','କ୍ଟି','କ୍ଟୁ','କ୍ଟେ','କ୍ଟୋ','କ୍ଟ୍ର','କ୍ଟ୍ରି','କ୍ଟ୍ରୋ',
                                'କ୍ତ','କ୍ତା','କ୍ତି','କ୍ତୀ','କ୍ନୋ','କ୍ମ','କ୍ମି','କ୍ର','କ୍ରା','କ୍ରି','କ୍ରୀ','କ୍ରୁ','କ୍ରୂ','କ୍ରେ','କ୍ରୋ','କ୍ଲ','କ୍ଲା','କ୍ଲି','କ୍ଲେ','କ୍ଲୋ',
                                'କ୍ଳ','କ୍ଳା','କ୍ଳି','କ୍ଳୋ','କ୍ଵ','କ୍ଵା','କ୍ଷ','କ୍ଷା','କ୍ଷି','କ୍ଷୀ','କ୍ଷୁ','କ୍ଷେ','କ୍ଷୌ','କ୍ଷ୍କ','କ୍ଷ୍ନୌ','କ୍ଷ୍ମ','କ୍ଷ୍ମା','କ୍ଷ୍ମୀ','କ୍ଷ୍ୟ','କ୍ସ',
                                'କ୍ସା','କ୍ସି','କ୍ସେ','କ୍ସୋ','କ୍ୟ','କ୍ୟା','କ୍ୟୁ','କ୍ୱ','କ୍ୱା','କ୍ୱି','ଖ','ଖା','ଖି','ଖୀ','ଖୁ','ଖେ','ଖୋ','ଖୌ','ଖ୍ମ','ଖ୍ଯ',
                                'ଖ୍ରି','ଖ୍ରୀ','ଖ୍ୟ','ଖ୍ୟା','ଖ୍ୱା','ଗ','ଗା','ଗି','ଗୀ','ଗୁ','ଗେ','ଗୈ','ଗୋ','ଗୌ','ଗ୍ଐ','ଗ୍ଗି','ଗ୍ଧ','ଗ୍ନ','ଗ୍ନା','ଗ୍ନି',
                                'ଗ୍ନୀ','ଗ୍ନେ','ଗ୍ନ୍ୟ','ଗ୍ମୀ','ଗ୍ର','ଗ୍ରା','ଗ୍ରି','ଗ୍ରୀ','ଗ୍ରୁ','ଗ୍ରେ','ଗ୍ରୋ','ଗ୍ଲା','ଗ୍ଲି','ଗ୍ଲୁ','ଗ୍ଲୋ','ଗ୍ଳା','ଗ୍ୟ','ଗ୍ୟା','ଗ୍ୱା','ଗ୍ୱୀ',
                                'ଘ','ଘା','ଘି','ଘୁ','ଘୂ','ଘେ','ଘୋ','ଘ୍ନ','ଘ୍ର','ଘ୍ରା','ଙ୍କ','ଙ୍କା','ଙ୍କି','ଙ୍କୀ','ଙ୍କୁ','ଙ୍କେ','ଙ୍କୋ','ଙ୍କ୍ର','ଙ୍କ୍ରା','ଙ୍ଖ',
                                'ଙ୍ଖା','ଙ୍ଖୁ','ଙ୍ଗ','ଙ୍ଗା','ଙ୍ଗି','ଙ୍ଗୀ','ଙ୍ଗୁ','ଙ୍ଗେ','ଙ୍ଗୋ','ଙ୍ଗ୍ର','ଙ୍ଗ୍ରୋ','ଙ୍ଗ୍ଲି','ଙ୍ଗ୍ସ','ଙ୍ଘ','ଙ୍ଘା','ଚ','ଚା','ଚି','ଚୀ','ଚୁ',
                                'ଚୂ','ଚେ','ଚୈ','ଚୋ','ଚୌ','ଚ୍-','ଚ୍ଚ','ଚ୍ଚା','ଚ୍ଚି','ଚ୍ଚେ','ଚ୍ଚୈ','ଚ୍ଛ','ଚ୍ଛା','ଚ୍ଛି','ଚ୍ଛେ','ଚ୍ମେ','ଚ୍ୟ','ଚ୍ୟା','ଚ୍ୟୁ','ଛ',
                                'ଛା','ଛି','ଛିି','ଛୁ','ଛେ','ଛୋ','ଜ','ଜା','ଜି','ଜୀ','ଜୁ','ଜୂ','ଜେ','ଜୈ','ଜୋ','ଜ୍ଜ','ଜ୍ଜା','ଜ୍ଜି','ଜ୍ଜୀ','ଜ୍ଜୁ',
                                'ଜ୍ଜ୍ଵ','ଜ୍ଜ୍ୱ','ଜ୍ଞ','ଜ୍ଞା','ଜ୍ଞୋ','ଜ୍ଞ୍ନା','ଜ୍ମ','ଜ୍ମା','ଜ୍ମୀ','ଜ୍ଯ','ଜ୍ର','ଜ୍ଵ','ଜ୍ୟ','ଜ୍ୟା','ଜ୍ୟୁ','ଜ୍ୟୈ','ଜ୍ୟୋ','ଜ୍ୱ','ଝ','ଝା',
                                'ଝି','ଝୁ','ଝେ','ଝୋ','ଞ','ଞ୍ଚ','ଞ୍ଚା','ଞ୍ଚି','ଞ୍ଚୁ','ଞ୍ଚେ','ଞ୍ଚୋ','ଞ୍ଛ','ଞ୍ଛା','ଞ୍ଜ','ଞ୍ଜା','ଞ୍ଜି','ଞ୍ଜୁ','ଞ୍ଜେ','ଞ୍ଜୋ','ଞ୍ଝ',
                                'ଞ୍ଝା','ଟ','ଟା','ଟି','ଟୀ','ଟୁ','ଟେ','ଟୋ','ଟ୍କେ','ଟ୍ଟ','ଟ୍ଟା','ଟ୍ଟି','ଟ୍ର','ଟ୍ରା','ଟ୍ରି','ଟ୍ରୁ','ଟ୍ରେ','ଟ୍ରୋ','ଟ୍ଲା','ଟ୍ସ',
                                'ଟ୍ୟ','ଟ୍ୟୁ','ଟ୍ୱି','ଠ','ଠା','ଠି','ଠୀ','ଠୁ','ଠେ','ଠୋ','ଠ୍ୟ','ଡ','ଡା','ଡି','ଡୀ','ଡୁ','ଡେ','ଡୋ','ଡ୍-','ଡ୍ଡା',
                                'ଡ୍ଡୀ','ଡ୍ର','ଡ୍ରା','ଡ୍ରି','ଡ୍ରେ','ଡ୍ରୋ','ଡ୍ୟା','ଢ','ଢା','ଢି','ଢୀ','ଢୁ','ଢେ','ଢୋ','ଣ','ଣା','ଣି','ଣୀ','ଣୁ','ଣେ',
                                'ଣୋ','ଣ୍ଟ','ଣ୍ଟା','ଣ୍ଟି','ଣ୍ଟୁ','ଣ୍ଟେ','ଣ୍ଟୋ','ଣ୍ଟ୍ରା','ଣ୍ଟ୍ରି','ଣ୍ଟ୍ରେ','ଣ୍ଟ୍ରୋ','ଣ୍ଠ','ଣ୍ଠା','ଣ୍ଠି','ଣ୍ଠୁ','ଣ୍ଡ','ଣ୍ଡା','ଣ୍ଡି','ଣ୍ଡୀ','ଣ୍ଡୁ',
                                'ଣ୍ଡେ','ଣ୍ଡୋ','ଣ୍ଡ୍ର','ଣ୍ଡ୍ରି','ଣ୍ଡ୍ରୋ','ଣ୍ଢା','ଣ୍ଢେ','ଣ୍ତି','ଣ୍ମ','ଣ୍ଵ','ଣ୍ୟ','ଣ୍ୱ','ତ','ତା','ତି','ତୀ','ତୁ','ତୂ','ତେ','ତୈ',
                                'ତୋ','ତୌ','ତ୍କ','ତ୍କା','ତ୍ତ','ତ୍ତା','ତ୍ତି','ତ୍ତୁ','ତ୍ତେ','ତ୍ତୋ','ତ୍ତ୍ର','ତ୍ତ୍ଵ','ତ୍ତ୍ଵି','ତ୍ତ୍ୟ','ତ୍ତ୍ୱ','ତ୍ତ୍ୱା','ତ୍ତ୍ୱି','ତ୍ନ','ତ୍ନା','ତ୍ନି',
                                'ତ୍ନୀ','ତ୍ପ','ତ୍ପା','ତ୍ବ','ତ୍ମ','ତ୍ମା','ତ୍ମି','ତ୍ମ୍ୟ','ତ୍ର','ତ୍ରା','ତ୍ରି','ତ୍ରୀ','ତ୍ରୁ','ତ୍ରେ','ତ୍ରୋ','ତ୍ଵ','ତ୍ସ','ତ୍ସା','ତ୍ସେ','ତ୍ୟ',
                                'ତ୍ୟା','ତ୍ୟି','ତ୍ୟୁ','ତ୍ୟେ','ତ୍ୱ','ତ୍ୱା','ତ୍ୱେ','ତୖ','ତୗ','ଥ','ଥା','ଥି','ଥୀ','ଥୁ','ଥେ','ଥୋ','ଥ୍ର','ଥ୍ରୋ','ଥ୍ୟ','ଦ',
                                'ଦା','ଦି','ଦୀ','ଦୁ','ଦୂ','ଦେ','ଦୈ','ଦୋ','ଦୌ','ଦ୍ଗୀ','ଦ୍ଘା','ଦ୍ଜା','ଦ୍ଦ','ଦ୍ଦି','ଦ୍ଦୀ','ଦ୍ଦୁ','ଦ୍ଦେ','ଦ୍ଦ୍ୟେ','ଦ୍ଧ','ଦ୍ଧା',
                                'ଦ୍ଧି','ଦ୍ଧେ','ଦ୍ଧ୍ଯ','ଦ୍ବ','ଦ୍ବା','ଦ୍ଭ','ଦ୍ଭି','ଦ୍ଭୁ','ଦ୍ମ','ଦ୍ମା','ଦ୍ଯା','ଦ୍ର','ଦ୍ରା','ଦ୍ରି','ଦ୍ରୀ','ଦ୍ରୁ','ଦ୍ରେ','ଦ୍ରୋ','ଦ୍ରୌ','ଦ୍ର୍ୟ',
                                'ଦ୍ଵ','ଦ୍ଵା','ଦ୍ଵି','ଦ୍ଵୀ','ଦ୍ୟ','ଦ୍ୟା','ଦ୍ୟୁ','ଦ୍ୟୋ','ଦ୍ୱ','ଦ୍ୱା','ଦ୍ୱି','ଦ୍ୱୀ','ଦ୍ୱେ','ଧ','ଧା','ଧି','ଧୀ','ଧୁ','ଧୂ','ଧେ',
                                'ଧୋ','ଧ୍ବ','ଧ୍ଯ','ଧ୍ଵ','ଧ୍ୟ','ଧ୍ୟା','ଧ୍ୱ','ଧ୍ୱୀ','ନ','ନା','ନି','ନୀ','ନୁ','ନୂ','ନେ','ନୈ','ନୋ','ନୌ','ନ୍-','ନ୍ଗ',
                                'ନ୍ଟ','ନ୍ଟା','ନ୍ଟି','ନ୍ଡ','ନ୍ଡା','ନ୍ଡେ','ନ୍ଡ୍ରା','ନ୍ଡ୍ରୋ','ନ୍ତ','ନ୍ତା','ନ୍ତି','ନ୍ତୀ','ନ୍ତୁ','ନ୍ତେ','ନ୍ତୋ','ନ୍ତ୍ର','ନ୍ତ୍ରା','ନ୍ତ୍ରି','ନ୍ତ୍ରୀ','ନ୍ଥ',
                                'ନ୍ଥା','ନ୍ଥି','ନ୍ଥୀ','ନ୍ଥେ','ନ୍ଥୋ','ନ୍ଦ','ନ୍ଦା','ନ୍ଦି','ନ୍ଦୀ','ନ୍ଦୁ','ନ୍ଦୂ','ନ୍ଦେ','ନ୍ଦୋ','ନ୍ଦ୍ର','ନ୍ଦ୍ରା','ନ୍ଦ୍ରି','ନ୍ଦ୍ୱ','ନ୍ଧ','ନ୍ଧା','ନ୍ଧି',
                                'ନ୍ଧୀ','ନ୍ଧୁ','ନ୍ଧେ','ନ୍ଧ୍ର','ନ୍ଧ୍ୟା','ନ୍ନ','ନ୍ନା','ନ୍ନି','ନ୍ନ୍ୟା','ନ୍ଫୋ','ନ୍ବି','ନ୍ମ','ନ୍ମା','ନ୍ମି','ନ୍ମୁ','ନ୍ମେ','ନ୍ମୋ','ନ୍ଯ','ନ୍ଯା','ନ୍ର',
                                'ନ୍ରି','ନ୍ଵ','ନ୍ଵି','ନ୍ଵେ','ନ୍ସ','ନ୍ସା','ନ୍ସି','ନ୍ସୀ','ନ୍ସେ','ନ୍ୟ','ନ୍ୟା','ନ୍ୟୁ','ନ୍ୱି','ପ','ପା','ପି','ପୀ','ପୁ','ପୂ','ପେ',
                                'ପୈ','ପୋ','ପୌ','ପ୍ଟ','ପ୍ଟା','ପ୍ଟି','ପ୍ଟେ','ପ୍ଟୋ','ପ୍ତ','ପ୍ତା','ପ୍ତି','ପ୍ତୋ','ପ୍ନ','ପ୍ପ','ପ୍ପି','ପ୍ର','ପ୍ରା','ପ୍ରି','ପ୍ରୀ','ପ୍ରୁ',
                                'ପ୍ରେ','ପ୍ରୋ','ପ୍ରୌ','ପ୍ଲ','ପ୍ଲା','ପ୍ଲୁ','ପ୍ଲେ','ପ୍ଲୋ','ପ୍ଳ','ପ୍ଳା','ପ୍ଳୁ','ପ୍ଳୋ','ପ୍ସ','ପ୍ସି','ପ୍ୟା','ପ୍ୟୁ','ଫ','ଫା','ଫି','ଫୀ',
                                'ଫୁ','ଫେ','ଫୈ','ଫୋ','ଫ୍ଟ','ଫ୍ତା','ଫ୍ଫ','ଫ୍ର','ଫ୍ରା','ଫ୍ରି','ଫ୍ରୀ','ଫ୍ରେ','ଫ୍ରୋ','ଫ୍ଲ','ଫ୍ଲା','ଫ୍ଲି','ଫ୍ଲୁ','ଫ୍ଲେ','ଫ୍ଲୋ','ଫ୍ଳା',
                                'ଫ୍ୟା','ଫ୍ୟୁ','ବ','ବା','ବି','ବିା','ବୀ','ବୁ','ବେ','ବୈ','ବୋ','ବୌ','ବ୍-','ବ୍ଜ','ବ୍ଡି','ବ୍ଦ','ବ୍ଦା','ବ୍ଦି','ବ୍ଦୀ','ବ୍ଧ',
                                'ବ୍ଧୋ','ବ୍ନି','ବ୍ବ','ବ୍ର','ବ୍ରା','ବ୍ରି','ବ୍ରୁ','ବ୍ରେ','ବ୍ରୋ','ବ୍ଲ','ବ୍ଲା','ବ୍ଲି','ବ୍ଲୋ','ବ୍ଳ','ବ୍ଳା','ବ୍ସ','ବ୍ସା','ବ୍ୟ','ବ୍ୟା','ବ୍ୟୁ',
                                'ଭ','ଭା','ଭି','ଭୀ','ଭୁ','ଭୂ','ଭେ','ଭୈ','ଭୋ','ଭୌ','ଭ୍ର','ଭ୍ରା','ଭ୍ରୂ','ଭ୍ରୋ','ଭ୍ୟ','ଭ୍ୟା','ମ','ମା','ମି','ମୀ',
                                'ମୁ','ମୂ','ମେ','ମୈ','ମୋ','ମୌ','ମ୍-','ମ୍ନ','ମ୍ନା','ମ୍ପ','ମ୍ପା','ମ୍ପି','ମ୍ପୁ','ମ୍ପୂ','ମ୍ପେ','ମ୍ପ୍ର','ମ୍ପ୍ଲା','ମ୍ପ୍ଲେ','ମ୍ପ୍ୟୁ','ମ୍ଫ',
                                'ମ୍ଫା','ମ୍ଫେ','ମ୍ଫୋ','ମ୍ଫ୍ରୀ','ମ୍ବ','ମ୍ବା','ମ୍ବି','ମ୍ବୀ','ମ୍ବୁ','ମ୍ବେ','ମ୍ବୋ','ମ୍ବ୍ରେ','ମ୍ଭ','ମ୍ଭା','ମ୍ଭୀ','ମ୍ଭୁ','ମ୍ଭେ','ମ୍ଭୋ','ମ୍ଭ୍ରା','ମ୍ମ',
                                'ମ୍ମା','ମ୍ମି','ମ୍ମୁ','ମ୍ମୋ','ମ୍ମ୍ଯୁ','ମ୍ମ୍ୟୁ','ମ୍ର','ମ୍ରା','ମ୍ରି','ମ୍ରେ','ମ୍ଲି','ମ୍ଳ','ମ୍ଳି','ମ୍ଵା','ମ୍ସ','ମ୍ୟ','ମ୍ୟା','ମ୍ୟୁ','ମ୍ୱ','ମ୍ୱା',
                                'ମ୍ୱି','ମ୍ୱୋ','ଯ','ଯା','ଯି','ଯୁ','ଯେ','ଯୋ','ଯୌ','ଯ୍ୟ','ଯ୍ୟା','ର','ରା','ରି','ରୀ','ରୁ','ରୂ','ରେ','ରୋ','ର୍କ',
                                'ର୍କା','ର୍କି','ର୍କୀ','ର୍କୁ','ର୍କେ','ର୍କୋ','ର୍କ୍ଲୀ','ର୍କ୍ସୀ','ର୍ଖ','ର୍ଗ','ର୍ଗା','ର୍ଗୀ','ର୍ଗୁ','ର୍ଗେ','ର୍ଘ','ର୍ଘେ','ର୍ଘ୍ଯ','ର୍ଘ୍ୟ','ର୍ଚ','ର୍ଚା',
                                'ର୍ଚ୍ଚ','ର୍ଚ୍ଚା','ର୍ଚ୍ଛା','ର୍ଚ୍ଛି','ର୍ଜ','ର୍ଜା','ର୍ଜି','ର୍ଜୀ','ର୍ଜୁ','ର୍ଜେ','ର୍ଜ୍ଜ','ର୍ଜ୍ଜୁ','ର୍ଜ୍ୟ','ର୍ଜ୍ୟା','ର୍ଟ','ର୍ଟି','ର୍ଟେ','ର୍ଟୋ','ର୍ଟ୍ସ','ର୍ଡ',
                                'ର୍ଡି','ର୍ଡୋ','ର୍ଣ','ର୍ଣା','ର୍ଣ୍ଣ','ର୍ଣ୍ଣା','ର୍ଣ୍ଣି','ର୍ଣ୍ଣେ','ର୍ଣ୍ନ','ର୍ତ','ର୍ତା','ର୍ତି','ର୍ତୀ','ର୍ତେ','ର୍ତ୍ତ','ର୍ତ୍ତା','ର୍ତ୍ତି','ର୍ତ୍ତୀ','ର୍ତ୍ତେ','ର୍ତ୍ତୋ',
                                'ର୍ତ୍ତ୍ରୀ','ର୍ତ୍ତ୍ୟ','ର୍ତ୍ୟ','ର୍ଥ','ର୍ଥା','ର୍ଥି','ର୍ଥୀ','ର୍ଥେ','ର୍ଥୋ','ର୍ଥ୍ରା','ର୍ଥ୍ୟ','ର୍ଦି','ର୍ଦୁ','ର୍ଦେ','ର୍ଦ୍ଦ','ର୍ଦ୍ଦା','ର୍ଦ୍ଦି','ର୍ଦ୍ଦେ','ର୍ଦ୍ଦ୍ୟ','ର୍ଦ୍ଧ',
                                'ର୍ଦ୍ଧା','ର୍ଦ୍ଧି','ର୍ଦ୍ଧୁ','ର୍ଦ୍ଧେ','ର୍ଦ୍ଧ୍ବ','ର୍ଦ୍ଧ୍ଵ','ର୍ଦ୍ଧ୍ୱ','ର୍ଦ୍ର','ର୍ଧ','ର୍ଧା','ର୍ଧ୍ହ','ର୍ନ','ର୍ନା','ର୍ନି','ର୍ନୀ','ର୍ନେ','ର୍ନ୍ତ','ର୍ପ','ର୍ପା','ର୍ପି',
                                'ର୍ପୋ','ର୍ଫି','ର୍ଫୋ','ର୍ବ','ର୍ବା','ର୍ବି','ର୍ବୁ','ର୍ବେ','ର୍ବୋ','ର୍ଭ','ର୍ଭା','ର୍ଭି','ର୍ଭୁ','ର୍ଭୂ','ର୍ଭେ','ର୍ମ','ର୍ମା','ର୍ମି','ର୍ମୀ','ର୍ମୁ',
                                'ର୍ମେ','ର୍ମୋ','ର୍ଯ','ର୍ଯା','ର୍ଯ୍ୟ','ର୍ଯ୍ୟା','ର୍ଯ୍ୟୋ','ର୍ରେ','ର୍ଲ','ର୍ଲା','ର୍ଲି','ର୍ଲେ','ର୍ଳେ','ର୍ଶ','ର୍ଶା','ର୍ଶି','ର୍ଶୀ','ର୍ଶୁ','ର୍ଶ୍ବ','ର୍ଶ୍ବି',
                                'ର୍ଶ୍ଵ','ର୍ଶ୍ୱ','ର୍ଷ','ର୍ଷା','ର୍ଷି','ର୍ଷେ','ର୍ସ','ର୍ସା','ର୍ସି','ର୍ସୀ','ର୍ସେ','ର୍ହା','ର୍ୟ','ର୍ୟ୍ୟ','ର୍ୱେ','ଲ','ଲା','ଲି','ଲୀ','ଲୁ',
                                'ଲେ','ଲୋ','ଲୌ','ଲ୍ଗୁ','ଲ୍ଟ','ଲ୍ଟା','ଲ୍ଟି','ଲ୍ଟ୍ରା','ଲ୍ଡ','ଲ୍ଡି','ଲ୍ଡେ','ଲ୍ତ','ଲ୍ତୁ','ଲ୍ଥ','ଲ୍ପ','ଲ୍ଫ','ଲ୍ବ','ଲ୍ବି','ଲ୍ଭ','ଲ୍ମ',
                                'ଲ୍ମୀ','ଲ୍ର','ଲ୍ଲ','ଲ୍ଲା','ଲ୍ଲି','ଲ୍ଲୀ','ଲ୍ଲେ','ଲ୍ଲୋ','ଲ୍ସ','ଲ୍ହା','ଲ୍ୟ','ଲ୍ୟା','ଲ୍ୟୁ','ଳ','ଳା','ଳି','ଳୀ','ଳୁ','ଳେ','ଳୋ',
                                'ଳ୍କ','ଳ୍ପ','ଳ୍ପା','ଳ୍ପି','ଳ୍ପୀ','ଳ୍ମ','ଳ୍ଳ','ଵ','ଵା','ଵି','ଵେ','ଶ','ଶା','ଶି','ଶୀ','ଶୁ','ଶୂ','ଶେ','ଶୈ','ଶୋ',
                                'ଶୌ','ଶ୍ଚ','ଶ୍ଚା','ଶ୍ଚି','ଶ୍ନ','ଶ୍ନା','ଶ୍ବ','ଶ୍ବା','ଶ୍ବେ','ଶ୍ମ','ଶ୍ମି','ଶ୍ମୀ','ଶ୍ଯୁ','ଶ୍ର','ଶ୍ରା','ଶ୍ରି','ଶ୍ରୀ','ଶ୍ରୁ','ଶ୍ରେ','ଶ୍ରୋ',
                                'ଶ୍ରୌ','ଶ୍ଲୀ','ଶ୍ଳି','ଶ୍ଳେ','ଶ୍ଳୋ','ଶ୍ଵ','ଶ୍ଵା','ଶ୍ଵି','ଶ୍ଵେ','ଶ୍ଶୁ','ଶ୍ସ','ଶ୍ୟ','ଶ୍ୟା','ଶ୍ୱ','ଶ୍ୱା','ଶ୍ୱେ','ଷ','ଷା','ଷି','ଷୀ',
                                'ଷୁ','ଷେ','ଷୋ','ଷ୍କ','ଷ୍କା','ଷ୍କ୍ରି','ଷ୍ଟ','ଷ୍ଟା','ଷ୍ଟି','ଷ୍ଟୀ','ଷ୍ଟୁ','ଷ୍ଟେ','ଷ୍ଟୋ','ଷ୍ଟ୍ର','ଷ୍ଟ୍ରା','ଷ୍ଟ୍ରି','ଷ୍ଟ୍ରୀ','ଷ୍ଟ୍ରେ','ଷ୍ଟ୍ରୋ','ଷ୍ଟ୍ୟ',
                                'ଷ୍ଠ','ଷ୍ଠା','ଷ୍ଠି','ଷ୍ଠୀ','ଷ୍ଠୁ','ଷ୍ଣ','ଷ୍ଣା','ଷ୍ଣୁ','ଷ୍ଣୋ','ଷ୍ପ','ଷ୍ପା','ଷ୍ପୀ','ଷ୍ପେ','ଷ୍ପ୍ର','ଷ୍ଫୁ','ଷ୍ମ','ଷ୍ମା','ଷ୍ଵ','ଷ୍ୟ','ଷ୍ୟା',
                                'ସ','ସା','ସି','ସୀ','ସୁ','ସୂ','ସେ','ସୈ','ସୋ','ସୌ','ସ୍-','ସ୍ଏ','ସ୍କ','ସ୍କା','ସ୍କି','ସ୍କୁ','ସ୍କେ','ସ୍କୋ','ସ୍କ୍ରି','ସ୍କ୍ରୀ',
                                'ସ୍କ୍ରୁ','ସ୍କ୍ରୋ','ସ୍କ୍ଲେ','ସ୍ଖି','ସ୍ଙ','ସ୍ଚୁ','ସ୍ଟ','ସ୍ଟା','ସ୍ଟି','ସ୍ଟୁ','ସ୍ଟେ','ସ୍ଟୋ','ସ୍ଟ୍ରି','ସ୍ଟ୍ରୁ','ସ୍ଟ୍ରେ','ସ୍ଟ୍ରୋ','ସ୍ତ','ସ୍ତା','ସ୍ତି','ସ୍ତୀ',
                                'ସ୍ତୁ','ସ୍ତ୍ର','ସ୍ତ୍ରା','ସ୍ତ୍ରୀ','ସ୍ତ୍ରୁ','ସ୍ତ୍ରୋ','ସ୍ତ୍ୟ','ସ୍ଥ','ସ୍ଥା','ସ୍ଥି','ସ୍ଥୁ','ସ୍ଥୂ','ସ୍ଥ୍ୟ','ସ୍ନ','ସ୍ନା','ସ୍ନି','ସ୍ନେ','ସ୍ନୋ','ସ୍ପ','ସ୍ପା',
                                'ସ୍ପି','ସ୍ପେ','ସ୍ପୋ','ସ୍ପ୍ରି','ସ୍ଫ','ସ୍ଫା','ସ୍ଫି','ସ୍ଫୁ','ସ୍ବ','ସ୍ବା','ସ୍ବି','ସ୍ବେ','ସ୍ମ','ସ୍ମା','ସ୍ମି','ସ୍ମୋ','ସ୍ଯ','ସ୍ର','ସ୍ରା','ସ୍ରୋ',
                                'ସ୍ଲା','ସ୍ଲୁ','ସ୍ଲେ','ସ୍ଲୋ','ସ୍ଳ','ସ୍ଵ','ସ୍ଵା','ସ୍ଵି','ସ୍ଵୀ','ସ୍ଵେ','ସ୍ସା','ସ୍ସ୍ସ୍ବା','ସ୍ୟ','ସ୍ୟା','ସ୍ୱ','ସ୍ୱା','ସ୍ୱି','ସ୍ୱୀ','ସ୍ୱେ','ହ',
                                'ହା','ହି','ହୀ','ହୁ','ହୂ','ହେ','ହୋ','ହ୍ନ','ହ୍ନା','ହ୍ନି','ହ୍ନୁ','ହ୍ବା','ହ୍ମ','ହ୍ମା','ହ୍ମୀ','ହ୍ର','ହ୍ରା','ହ୍ଲା','ହ୍ଲେ','ହ୍ଵା',
                                'ହ୍ହି','ହ୍ୟ','ହ୍ୟା','ହ୍ୟୁ','ହ୍ୱ','ହ୍ୱା','଼','଼ା','଼ି','଼ୀ','଼ୁ','଼େ','଼ୋ','଼ୌ','ୁ୍ୟ','ୃ','ୄ','େ୍ରା','୍','ଡ଼',
                                'ଢ଼','ୟ','ୟା','ୟି','ୟୀ','ୟୁ','ୟୂ','ୟେ','ୟୋ','ୠ','ୡ','ୢ','ୣ','୦','୧','୨','୩','୪','୫','୬',
                                '୭','୮','୯','୰','ୱ','ୱା','ୱି','ୱେ','ୱୋ','ୱ୍ଏ']
    # vocab 
    unicodes               =    ['']+sorted(_unicodes+numbers+punctuations)
    components             =    ['']+sorted(_components+numbers+punctuations)
    valid                  =    ['']+sorted(dict_graphemes+numbers+punctuations)

#------------------------------------------------------------------------------------------------------------------------------------------------------
#######################################################################################################################################################
#------------------------------------------------------------------------------------------------------------------------------------------------------

class tamil:
    iden                   =    "tamil"

    numbers                =    ['௦', '௧', '௨', '௩', '௪', '௫', '௬', '௭', '௮', '௯', '௰', '௱', '௲']
    punctuations           =    ['!', '"', '#', '$', '%', '&', "'", '(', ')', '*', '+', ',', '-', '.', 
                                 '/', ':', ';', '<', '=', '>', '?', '@', '[', '\\', ']', '^', '_', '`',
                                 '{', '|', '}', '~', '।', '॥'] 
    # for grapheme decomp
    vowel_diacritics       =    ['ி', 'ீ', 'ு', 'ூ', 'ெ', 'ே', 'ொ', 'ோ', 'ை', 'ௌ']
    vocalics               =    []
    consonant_diacritics   =    [] # not used much
    modifiers              =    []
    connector              =    '்' # yes, this shit is Tamil hoshonto -_- 
    special_charecters     =    [connector,'\u200d', '\u200c']
    allow_conn_ending      =    True
    # vocab parts
    _unicodes              =    ['-','ஃ','அ','ஆ','இ','ஈ','உ','ஊ','எ','ஏ','ஐ','ஒ','ஓ','ஔ','க','ங','ச','ஜ','ஞ','ட','ண',
                                'த','ந','ன','ப','ம','ய','ர','ற','ல','ள','ழ','வ','ஶ','ஷ','ஸ','ஹ','ா','ி','ீ','ு',
                                'ூ','ெ','ே','ை','ொ','ோ','ௌ','்','ௐ','ௗ','௦','௧','௨','௩','௪','௫','௬','௭','௮','௯',
                                '௰','௱','௲','௳','௴','௵','௶','௷','௸','௹','௺']
    _components            =    ['-','ஃ','அ','ஆ','இ','ஈ','உ','ஊ','எ','ஏ','ஐ','ஒ','ஓ','ஔ','க','க்க','க்ச','க்ஞ','க்ட','க்ட்ர','க்ட்ஸ',
                                'க்த','க்ன','க்ப','க்ய','க்ர','க்ள','க்வ','க்ஷ','க்ஸ','க்ஸ்ட','க்ஸ்ப','ங','ங்க','ங்க்ல','ங்ங','ங்ப','ங்வ','ங்ஸ','ச','ச்இ',
                                'ச்க','ச்ச','ச்ட','ச்ன','ஜ','ஜ்ட','ஜ்ம','ஜ்ல','ஞ','ஞ்ச','ஞ்ஞ','ட','ட்க','ட்ச','ட்ச்ச','ட்ஜ','ட்ட','ட்ண','ட்ந','ட்ன',
                                'ட்ப','ட்ம','ட்ர','ட்ற','ட்ல','ட்வ','ட்ஸ','ட்ஸ்ம','ண','ண்க','ண்ச','ண்ட','ண்ட்ட','ண்ட்ர','ண்ட்ஸ','ண்ண','ண்த','ண்ப','ண்ம','ண்ய',
                                'ண்ற','ண்ல','ண்வ','ண்ஷ','ண்ஸ்ட','த','த்-','த்க','த்ச','த்த','த்ன','த்ப','த்ம','த்ய','த்ர','த்ல','த்வ','ந','ந்க','ந்த',
                                'ந்த்த','ந்ந','ன','ன்-','ன்ஃ','ன்அ','ன்க','ன்க்க','ன்ச','ன்ஜ','ன்ட','ன்ட்ட','ன்ட்ர','ன்ண','ன்த','ன்ந','ன்ன','ன்ன்ண','ன்ப','ன்ம',
                                'ன்ய','ன்ர','ன்ற','ன்ல','ன்ழ','ன்வ','ன்ஸ','ன்ஸ்க','ன்ஸ்ட','ன்ஹ','ப','ப்க','ப்ச','ப்ஜ','ப்ட','ப்ட்ம','ப்ட்வ','ப்த','ப்ப','ப்ப்ப',
                                'ப்ப்ர','ப்ம','ப்ய','ப்ர','ப்ல','ப்ள','ப்வ','ப்ஸ','ம','ம்-','ம்அ','ம்உ','ம்எ','ம்க','ம்ச','ம்ஜ','ம்ட','ம்த','ம்ந','ம்ன',
                                'ம்ன்ன','ம்ப','ம்ப்ய','ம்ப்ள','ம்ம','ம்ய','ம்ர','ம்ல','ம்ள','ம்வ','ம்ஸ','ம்ஸ்ட','ய','ய்க','ய்க்க','ய்ச','ய்ச்ச','ய்ட','ய்த','ய்த்த',
                                'ய்ந','ய்ந்த','ய்ன','ய்ன்ம','ய்ப','ய்ப்ப','ய்ம','ய்ய','ய்ர','ய்ல','ய்ல்ப','ய்வ','ய்ஸ','ர','ர்-','ர்ஃ','ர்ஆ','ர்இ','ர்எ','ர்க',
                                'ர்க்க','ர்க்ச','ர்க்ஸ','ர்ச','ர்ச்ச','ர்ஜ','ர்ட','ர்ட்ட','ர்ட்ன','ர்ட்ப்ர','ர்ண','ர்த','ர்த்த','ர்ந','ர்ந்த','ர்ந்த்த','ர்ன','ர்ன்ற','ர்ப','ர்ப்ப',
                                'ர்ப்ர','ர்ம','ர்ய','ர்ர','ர்ற','ர்ல','ர்ல்ம','ர்வ','ர்ஷ','ர்ஷ்ட','ர்ஸ','ர்ஸ்க','ர்ஸ்ப','ர்ஹ','ற','ற்க','ற்க்க','ற்ச','ற்த','ற்ப',
                                'ற்ற','ல','ல்-','ல்ஃ','ல்எ','ல்ஏ','ல்க','ல்ச','ல்ஜ','ல்ட','ல்த','ல்ந','ல்ப','ல்ப்ப','ல்ம','ல்ய','ல்ர','ல்ற','ல்ல','ல்வ',
                                'ல்ஸ','ல்ஹ','ள','ள்-','ள்க','ள்ட','ள்த','ள்ந','ள்ன','ள்ப','ள்ம','ள்ர','ள்ல','ள்ல்ல','ள்ள','ள்வ','ழ','ழ்க','ழ்க்க','ழ்ச',
                                'ழ்ச்ச','ழ்த','ழ்த்த','ழ்ந','ழ்ந்த','ழ்ப','ழ்ப்ப','ழ்ம','ழ்ற்ச','ழ்வ','வ','வ்த','வ்ய','வ்ள','வ்வ','வ்வ்வ்வ','ஶ்ர','ஷ','ஷ்க','ஷ்ச',
                                'ஷ்ட','ஷ்ண','ஷ்ன','ஷ்ப','ஷ்ம','ஷ்ய','ஷ்ர','ஷ்வ','ஸ','ஸ்எ','ஸ்க','ஸ்க்க','ஸ்ட','ஸ்ட்இ','ஸ்ட்க','ஸ்ட்ட','ஸ்ட்ர','ஸ்த','ஸ்ந','ஸ்ன',
                                'ஸ்ப','ஸ்ப்ப','ஸ்ம','ஸ்ய','ஸ்ர','ஸ்ல','ஸ்வ','ஸ்ஷ','ஹ','ஹ்உ','ஹ்ர','ஹ்வ','ஹ்ஹ','ா','ி','ி்ங்ட','ி்ன','ி்ழ்ம','ீ','ு',
                                'ூ','ெ','ே','ை','ொ','ோ','ௌ','்','ௐ','ௗ','௦','௧','௨','௩','௪','௫','௬','௭','௮','௯',
                                '௰','௱','௲','௳','௴','௵','௶','௷','௸','௹','௺']
    dict_graphemes         =    ['-','ஃ','அ','ஆ','இ','ஈ','உ','ஊ','எ','ஏ','ஐ','ஒ','ஓ','ஔ','க','கி','கீ','கு','கூ','கெ','கே',
                                'கை','கொ','கோ','கௌ','க்க','க்கி','க்கீ','க்கு','க்கூ','க்கெ','க்கே','க்கை','க்கொ','க்கோ','க்ச','க்சி','க்சே','க்சை','க்ஞை','க்ட',
                                'க்டி','க்டீ','க்டே','க்டோ','க்ட்ர','க்ட்ஸ','க்த','க்தி','க்தே','க்ன','க்னி','க்பூ','க்பெ','க்போ','க்யூ','க்ர','க்ரி','க்ரு','க்ரே','க்ரோ',
                                'க்ள','க்ளி','க்ளை','க்வி','க்வே','க்ஷ','க்ஸ','க்ஸி','க்ஸ்ட','க்ஸ்பி','க்ஸ்பு','ங','ஙூ','ங்க','ங்கி','ங்கீ','ங்கு','ங்கூ','ங்கே','ங்கை',
                                'ங்கொ','ங்கோ','ங்க்ல','ங்ங','ங்பெ','ங்வூ','ங்ஸீ','ச','சி','சீ','சு','சூ','செ','சே','சை','சொ','சோ','சௌ','ச்இ','ச்கே',
                                'ச்ச','ச்சி','ச்சீ','ச்சு','ச்சூ','ச்செ','ச்சே','ச்சை','ச்சொ','ச்சோ','ச்டி','ச்னை','ஜ','ஜி','ஜீ','ஜு','ஜூ','ஜெ','ஜே','ஜை',
                                'ஜோ','ஜ்ட','ஜ்மு','ஜ்மெ','ஜ்ல','ஞ','ஞு','ஞ்ச','ஞ்சி','ஞ்சீ','ஞ்சு','ஞ்செ','ஞ்சை','ஞ்சொ','ஞ்ஞ','ட','டி','டீ','டு','டூ',
                                'டெ','டே','டை','டொ','டோ','ட்க','ட்கி','ட்கு','ட்கை','ட்கொ','ட்ச','ட்சி','ட்சு','ட்சே','ட்சை','ட்சோ','ட்ச்ச','ட்ஜெ','ட்ட','ட்டி',
                                'ட்டீ','ட்டு','ட்டூ','ட்டெ','ட்டே','ட்டை','ட்டோ','ட்ண','ட்நை','ட்நொ','ட்னி','ட்ப','ட்பி','ட்பு','ட்பே','ட்பை','ட்ம','ட்மி','ட்ர','ட்ரி',
                                'ட்ரு','ட்ரெ','ட்ரை','ட்ரோ','ட்ற','ட்றோ','ட்ல','ட்வ','ட்வெ','ட்வை','ட்ஸ','ட்ஸ்மை','ண','ணி','ணீ','ணு','ணூ','ணே','ணை','ண்க',
                                'ண்கி','ண்கூ','ண்கொ','ண்ச','ண்ட','ண்டி','ண்டீ','ண்டு','ண்டெ','ண்டே','ண்டை','ண்டோ','ண்ட்ட','ண்ட்ர','ண்ட்ரோ','ண்ட்ஸ','ண்ண','ண்ணி','ண்ணீ','ண்ணு',
                                'ண்ணூ','ண்ணெ','ண்ணே','ண்ணை','ண்ணொ','ண்ணோ','ண்தி','ண்ப','ண்பி','ண்பு','ண்போ','ண்ம','ண்மி','ண்மீ','ண்மு','ண்மூ','ண்மை','ண்ய','ண்ற','ண்றி',
                                'ண்லோ','ண்வ','ண்வி','ண்ஷோ','ண்ஸ்ட','த','தி','தீ','து','தூ','தெ','தே','தை','தொ','தொி','தோ','த்-','த்க','த்கீ','த்கு',
                                'த்ச','த்த','த்தி','த்தீ','த்து','த்தூ','த்தெ','த்தே','த்தை','த்தொ','த்தோ','த்ன','த்ப','த்பொ','த்ம','த்மி','த்ய','த்யே','த்ர','த்ரி',
                                'த்ரு','த்ரூ','த்லி','த்வ','ந','நி','நீ','நு','நூ','நெ','நே','நை','நொ','நோ','ந்கி','ந்த','ந்தி','ந்தீ','ந்து','ந்தூ',
                                'ந்தே','ந்தை','ந்தொ','ந்தோ','ந்த்த','ந்த்தி','ந்ந','ந்நி','ந்நூ','ந்நோ','ன','னி','னீ','னு','னூ','னெ','னே','னை','னொ','னோ',
                                'ன்-','ன்ஃ','ன்அ','ன்க','ன்கி','ன்கீ','ன்கு','ன்கே','ன்கை','ன்க்கு','ன்ச','ன்சி','ன்சு','ன்சூ','ன்செ','ன்சே','ன்ஜி','ன்ட','ன்டி','ன்டீ',
                                'ன்டு','ன்டெ','ன்டை','ன்டோ','ன்ட்டி','ன்ட்ர','ன்ட்ரோ','ன்ணி','ன்த','ன்தொ','ன்ந','ன்நி','ன்நெ','ன்ன','ன்னி','ன்னீ','ன்னு','ன்னூ','ன்னெ','ன்னே',
                                'ன்னை','ன்னொ','ன்னோ','ன்ன்ணி','ன்ப','ன்பி','ன்பு','ன்பெ','ன்பே','ன்பை','ன்பொ','ன்போ','ன்ம','ன்மி','ன்மீ','ன்மு','ன்மே','ன்மை','ன்மொ','ன்மோ',
                                'ன்ய','ன்யி','ன்ர','ன்ரு','ன்ற','ன்றி','ன்று','ன்றெ','ன்றே','ன்றை','ன்றோ','ன்ல','ன்லி','ன்லெ','ன்ழை','ன்வ','ன்வி','ன்வை','ன்ஸ','ன்ஸி',
                                'ன்ஸு','ன்ஸூ','ன்ஸை','ன்ஸ்க','ன்ஸ்ட','ன்ஸ்டீ','ன்ஹ','ப','பி','பீ','பு','பூ','பெ','பே','பை','பொ','பொி','போ','பௌ','ப்க',
                                'ப்ச','ப்சி','ப்சை','ப்ஜெ','ப்ட','ப்டி','ப்டை','ப்ட்மே','ப்ட்வே','ப்த','ப்தி','ப்து','ப்ப','ப்பி','ப்பீ','ப்பு','ப்பூ','ப்பெ','ப்பே','ப்பை',
                                'ப்பொ','ப்போ','ப்ப்பு','ப்ப்ரூ','ப்மொ','ப்யூ','ப்ர','ப்ரி','ப்ரீ','ப்ரெ','ப்ரே','ப்ரை','ப்ரோ','ப்ல','ப்ள','ப்ளி','ப்ளீ','ப்ளே','ப்ளை','ப்வே',
                                'ப்ஸ','ம','மி','மீ','மு','மூ','மெ','மே','மை','மொ','மோ','மௌ','ம்-','ம்அ','ம்உ','ம்எ','ம்க','ம்கு','ம்கூ','ம்கொ',
                                'ம்ச','ம்சு','ம்ஜி','ம்ட','ம்டே','ம்த','ம்தி','ம்ந','ம்ன','ம்னு','ம்ன்னு','ம்ப','ம்பி','ம்பீ','ம்பு','ம்பூ','ம்பெ','ம்பே','ம்பை','ம்பொ',
                                'ம்போ','ம்ப்யூ','ம்ப்ள','ம்ம','ம்மி','ம்மீ','ம்மு','ம்மூ','ம்மை','ம்மொ','ம்யூ','ம்ரி','ம்ரோ','ம்ல','ம்ள','ம்வ','ம்ஸ','ம்ஸ்ட','ய','யி',
                                'யீ','யு','யூ','யெ','யே','யை','யொ','யோ','ய்க','ய்கி','ய்கு','ய்க்க','ய்க்கி','ய்க்கு','ய்க்கொ','ய்ச','ய்ச்ச','ய்ச்சி','ய்ச்சு','ய்ட',
                                'ய்டெ','ய்த','ய்தி','ய்து','ய்தே','ய்த்தி','ய்த்து','ய்நி','ய்ந்த','ய்ந்தி','ய்ந்து','ய்ன','ய்ன்மெ','ய்ப','ய்பி','ய்ப்ப','ய்ப்பி','ய்ப்பு','ய்ப்பை','ய்ப்போ',
                                'ய்ம','ய்மூ','ய்மை','ய்மொ','ய்ய','ய்யி','ய்யு','ய்யை','ய்ர','ய்ல','ய்லி','ய்ல்ப','ய்வ','ய்வி','ய்வீ','ய்வு','ய்வூ','ய்வெ','ய்வே','ய்ஸ',
                                'ர','ரி','ரீ','ரு','ரூ','ரெ','ரே','ரை','ரொ','ரோ','ர்-','ர்ஃ','ர்ஆ','ர்இ','ர்எ','ர்க','ர்கி','ர்கு','ர்கூ','ர்கெ',
                                'ர்கே','ர்கை','ர்கொ','ர்கோ','ர்க்க','ர்க்கி','ர்க்கு','ர்க்கெ','ர்க்கை','ர்க்கொ','ர்க்சி','ர்க்சீ','ர்க்சு','ர்க்ஸி','ர்க்ஸீ','ர்ச','ர்சி','ர்சு','ர்ச்ச','ர்ச்சி',
                                'ர்ச்சீ','ர்ச்சு','ர்ச்சே','ர்ச்சை','ர்ஜ','ர்ஜி','ர்ஜு','ர்ஜூ','ர்ஜெ','ர்ட','ர்டி','ர்டு','ர்டெ','ர்டோ','ர்ட்ட','ர்ட்டி','ர்ட்டீ','ர்ட்டு','ர்ட்டோ','ர்ட்ன',
                                'ர்ட்ப்ரோ','ர்ண','ர்ணி','ர்ணோ','ர்த','ர்தி','ர்தை','ர்தொ','ர்த்த','ர்த்தி','ர்த்தீ','ர்த்து','ர்த்தெ','ர்த்தே','ர்த்தை','ர்ந','ர்நி','ர்நீ','ர்நெ','ர்நே',
                                'ர்நோ','ர்ந்த','ர்ந்தி','ர்ந்து','ர்ந்தெ','ர்ந்தே','ர்ந்த்து','ர்ன','ர்னி','ர்னு','ர்னோ','ர்ன்ற','ர்ப','ர்பி','ர்பீ','ர்பு','ர்பூ','ர்பெ','ர்பே','ர்பை',
                                'ர்போ','ர்ப்ப','ர்ப்பி','ர்ப்பு','ர்ப்பை','ர்ப்ரே','ர்ம','ர்மி','ர்மு','ர்மூ','ர்மை','ர்மோ','ர்ய','ர்ர','ர்ரி','ர்றீ','ர்ல','ர்ல்ம','ர்வ','ர்வி',
                                'ர்வீ','ர்வு','ர்வெ','ர்வே','ர்வை','ர்வொ','ர்வோ','ர்ஷி','ர்ஷ்ட','ர்ஸ','ர்ஸி','ர்ஸ்க','ர்ஸ்பெ','ர்ஹ','ற','றி','றீ','று','றூ','றெ',
                                'றே','றை','றொ','றோ','ற்க','ற்கி','ற்கு','ற்கூ','ற்கெ','ற்கே','ற்கை','ற்கொ','ற்கோ','ற்க்கு','ற்க்கொ','ற்ச','ற்சி','ற்சு','ற்செ','ற்த',
                                'ற்து','ற்ப','ற்பி','ற்பு','ற்பூ','ற்பெ','ற்பை','ற்பொ','ற்போ','ற்ற','ற்றி','ற்று','ற்றூ','ற்றெ','ற்றை','ற்றொ','ற்றோ','ல','லி','லீ',
                                'லு','லூ','லெ','லே','லை','லொ','லோ','லௌ','ல்-','ல்ஃ','ல்எ','ல்ஏ','ல்க','ல்கி','ல்கு','ல்கூ','ல்கோ','ல்ச','ல்சி','ல்செ',
                                'ல்ஜி','ல்ட','ல்டி','ல்டு','ல்டோ','ல்த','ல்தி','ல்து','ல்தே','ல்ந','ல்நி','ல்நீ','ல்நு','ல்ப','ல்பி','ல்பு','ல்பெ','ல்பை','ல்போ','ல்ப்ப',
                                'ல்ம','ல்மி','ல்மீ','ல்ய','ல்ர','ல்ற','ல்றே','ல்ல','ல்லி','ல்லீ','ல்லு','ல்லூ','ல்லெ','ல்லே','ல்லை','ல்லோ','ல்வ','ல்வி','ல்வீ','ல்வெ',
                                'ல்வே','ல்வோ','ல்ஸ','ல்ஹ','ள','ளி','ளீ','ளு','ளூ','ளே','ளை','ளொ','ளோ','ள்-','ள்க','ள்கி','ள்கு','ள்கூ','ள்கை','ள்ட',
                                'ள்த','ள்ந','ள்நி','ள்நோ','ள்னு','ள்ப','ள்பி','ள்போ','ள்ம','ள்மு','ள்மொ','ள்ர','ள்ல','ள்ல்ல','ள்ள','ள்ளி','ள்ளு','ள்ளூ','ள்ளே','ள்ளை',
                                'ள்ளோ','ள்வ','ள்வி','ள்வீ','ழ','ழி','ழீ','ழு','ழே','ழை','ழொ','ழ்க','ழ்கி','ழ்கை','ழ்க்க','ழ்க்கை','ழ்ச','ழ்சி','ழ்ச்ச','ழ்ச்சி',
                                'ழ்தே','ழ்த்த','ழ்த்தி','ழ்த்து','ழ்ந','ழ்நி','ழ்நெ','ழ்ந்த','ழ்ந்தி','ழ்ந்து','ழ்ப','ழ்பி','ழ்பெ','ழ்ப்ப','ழ்ப்பு','ழ்ம','ழ்மை','ழ்மொ','ழ்ற்ச','ழ்வ',
                                'ழ்வி','ழ்வு','ழ்வெ','ழ்வை','வ','வி','வீ','வு','வூ','வெ','வே','வை','வொ','வோ','வ்த','வ்ய','வ்ளோ','வ்வ','வ்வி','வ்வு',
                                'வ்வே','வ்வொ','வ்வ்வ்வ','ஶ்ரீ','ஷ','ஷி','ஷீ','ஷெ','ஷே','ஷை','ஷோ','ஷ்க','ஷ்கோ','ஷ்சு','ஷ்ட','ஷ்டி','ஷ்ண','ஷ்ணு','ஷ்ன','ஷ்ப',
                                'ஷ்பு','ஷ்ம','ஷ்மி','ஷ்மீ','ஷ்ய','ஷ்ர','ஷ்வ','ஸ','ஸி','ஸீ','ஸு','ஸெ','ஸை','ஸோ','ஸ்எ','ஸ்க','ஸ்கி','ஸ்கூ','ஸ்கெ','ஸ்கோ',
                                'ஸ்க்கி','ஸ்க்கு','ஸ்ட','ஸ்டி','ஸ்டீ','ஸ்டு','ஸ்டூ','ஸ்டெ','ஸ்டே','ஸ்டை','ஸ்டோ','ஸ்ட்இ','ஸ்ட்க','ஸ்ட்டு','ஸ்ட்ர','ஸ்ட்ரீ','ஸ்த','ஸ்தி','ஸ்தீ','ஸ்து',
                                'ஸ்தை','ஸ்ந','ஸ்ன','ஸ்ப','ஸ்பி','ஸ்பூ','ஸ்பெ','ஸ்பே','ஸ்ப்ப','ஸ்ம','ஸ்மி','ஸ்ய','ஸ்ர','ஸ்ரீ','ஸ்ரு','ஸ்ரே','ஸ்ரோ','ஸ்ல','ஸ்லி','ஸ்லீ',
                                'ஸ்வ','ஸ்வி','ஸ்ஷி','ஹ','ஹி','ஹீ','ஹு','ஹெ','ஹே','ஹை','ஹொ','ஹோ','ஹ்உ','ஹ்ரெ','ஹ்வி','ஹ்ஹ','ா','ாி','ி்ங்ட','ி்ன',
                                'ி்ழ்ம','்','ௐ','ௗ','௦','௧','௨','௩','௪','௫','௬','௭','௮','௯','௰','௱','௲','௳','௴','௵',
                                '௶','௷','௸','௹','௺']
    # vocab 
    unicodes               =    ['']+sorted(_unicodes+numbers+punctuations)
    components             =    ['']+sorted(_components+numbers+punctuations)
    valid                  =    ['']+sorted(dict_graphemes+numbers+punctuations)
#------------------------------------------------------------------------------------------------------------------------------------------------------
#######################################################################################################################################################
#------------------------------------------------------------------------------------------------------------------------------------------------------

class malyalam:
    iden                   =    "malyalam"

    numbers                =    ['൦', '൧', '൨', '൩', '൪', '൫', '൬', '൭', '൮', '൯']
    punctuations           =    ['!', '"', '#', '$', '%', '&', "'", '(', ')', '*', '+', ',', '-', '.', 
                                 '/', ':', ';', '<', '=', '>', '?', '@', '[', '\\', ']', '^', '_', '`',
                                 '{', '|', '}', '~', '।', '॥'] 
    # for grapheme decomp
    vowel_diacritics       =    ['െ', 'േ',  'ൈ', 'ൊ', 'ോ', 'ൌ', 'ി', 'ീ', 'ു', 'ൂ', 'ാ', 'ൗ']
    vocalics               =    ['ൃ']
    consonant_diacritics   =    ['ഃ', 'ം', 'ൎ']+vocalics # not used much
    modifiers              =    []
    connector              =    '്' # yes, this shit is malayalam hoshonto -_- 
    special_charecters     =    [connector,'\u200d', '\u200c']
    allow_conn_ending      =    True

    # vocab parts
    _unicodes              =    ['-',
                                'ം','ഃ','അ','ആ','ഇ','ഈ','ഉ','ഊ','ഋ','ഌ','എ','ഏ','ഐ','ഒ','ഓ','ഔ','ക','ഖ','ഗ','ഘ',
                                'ങ','ച','ഛ','ജ','ഝ','ഞ','ട','ഠ','ഡ','ഢ','ണ','ത','ഥ','ദ','ധ','ന','പ','ഫ','ബ','ഭ',
                                'മ','യ','ര','റ','ല','ള','ഴ','വ','ശ','ഷ','സ','ഹ','ാ','ി','ീ','ു','ൂ','ൃ','ൄ','െ',
                                'േ','ൈ','ൊ','ോ','ൌ','്','ൗ','ൠ','ൡ','ൢ','ൣ','൦','൧','൨','൩','൪','൫','൬','൭','൮',
                                '൯','൰','൱','൲','൳','൴','൵','൹','ൺ','ൻ','ർ','ൽ','ൾ','ൿ']
    _components            =    ['-','ം','ഃ','അ','ആ','ഇ','ഈ','ഉ','ഊ','ഋ','ഌ','എ','ഏ','ഐ','ഒ','ഓ','ഔ','ക','ക്ക','ക്ക്ല',
                                'ക്ട','ക്ട്ര','ക്ഡ്ര','ക്ത','ക്ബ','ക്മ','ക്യ','ക്ര','ക്റ്റ','ക്ല','ക്വ','ക്ഷ','ക്ഷ്ണ','ക്ഷ്മ','ക്ഷ്യ','ക്സ്റ്റ','ഖ','ഖ്യ','ഗ','ഗ്ഗ',
                                'ഗ്ദ','ഗ്ദ്ധ','ഗ്ധ','ഗ്ധ്യ','ഗ്ന','ഗ്മ','ഗ്യ','ഗ്ര','ഗ്ല','ഗ്വ','ഘ','ങ','ങ്ക','ങ്ക്ബ','ങ്ക്ര','ങ്ക്ല','ങ്ങ','ങ്മ','ങ്ഷ','ങ്ഹ',
                                'ച','ച്ച','ച്ച്ഡ','ച്ഛ','ച്യ','ഛ','ജ','ജ്ക','ജ്ജ','ജ്ജ്വ','ജ്ഞ','ജ്പ','ജ്പ്ര','ജ്ഭ','ജ്മ','ജ്യ','ജ്ര','ജ്വ','ഝ','ഞ',
                                'ഞ്ച','ഞ്ച്വ','ഞ്ജ','ഞ്ഞ','ട','ട്ട','ട്ട്ബ','ട്ട്യ','ട്ണ','ട്യ','ട്ര','ട്വ','ഠ','ഠ്യ','ഡ','ഡ്ക','ഡ്ജ','ഡ്ജ്മ','ഡ്ഡ','ഡ്ബ',
                                'ഡ്മ','ഡ്യ','ഡ്ര','ഡ്വ','ഢ','ഢ്യ','ണ','ണ്-','ണ്ട','ണ്ട്-','ണ്ഠ','ണ്ഡ','ണ്ണ','ണ്യ','ത','ത്ക','ത്ക്ക','ത്ഗ','ത്ഘ','ത്ത',
                                'ത്ത്ത','ത്ത്പ','ത്ത്യ','ത്ത്വ','ത്പ','ത്ഭ','ത്മ','ത്യ','ത്ര','ത്വ','ത്സ','ത്സ്യ','ഥ','ഥ്യ','ദ','ദ്അ','ദ്ക','ദ്ഗ','ദ്ഘ','ദ്ദ',
                                'ദ്ധ','ദ്ധ്യ','ദ്ഭ','ദ്മ','ദ്യ','ദ്ര','ദ്ര്യ','ദ്വ','ദ്ഷ','ധ','ധ്യ','ധ്ര','ധ്വ','ന','ന്ജ','ന്ത','ന്ത്യ','ന്ത്ര','ന്ത്ര്യ','ന്ത്വ',
                                'ന്ഥ','ന്ദ','ന്ദ്യ','ന്ദ്ര','ന്ധ','ന്ധ്യ','ന്ധ്ര','ന്ന','ന്ന്യ','ന്മ','ന്യ','ന്റ','ന്വ','പ','പ്ട','പ്ത','പ്ന','പ്പ','പ്പ്മ','പ്യ',
                                'പ്ര','പ്റ്റ','പ്ല','ഫ','ഫ്ജ','ഫ്ട','ഫ്ത','ഫ്ര','ഫ്റ്റ','ഫ്ല','ബ','ബ്ജ','ബ്ദ','ബ്പ','ബ്ബ','ബ്യ','ബ്ര','ബ്ല','ഭ','ഭ്യ',
                                'ഭ്ര','മ','മ്പ','മ്പ്യ','മ്പ്ര','മ്മ','മ്മ്യ','മ്യ','മ്ര','യ','യ്ക','യ്ക്ക','യ്ഗ','യ്ച്ച','യ്ഞ്ച','യ്ഡ','യ്ത','യ്ത്ത','യ്പ','യ്പ്പ',
                                'യ്മ','യ്യ','യ്സ്റ്റ','യ്ഹ','ര','ര്ന','ര്യ','റ','റ്മ','റ്റ','റ്റ്-','റ്റ്ബ്യ','റ്റ്വ','റ്റ്ഹ','ല','ല്ക','ല്ക്ക','ല്പ','ല്മ','ല്യ',
                                'ല്ല','ല്ല്യ','ള','ള്ള','ഴ','ഴ്ച','ഴ്ച്ച','ഴ്ത്ത','ഴ്ന്ന','ഴ്സ','വ','വ്ഗ','വ്യ','വ്ര','വ്വ','ശ','ശ്ച','ശ്ബ','ശ്മ','ശ്യ',
                                'ശ്ര','ശ്ല','ശ്വ','ശ്ശ','ഷ','ഷ്ട','ഷ്ട്ര','ഷ്ഠ','ഷ്ണ','ഷ്പ','ഷ്പ്പ','ഷ്മ','ഷ്യ','ഷ്ര്ട','ഷ്വ','സ','സ്-','സ്ആ','സ്ഇ','സ്എ',
                                'സ്ഗ','സ്ഗ്ര','സ്ജ','സ്ട','സ്ട്ര','സ്ഡ','സ്ത','സ്ത്യ','സ്ത്ര','സ്ഥ','സ്ന','സ്ഫ','സ്ബ','സ്മ','സ്യ','സ്ര','സ്റ്റ','സ്റ്റ്-','സ്റ്റ്ഓ','സ്റ്റ്ജ',
                                'സ്റ്റ്യ','സ്ല','സ്വ','സ്സ','സ്സ്-','സ്ഹ','ഹ','ഹ്ന','ഹ്മ','ഹ്യ','ഹ്ര','ഹ്റ്റ','ഹ്ല','ാ','ി','ീ','ു','ൂ','ൃ','ൄ',
                                'െ','േ','േ്ക','േ്ക്ക','േ്ഛ','േ്ത','ൈ','ൈ്വ','ൊ','ോ','ൌ','്','ൗ','ൠ','ൡ','ൢ','ൣ','൦','൧','൨',
                                '൩','൪','൫','൬','൭','൮','൯','൰','൱','൲','൳','൴','൵','൹','ൺ','ൻ','ർ','ൽ','ൾ','ൿ']
    
    dict_graphemes        =     ['ം','ഃ','അ','ആ','ഇ','ഈ','ഉ','ഊ','ഋ','ഌ','എ','ഏ','ഐ','ഒ','ഓ','ഔ','ക','കാ','കി','കീ',
                                'കു','കൂ','കെ','കേ','കൈ','കൊ','കോ','കൌ','ക്ക','ക്കാ','ക്കാാെ','ക്കി','ക്കീ','ക്കു','ക്കൂ','ക്കെ','ക്കേ','ക്കൈ','ക്കൊ','ക്കോ',
                                'ക്ക്ല','ക്കൗ','ക്ട','ക്ടി','ക്ടീ','ക്ടോ','ക്ട്രി','ക്ട്രോ','ക്ഡ്രി','ക്ത','ക്താ','ക്തി','ക്തീ','ക്ബ','ക്മി','ക്യ','ക്യാ','ക്യു','ക്യൂ','ക്ര',
                                'ക്രാ','ക്രി','ക്രീ','ക്രു','ക്രൂ','ക്രെ','ക്രേ','ക്രോ','ക്രൈ','ക്റ്റ','ക്ല','ക്ലാ','ക്ലി','ക്ലെ','ക്ലേ','ക്ലൈ','ക്ലോ','ക്ലൗ','ക്വ','ക്വി',
                                'ക്ഷ','ക്ഷാ','ക്ഷി','ക്ഷീ','ക്ഷെ','ക്ഷേ','ക്ഷോ','ക്ഷ്ണ','ക്ഷ്മ','ക്ഷ്മാ','ക്ഷ്മി','ക്ഷ്യ','ക്സ്റ്റ','കൗ','ഖ','ഖാ','ഖി','ഖു','ഖ്യ','ഖ്യാ',
                                'ഗ','ഗാ','ഗി','ഗീ','ഗു','ഗൂ','ഗെ','ഗേ','ഗൈ','ഗോ','ഗ്ഗ','ഗ്ദാ','ഗ്ദ്ധ','ഗ്ധ','ഗ്ധ്യ','ഗ്ന','ഗ്മി','ഗ്യ','ഗ്ര','ഗ്രാ',
                                'ഗ്രി','ഗ്രീ','ഗ്രൂ','ഗ്രേ','ഗ്രോ','ഗ്ല','ഗ്ലാ','ഗ്ലീ','ഗ്ലൂ','ഗ്വാ','ഗൗ','ഘ','ഘാ','ഘി','ഘു','ഘൂ','ഘോ','ങ','ങാ','ങി',
                                'ങ്ക','ങ്കാ','ങ്കി','ങ്കു','ങ്കൂ','ങ്കെ','ങ്കേ','ങ്കൊ','ങ്കോ','ങ്ക്ബ','ങ്ക്രാ','ങ്ക്രോ','ങ്ക്ലാ','ങ്ങ','ങ്ങാ','ങ്ങി','ങ്ങു','ങ്ങേ','ങ്ങോ','ങ്മൂ',
                                'ങ്ഷ','ങ്ഹാ','ങൗ','ച','ചാ','ചി','ചീ','ചു','ചൂ','ചെ','ചേ','ചൈ','ചൊ','ചോ','ച്ച','ച്ചാ','ച്ചി','ച്ചീ','ച്ചു','ച്ചൂ',
                                'ച്ചെ','ച്ചേ','ച്ചൊ','ച്ചോ','ച്ച്ഡു','ച്ഛ','ച്ഛാ','ച്ഛി','ച്യു','ചൗ','ഛ','ഛെ','ജ','ജാ','ജി','ജീ','ജു','ജൂ','ജെ','ജേ',
                                'ജൈ','ജോ','ജ്കു','ജ്ജ','ജ്ജീ','ജ്ജ്വ','ജ്ഞ','ജ്ഞാ','ജ്പ','ജ്പ്ര','ജ്ഭ','ജ്മാ','ജ്യ','ജ്യാ','ജ്യൂ','ജ്യേ','ജ്യോ','ജ്ര','ജ്വ','ഝോ',
                                'ഞ','ഞാ','ഞെ','ഞൊ','ഞ്ച','ഞ്ചാ','ഞ്ചി','ഞ്ചീ','ഞ്ചു','ഞ്ചൂ','ഞ്ചേ','ഞ്ചൈ','ഞ്ചോ','ഞ്ച്വ','ഞ്ജ','ഞ്ജി','ഞ്ജീ','ഞ്ജു','ഞ്ഞ','ഞ്ഞാ',
                                'ഞ്ഞി','ഞ്ഞു','ഞ്ഞൂ','ഞ്ഞെ','ഞ്ഞെു','ഞ്ഞേ','ഞ്ഞൊ','ഞ്ഞോ','ട','ടാ','ടി','ടീ','ടു','ടൂ','ടെ','ടേ','ടൈ','ടൊ','ടോ','ട്ട',
                                'ട്ടാ','ട്ടി','ട്ടീ','ട്ടു','ട്ടൂ','ട്ടെ','ട്ടേ','ട്ടൊ','ട്ടോ','ട്ട്ബു','ട്ട്യേ','ട്ടൗ','ട്ണി','ട്യ','ട്യൂ','ട്ര','ട്രാ','ട്രി','ട്രീ','ട്രൂ',
                                'ട്രെ','ട്രേ','ട്രോ','ട്രൈ','ട്രൗ','ട്വി','ട്വീ','ടൗ','ഠ','ഠാ','ഠി','ഠ്യ','ഡ','ഡാ','ഡി','ഡീ','ഡു','ഡൂ','ഡെ','ഡേ',
                                'ഡൈ','ഡൊ','ഡോ','ഡ്ക','ഡ്ജ','ഡ്ജാ','ഡ്ജി','ഡ്ജ്മു','ഡ്ഡ','ഡ്ഡി','ഡ്ബാ','ഡ്മി','ഡ്യൂ','ഡ്ര','ഡ്രാ','ഡ്രി','ഡ്രീ','ഡ്രോ','ഡ്രൈ','ഡ്വ',
                                'ഡ്വേ','ഡൗ','ഢ','ഢാ','ഢി','ഢു','ഢ്യ','ണ','ണാ','ണി','ണീ','ണു','ണൂ','ണെ','ണേ','ണോ','ണ്-','ണ്ട','ണ്ടാ','ണ്ടി',
                                'ണ്ടു','ണ്ടെ','ണ്ടേ','ണ്ടൊ','ണ്ടോ','ണ്ട്-','ണ്ഠ','ണ്ഡ','ണ്ഡാ','ണ്ഡി','ണ്ഡീ','ണ്ണ','ണ്ണാ','ണ്ണി','ണ്ണീ','ണ്ണു','ണ്ണൂ','ണ്ണെ','ണ്യ','ണ്യാ',
                                'ത','താ','തി','തീ','തു','തൂ','തെ','തേ','തൈ','തൊ','തോ','ത്ക','ത്കാ','ത്കു','ത്ക്ക','ത്ക്കാ','ത്ഗു','ത്ഘാ','ത്ത','ത്താ',
                                'ത്തി','ത്തീ','ത്തു','ത്തൂ','ത്തെ','ത്തേ','ത്തൊ','ത്തോ','ത്ത്തി','ത്ത്പീ','ത്ത്യാ','ത്ത്വ','ത്പ','ത്പാ','ത്ഭ','ത്ഭു','ത്മ','ത്മാ','ത്മു','ത്യ',
                                'ത്യാ','ത്യു','ത്യൂ','ത്യേ','ത്യോ','ത്ര','ത്രാ','ത്രി','ത്രീ','ത്രു','ത്രെ','ത്രേ','ത്രോ','ത്വ','ത്സ','ത്സാ','ത്സി','ത്സ്യ','ഥ','ഥാ',
                                'ഥി','ഥു','ഥേ','ഥോ','ഥ്യ','ഥ്യാ','ദ','ദാ','ദി','ദീ','ദു','ദൂ','ദേ','ദൈ','ദോ','ദ്അ','ദ്കാ','ദ്കു','ദ്ഗീ','ദ്ഘ',
                                'ദ്ഘാ','ദ്ദ','ദ്ദാ','ദ്ദി','ദ്ദീ','ദ്ദേ','ദ്ധ','ദ്ധാ','ദ്ധി','ദ്ധീ','ദ്ധേ','ദ്ധ്യ','ദ്ധ്യേ','ദ്ഭു','ദ്മ','ദ്യ','ദ്യാ','ദ്യു','ദ്യൂ','ദ്യോ',
                                'ദ്യോ','ദ്ര','ദ്രാ','ദ്രി','ദ്രു','ദ്രോ','ദ്ര്യ','ദ്വാ','ദ്വീ','ദ്വേ','ദ്ഷാ','ദൗ','ധ','ധാ','ധി','ധീ','ധു','ധൂ','ധേ','ധൈ',
                                'ധോ','ധ്യ','ധ്യാ','ധ്യേ','ധ്രു','ധ്വാ','ന','നാ','നി','നീ','നു','നൂ','നെ','നേ','നൈ','നൊ','നോ','ന്ജാ','ന്ത','ന്താ',
                                'ന്തി','ന്തു','ന്തൂ','ന്തെ','ന്തേ','ന്തൊ','ന്തോ','ന്ത്യ','ന്ത്യാ','ന്ത്ര','ന്ത്രാ','ന്ത്രി','ന്ത്ര്യ','ന്ത്വ','ന്ഥ','ന്ദ','ന്ദാ','ന്ദി','ന്ദീ','ന്ദു',
                                'ന്ദേ','ന്ദ്യ','ന്ദ്ര','ന്ദ്രീ','ന്ദ്രേ','ന്ദ്രോ','ന്ധ','ന്ധി','ന്ധു','ന്ധ്യ','ന്ധ്ര','ന്ധ്രാ','ന്ന','ന്നാ','ന്നി','ന്നീ','ന്നു','ന്നൂ','ന്നെ','ന്നേ',
                                'ന്നൈ','ന്നൊ','ന്നോ','ന്ന്യ','ന്ന്യാ','ന്മ','ന്മാ','ന്മു','ന്മൂ','ന്മേ','ന്യ','ന്യാ','ന്യു','ന്യൂ','ന്യേ','ന്യോ','ന്റ','ന്റാ','ന്റി','ന്റീ',
                                'ന്റു','ന്റെ','ന്റേ','ന്റോ','ന്വ','ന്വേ','പ','പാ','പി','പീ','പു','പൂ','പെ','പേ','പൈ','പൊ','പോ','പ്ടൗ','പ്ത','പ്തി',
                                'പ്ന','പ്പ','പ്പാ','പ്പി','പ്പീ','പ്പു','പ്പൂ','പ്പെ','പ്പേ','പ്പൊ','പ്പോ','പ്പ്മ','പ്യ','പ്യാ','പ്യൂ','പ്ര','പ്രാ','പ്രി','പ്രീ','പ്രെ',
                                'പ്രൊ','പ്രേ','പ്രോ','പ്രൗ','പ്റ്റ','പ്ല','പ്ലാ','പ്ലി','പ്ലേ','പ്ലൈ','പൗ','ഫ','ഫാ','ഫി','ഫീ','ഫു','ഫെ','ഫേ','ഫൈ','ഫൊ',
                                'ഫോ','ഫ്ജ','ഫ്ട','ഫ്ടി','ഫ്തി','ഫ്ര','ഫ്രാ','ഫ്രി','ഫ്രീ','ഫ്രെ','ഫ്രോ','ഫ്റ്റ','ഫ്റ്റി','ഫ്റ്റു','ഫ്ല','ഫൗ','ബ','ബാ','ബി','ബീ',
                                'ബു','ബൂ','ബെ','ബേ','ബൈ','ബോ','ബ്ജ','ബ്ദ','ബ്ദി','ബ്ദു','ബ്പു','ബ്ബ','ബ്ബി','ബ്ബു','ബ്യ','ബ്യൂ','ബ്ര','ബ്രാ','ബ്രി','ബ്രീ',
                                'ബ്രു','ബ്രെ','ബ്രേ','ബ്രോ','ബ്രൗ','ബ്ലാ','ബ്ലി','ബ്ലു','ബ്ലൂ','ബ്ലോ','ബൗ','ഭ','ഭാ','ഭി','ഭീ','ഭു','ഭൂ','ഭേ','ഭോ','ഭ്യ',
                                'ഭ്യാ','ഭ്യൂ','ഭ്ര','ഭ്രാ','ഭൗ','മ','മാ','മി','മീ','മു','മൂ','മെ','മേ','മൈ','മൊ','മോ','മ്പ','മ്പാ','മ്പി','മ്പു',
                                'മ്പൂ','മ്പെ','മ്പേ','മ്പൈ','മ്പൊ','മ്പോ','മ്പ്യ','മ്പ്യാ','മ്പ്യൂ','മ്പ്ര','മ്പ്രാ','മ്മ','മ്മാ','മ്മി','മ്മീ','മ്മു','മ്മൂ','മ്മേ','മ്മോ','മ്മ്യൂ',
                                'മ്യ','മ്യൂ','മ്യേ','മ്ര','മ്രാ','മൗ','യ','യാ','യി','യീ','യു','യൂ','യെ','യേ','യൊ','യോ','യ്ക','യ്ക്ക','യ്ക്കാ','യ്ക്കി',
                                'യ്ക്കു','യ്ഗാ','യ്ച്ച','യ്ഞ്ചു','യ്ഡ','യ്ഡി','യ്ത','യ്താ','യ്തി','യ്തു','യ്ത്ത','യ്പ','യ്പാ','യ്പി','യ്പ്പു','യ്മ','യ്യ','യ്യാ','യ്യി','യ്യു',
                                'യ്യൂ','യ്യേ','യ്യൊ','യ്സ്റ്റ','യ്ഹി','ര','രാ','രി','രീ','രു','രൂ','രെ','രേ','രൊ','രോ','ര്നി','ര്യ','ര്യാ','ര്യോ','രൗ',
                                'റ','റാ','റി','റീ','റു','റൂ','റെ','റേ','റൈ','റൊ','റോ','റ്മ','റ്റ','റ്റാ','റ്റി','റ്റീ','റ്റു','റ്റെ','റ്റേ','റ്റൊ',
                                'റ്റോ','റ്റ്-','റ്റ്ബ്യൂ','റ്റ്വോ','റ്റ്ഹൗ','റൗ','ല','ലാ','ലി','ലീ','ലു','ലൂ','ലെ','ലേ','ലൈ','ലൊ','ലോ','ല്ക','ല്കാ','ല്കി',
                                'ല്കു','ല്ക്ക','ല്ക്കാ','ല്ക്കു','ല്പ','ല്പാ','ല്പി','ല്മീ','ല്യ','ല്യാ','ല്യു','ല്യൂ','ല്ല','ല്ലാ','ല്ലി','ല്ലു','ല്ലൂ','ല്ലെ','ല്ലേ','ല്ലൊ',
                                'ല്ലോ','ല്ല്യ','ല്ല്യാ','ള','ളാ','ളി','ളീ','ളു','ളൂ','ളെ','ളേ','ളൊ','ളോ','ള്ള','ള്ളാ','ള്ളി','ള്ളു','ള്ളൂ','ഴ','ഴാ',
                                'ഴി','ഴു','ഴൂ','ഴെ','ഴേ','ഴൊ','ഴ്ച','ഴ്ചി','ഴ്ച്ച','ഴ്ത്ത','ഴ്ത്തി','ഴ്ന്ന','ഴ്ന്നി','ഴ്സ','വ','വാ','വി','വീ','വു','വൂ',
                                'വെ','വേ','വേി','വൈ','വോ','വ്ഗാ','വ്യ','വ്യാ','വ്യോ','വ്ര','വ്വാ','ശ','ശാ','ശി','ശീ','ശു','ശൂ','ശെ','ശേ','ശൈ',
                                'ശോ','ശ്ച','ശ്ചാ','ശ്ചി','ശ്ബാ','ശ്ബു','ശ്മ','ശ്മി','ശ്മീ','ശ്യ','ശ്യാ','ശ്ര','ശ്രാ','ശ്രി','ശ്രീ','ശ്രു','ശ്രൂ','ശ്രേ','ശ്രോ','ശ്ലീ',
                                'ശ്ലോ','ശ്വ','ശ്വാ','ശ്വേ','ശ്ശ','ശ്ശാ','ശ്ശി','ശ്ശൂ','ശ്ശേ','ഷ','ഷാ','ഷി','ഷീ','ഷു','ഷൂ','ഷെ','ഷേ','ഷൈ','ഷൊ','ഷോ',
                                'ഷ്ട','ഷ്ടാ','ഷ്ടി','ഷ്ട്ര','ഷ്ട്രീ','ഷ്ഠ','ഷ്ഠാ','ഷ്ഠി','ഷ്ണ','ഷ്ണാ','ഷ്ണു','ഷ്പ','ഷ്പ്പ','ഷ്മ','ഷ്യ','ഷ്യാ','ഷ്യു','ഷ്ര്ടീ','ഷ്വ','ഷൗ',
                                'സ','സാ','സി','സീ','സു','സൂ','സെ','സേ','സൈ','സൊ','സോ','സ്-','സ്ആ','സ്ഇ','സ്എ','സ്ഗ','സ്ഗ്രൂ','സ്ജി','സ്ടു','സ്ട്ര',
                                'സ്ട്രാ','സ്ട്രി','സ്ട്രീ','സ്ഡ','സ്ത','സ്താ','സ്തി','സ്തു','സ്ത്യ','സ്ത്യാ','സ്ത്ര','സ്ത്രാ','സ്ത്രീ','സ്ഥ','സ്ഥാ','സ്ഥി','സ്ഥൂ','സ്നേ','സ്ഫു','സ്ബി',
                                'സ്ബു','സ്മ','സ്മാ','സ്മി','സ്മൂ','സ്യ','സ്യാ','സ്യൂ','സ്ര','സ്രാ','സ്രി','സ്റ്റ','സ്റ്റാ','സ്റ്റി','സ്റ്റീ','സ്റ്റു','സ്റ്റെ','സ്റ്റേ','സ്റ്റൈ','സ്റ്റോ',
                                'സ്റ്റ്-','സ്റ്റ്ഓ','സ്റ്റ്ജ','സ്റ്റ്യാ','സ്റ്റൗ','സ്ലാ','സ്ലീ','സ്ലേ','സ്വ','സ്വാ','സ്വി','സ്വീ','സ്വേ','സ്സ','സ്സാ','സ്സി','സ്സീ','സ്സു','സ്സെ','സ്സോ',
                                'സ്സ്-','സ്ഹാ','സൗ','ഹ','ഹാ','ഹി','ഹീ','ഹു','ഹൂ','ഹെ','ഹേ','ഹൈ','ഹോ','ഹ്ന','ഹ്മ','ഹ്മാ','ഹ്യ','ഹ്യാ','ഹ്യൂ','ഹ്രു',
                                'ഹ്റ്റി','ഹ്ലാ','ഹൗ','ൃ','ൄ','േ്കാ','േ്ക്ക','േ്ക്കാ','േ്ഛ','േ്ത','ൈ്വ','്','ൠ','ൡ','ൢ','ൣ','൦','൧','൨','൩',
                                '൪','൫','൬','൭','൮','൯','൰','൱','൲','൳','൴','൵','൹','ൺ','ൻ','ർ','ൽ','ൾ','ൿ']
    
    # vocab 
    unicodes               =    ['']+sorted(_unicodes+numbers+punctuations)
    components             =    ['']+sorted(_components+numbers+punctuations)
    valid                  =    ['']+sorted(dict_graphemes+numbers+punctuations)
#------------------------------------------------------------------------------------------------------------------------------------------------------
#######################################################################################################################################################
#------------------------------------------------------------------------------------------------------------------------------------------------------

class hindi:
    iden                   =    "hindi"

    numbers                =    ['०', '१', '२', '३', '४', '५', '६', '७', '८', '९']
    punctuations           =    ['!', '"', '#', '$', '%', '&', "'", '(', ')', '*', '+', ',', '-', '.', 
                                 '/', ':', ';', '<', '=', '>', '?', '@', '[', '\\', ']', '^', '_', '`',
                                 '{', '|', '}', '~', '।', '॥'] 
    # for grapheme decomp
    vowel_diacritics       =    ['ि', 'ी', 'ु', 'ू', 'े', 'ो', 'ै', 'ौ', 'ा', 'ृ' ,  'ॅ', 'ॉ']
    vocalics               =    [] # last two actually vocalics, infrequents actually in hindi
    consonant_diacritics   =    ['ः', 'ं', 'ँ', ''] # []+vocalics
    modifiers              =    []
    connector              =    '्'
    special_charecters     =    [connector,'\u200d', '\u200c']
    allow_conn_ending      =    True

    # vocab parts
    _unicodes              =    ['-',
                                'ँ','ं','ः','ऄ','अ','आ','इ','ई','उ','ऊ','ऋ','ऌ','ऍ','ऎ','ए','ऐ','ऑ','ऒ','ओ','औ',
                                'क','ख','ग','घ','ङ','च','छ','ज','झ','ञ','ट','ठ','ड','ढ','ण','त','थ','द','ध','न',
                                'ऩ','प','फ','ब','भ','म','य','र','ऱ','ल','ळ','ऴ','व','श','ष','स','ह','़','ऽ','ा',
                                'ि','ी','ु','ू','ृ','ॄ','ॅ','ॆ','े','ै','ॉ','ॊ','ो','ौ','्','ॐ','॑','॒','॓','॔',
                                'क़','ख़','ग़','ज़','ड़','ढ़','फ़','य़','ॠ','ॡ','ॢ','।','॥','०','१','२','३','४','५','६',
                                '७','८','९','॰','ॱ','ॲ','ॻ','ॼ','ॽ','ॾ','ॿ']
    _components            =    ['-','ँ','ं','ः','ऄ','अ','अ्र','आ','इ','ई','उ','ऊ','ऋ','ऌ','ऍ','ऎ','ए','ऐ','ऑ','ऒ',
                                'ओ','औ','क','क्क','क्क्ष','क्ख','क्ग','क्ग्र','क्च','क्छ','क्ज','क्झ','क्ट','क्ट्र','क्ट्स','क्ठ','क्ड','क्त','क्त्य','क्त्र',
                                'क्त्व','क्त्व्य','क्द','क्न','क्प','क्ब','क्भ','क्भ्र','क्म','क्य','क्र','क्ल','क्व','क्श','क्ष','क्ष्ण','क्ष्म','क्ष्म्य','क्ष्य','क्ष्व',
                                'क्स','क्स्ड','क्ह','ख','ख्त','ख्म','ख्य','ख्ल','ख्व','ख्स','ग','ग्ग','ग्ज','ग्ण','ग्द','ग्ध','ग्न','ग्न्य','ग्ब','ग्भ',
                                'ग्भ्र','ग्म','ग्य','ग्र','ग्ल','ग्व','ग्स','घ','घ्न','घ्ब','घ्र','घ्व','ङ','ङ्क','ङ्क्ष','च','च्च','च्च्य','च्छ','च्छ्र',
                                'च्छ्व','च्य','च्व','छ','ज','ज्ज','ज्ज्त','ज्ज्य','ज्ज्व','ज्ञ','ज्ब','ज्म','ज्य','ज्र','ज्व','ज़्','झ','झ्र','ञ्च','ट',
                                'ट्ज','ट्ट','ट्ठ','ट्न','ट्य','ट्र','ट्र्र्र्र्र्र्र्र्र्र','ट्व','ट्स','ठ','ठ्ठ','ठ्भ','ठ्य','ड','ड्ड','ड्ढ','ड्य','ड्र','ड्स','ढ',
                                'ढ्य','ण','ण्ट','ण्ठ','ण्ड','ण्ड्य','ण्ड्र','ण्ण','ण्य','ण्र','त','त्क','त्क्र','त्ख','त्त','त्त्य','त्त्व','त्थ','त्न','त्न्य',
                                'त्प','त्प्र','त्फ','त्म','त्म्य','त्य','त्र','त्र्त','त्र्य','त्ल','त्व','त्स','त्स्न','त्स्य','त्स्व','थ','थ्य','थ्र','थ्व','द',
                                'द्ग','द्ग्र','द्घ','द्द','द्द्य','द्द्व','द्ध','द्ध्य','द्भ','द्म','द्य','द्र','द्र्य','द्र्र','द्व','द्व्य','ध','ध्द','ध्य','ध्य्य',
                                'ध्र','ध्व','ध्ु','न','न्क','न्क्र','न्क्ल','न्च','न्ज','न्ट','न्ड','न्त','न्त्य','न्त्र','न्त्र्य','न्त्व','न्थ','न्द','न्द्य','न्द्र',
                                'न्द्व','न्ध','न्ध्य','न्ध्र','न्ध्र्व','न्न','न्न्त','न्फ्य','न्म','न्य','न्व','न्श','न्श्य','न्स','न्स्म','न्ह','ऩ','प','प्ट','प्त',
                                'प्न','प्प','प्य','प्र','प्ल','प्व','प्श','प्स','प्स्य','फ','फ्ट','फ्त','फ्फ','फ्य','फ्र','फ्ल','ब','ब्ज','ब्द','ब्ध',
                                'ब्ब','ब्य','ब्र','ब्ल','ब्व','ब्स','ब्ज़','भ','भ्य','भ्र','म','म्ड','म्त','म्न','म्प','म्प्र','म्प्ल','म्फ','म्ब','म्ब्य',
                                'म्ब्र','म्भ','म्म','म्य','म्र','म्र्ड','म्ल','म्व','म्स','म्स्क','म्ह','य','य्य','र','र्अ','र्इ','र्ऌ','र्क','र्क्स','र्ख',
                                'र्ग','र्ग्य','र्ग्र','र्घ','र्घ्य','र्च','र्च्छ','र्च्य','र्छ','र्ज','र्ज्य','र्ञ','र्ट','र्ट्स','र्ड','र्ड्स','र्ण','र्ण्य','र्त','र्त्त',
                                'र्त्य','र्त्र','र्त्स','र्थ','र्थ्य','र्द','र्द्ध','र्द्र','र्द्व','र्ध','र्ध्म','र्ध्य','र्ध्व','र्न','र्प','र्फ','र्फ्य','र्ब','र्ब्र','र्भ',
                                'र्म','र्म्य','र्य','र्र','र्र्थ','र्ल','र्व','र्श','र्श्व','र्ष','र्ष्ण','र्स','र्क़','र्ज़','ऱ','ल','ल्क','ल्क्य','ल्ग','ल्ट',
                                'ल्ट्र','ल्ड','ल्त','ल्द','ल्प','ल्फ','ल्फ्र','ल्ब','ल्भ','ल्म','ल्म्स','ल्य','ल्र्स','ल्ल','ल्व','ल्स','ल्ह','ळ','ऴ','व',
                                'व्य','व्र','व्व','व्स','व्ह','श','श्क','श्च','श्छ','श्ड','श्त','श्द','श्न','श्फ','श्म','श्य','श्र','श्र्व','श्ल','श्व',
                                'ष','ष्क','ष्क्र','ष्च','ष्ट','ष्ट्य','ष्ट्र','ष्ठ','ष्ण','ष्त','ष्प','ष्प्र','ष्म','ष्य','ष्व','ष्ष','स','स्क','स्क्र','स्ख',
                                'स्ज','स्ट','स्ट्र','स्ड','स्त','स्त्य','स्त्र','स्त्व','स्थ','स्थ्य','स्द','स्न','स्प','स्प्र','स्फ','स्ब','स्ब्ड','स्म','स्य','स्र',
                                'स्ल','स्व','स्स','स्स्व','स्।','ह','ह्ट','ह्ण','ह्न','ह्ब','ह्म','ह्य','ह्र','ह्ल','ह्व','़','़्क','़्ट','़्त','़्फ',
                                '़्य','़्र','़्व','ऽ','ा','ि','ि्क','ि्र','ी','ु','ू','ू्र','ृ','ॄ','ॅ','ॆ','े','े्र','ै','ै्र',
                                'ॉ','ॊ','ो','ौ','्','ॐ','॑','॒','॓','॔','क़','क़्त','ख़','ग़','ज़','ज़्ब','ज़्म','ड़','ढ़','फ़',
                                'फ़्त','फ़्न','फ़्ल','य़','ॠ','ॡ','ॢ','।','॥','०','१','२','३','४','५','६','७','८','९','॰',
                                'ॱ','ॲ','ॻ','ॼ','ॽ','ॾ','ॿ']
    dict_graphemes         =    ['-','ऄ','अ','अँ','अं','अि','अ्र','आ','आँ','आं','इ','इं','ई','ईँ','ईं','उ','उं','ऊ','ऊँ','ऊं','ऋ',
                                'ऌा','ऍं','ऎ','ए','एँ','एं','ऐ','ऐं','ऑ','ऑं','ऒ','ओ','ओँ','ओं','औ','औं','क','कं','का','काँ',
                                'कां','काें','कि','किं','की','कु','कुँ','कुं','कू','कूँ','कूं','के','कें','केा','कै','कैं','को','कों','कौ','कौं',
                                'क्क','क्का','क्की','क्कू','क्के','क्कों','क्क्ष','क्ख','क्खे','क्गि','क्ग्रा','क्ग्रे','क्च','क्छ','क्छा','क्ज','क्जा','क्जि','क्जी','क्जें',
                                'क्झ','क्झि','क्ट','क्टि','क्टिं','क्टू','क्टे','क्टौ','क्ट्र','क्ट्रि','क्ट्री','क्ट्रे','क्ट्रो','क्ट्स','क्ठो','क्ड','क्त','क्ता','क्ति','क्तू',
                                'क्तों','क्त्या','क्त्यु','क्त्र','क्त्रि','क्त्व','क्त्वि','क्त्व्य','क्द','क्नी','क्प','क्पा','क्ब','क्बा','क्भी','क्भ्र','क्म','क्य','क्या','क्यु',
                                'क्यू','क्यूँ','क्यूं','क्यों','क्र','क्रा','क्रां','क्रि','क्री','क्रु','क्रे','क्रै','क्रो','क्रों','क्ला','क्लि','क्ली','क्लू','क्ले','क्व',
                                'क्वा','क्वाँ','क्वि','क्वे','क्श','क्शा','क्शे','क्ष','क्षा','क्षां','क्षि','क्षी','क्षु','क्षे','क्षै','क्ष्ण','क्ष्म','क्ष्मी','क्ष्म्यै','क्ष्य',
                                'क्ष्वा','क्स','क्सा','क्सि','क्सिं','क्सी','क्से','क्सो','क्स्ड','क्ह','क्हा','ख','खं','खा','खाँ','खां','खि','खिं','खी','खीं',
                                'खु','खू','खूँ','खूं','खे','खें','खै','खो','खों','खौ','ख्त','ख्ता','ख्ती','ख्तों','ख्मी','ख्य','ख्या','ख्ली','ख्व','ख्वा',
                                'ख्स','ग','गं','गा','गाँ','गां','गि','गिं','गी','गीं','गु','गुं','गू','गूँ','गूं','गे','गें','गेः','गै','गैं',
                                'गो','गों','गौ','ग्ग','ग्गी','ग्जा','ग्जी','ग्जे','ग्ण','ग्द','ग्ध','ग्धा','ग्न','ग्नि','ग्नी','ग्नू','ग्न्या','ग्न्यू','ग्बा','ग्बी',
                                'ग्भ','ग्भ्र','ग्म','ग्मों','ग्य','ग्या','ग्र','ग्रं','ग्रा','ग्रां','ग्रि','ग्री','ग्रु','ग्रे','ग्रैं','ग्रो','ग्ला','ग्ले','ग्लै','ग्लो',
                                'ग्वा','ग्वे','ग्स','घ','घं','घा','घि','घी','घु','घू','घे','घेा','घो','घ्न','घ्बा','घ्र','घ्व','घ्वी','ङ','ङी',
                                'ङीं','ङ्क','ङ्क्ष','च','चँ','चं','चा','चाँ','चां','चि','चिं','ची','चीं','चु','चुं','चू','चूँ','चे','चें','चै',
                                'चो','चों','चौ','चौं','च्च','च्चा','च्चि','च्ची','च्चे','च्चें','च्चों','च्च्य','च्च्यिों','च्छ','च्छं','च्छा','च्छि','च्छी','च्छे','च्छ्रं',
                                'च्छ्रे','च्छ्वा','च्य','च्यु','च्वां','छ','छं','छा','छां','छि','छिं','छी','छीं','छु','छू','छे','छें','छो','ज','जं',
                                'जा','जाँ','जां','जि','जिं','जी','जीं','जु','जुं','जू','जे','जें','जै','जो','जों','जौ','ज्ज','ज्जा','ज्जि','ज्जे',
                                'ज्जै','ज्जो','ज्ज्त','ज्ज्यि','ज्ज्व','ज्ञ','ज्ञा','ज्ञी','ज्ञे','ज्ञों','ज्बा','ज्बे','ज्म','ज्मों','ज्य','ज्या','ज्यू','ज्यो','ज्यों','ज्र',
                                'ज्व','ज्वा','ज्वै','ज़्','झ','झं','झा','झाँ','झां','झि','झिं','झी','झु','झुं','झू','झे','झें','झो','झों','झ्र',
                                'ञ्च','ट','टं','टा','टाँ','टां','टि','टिं','टी','टु','टू','टे','टें','टै','टैं','टो','टों','टौ','ट्ज','ट्ट',
                                'ट्टा','ट्टि','ट्टी','ट्टे','ट्टो','ट्ठ','ट्ठा','ट्ठि','ट्ठे','ट्ठों','ट्न','ट्य','ट्यु','ट्यू','ट्र','ट्रा','ट्रां','ट्रि','ट्री','ट्रे',
                                'ट्रै','ट्रो','ट्र्र्र्र्र्र्र्र्र्री','ट्वि','ट्वी','ट्स','ठ','ठं','ठा','ठि','ठी','ठीं','ठु','ठूं','ठे','ठें','ठो','ठों','ठौ','ठ्ठ',
                                'ठ्ठी','ठ्भे','ठ्य','ड','डँ','डं','डा','डाँ','डां','डि','डिं','डी','डु','डू','डे','डें','डै','डो','डों','ड्ड',
                                'ड्डा','ड्डी','ड्डे','ड्ढा','ड्ढी','ड्यं','ड्यू','ड्र','ड्रा','ड्री','ड्रे','ड्रै','ड्रो','ड्स','ढ','ढं','ढा','ढां','ढि','ढी',
                                'ढु','ढू','ढूं','ढे','ढै','ढो','ढों','ढ्य','ण','णा','णि','णी','णु','णे','णो','णों','ण्ट','ण्टे','ण्ठ','ण्ठे',
                                'ण्ड','ण्डा','ण्डि','ण्डी','ण्डे','ण्डों','ण्ड्या','ण्ड्र','ण्ड्रा','ण्ड्री','ण्णा','ण्णी','ण्य','ण्र','त','तं','तः','ता','ताँ','तां',
                                'ति','ती','तीं','तु','तुं','तू','ते','तेँ','तें','तेा','तै','तो','तों','तौ','त्क','त्कं','त्का','त्क्र','त्क्रा','त्ख',
                                'त्त','त्ता','त्ताा','त्ति','त्ती','त्तू','त्ते','त्तों','त्त्य','त्त्व','त्त्वा','त्थ','त्था','त्थी','त्न','त्ना','त्नि','त्नी','त्न्यै','त्प',
                                'त्पा','त्पी','त्प्रे','त्फ','त्म','त्मा','त्मि','त्मी','त्म्य','त्य','त्या','त्यि','त्यु','त्ये','त्यें','त्यो','त्यौ','त्र','त्रा','त्रि',
                                'त्रिा','त्री','त्रु','त्रे','त्रो','त्रों','त्र्त','त्र्ता','त्र्यं','त्ल','त्ले','त्व','त्वा','त्वों','त्स','त्सं','त्सा','त्सु','त्स्न','त्स्ना',
                                'त्स्य','त्स्या','त्स्यि','त्स्व','थ','था','थि','थिं','थी','थीं','थु','थू','थे','थें','थै','थो','थों','थौ','थ्य','थ्या',
                                'थ्यू','थ्री','थ्रु','थ्वी','द','दं','दा','दाँ','दां','दि','दी','दीं','दु','दुः','दू','दूँ','दूं','दे','दें','दै',
                                'दो','दों','दौ','द्ग','द्ग्र','द्घ','द्घा','द्घि','द्द','द्दा','द्दी','द्दु','द्दे','द्दो','द्द्य','द्द्या','द्द्ये','द्द्वा','द्ध','द्धा',
                                'द्धां','द्धि','द्धे','द्धों','द्ध्य','द्भ','द्म','द्मि','द्य','द्या','द्यु','द्यो','द्र','द्रः','द्रा','द्रि','द्री','द्रू','द्रे','द्रो',
                                'द्रों','द्र्य','द्र्र','द्व','द्वं','द्वा','द्वि','द्वी','द्वे','द्वै','द्व्य','ध','धं','धा','धाँ','धि','धी','धु','धुँ','धुं',
                                'धू','धे','धो','धों','ध्द','ध्दि','ध्य','ध्या','ध्ये','ध्य्य','ध्र','ध्रु','ध्व','ध्वं','ध्ु','न','नं','नः','ना','नां',
                                'नि','निं','नी','नीं','नु','नू','नूँ','ने','नें','नै','नैं','नो','नों','नौ','न्क','न्का','न्क्रि','न्क्री','न्क्लू','न्क्ले',
                                'न्च','न्ज','न्जा','न्ट','न्टा','न्टे','न्टो','न्डि','न्डो','न्त','न्तः','न्ति','न्ती','न्तु','न्ते','न्तों','न्त्यो','न्त्र','न्त्रि','न्त्रों',
                                'न्त्र्य','न्त्व','न्थ','न्थि','न्द','न्दा','न्दि','न्दी','न्दु','न्दू','न्दे','न्दो','न्द्य','न्द्र','न्द्रा','न्द्रि','न्द्री','न्द्रों','न्द्वा','न्ध',
                                'न्धि','न्धी','न्धु','न्धे','न्धों','न्ध्य','न्ध्या','न्ध्यी','न्ध्र','न्ध्र्व','न्न','न्ना','न्नां','न्नी','न्नू','न्ने','न्न्ता','न्फ्यू','न्म','न्मा',
                                'न्मु','न्मे','न्मो','न्य','न्या','न्यु','न्यू','न्यो','न्यौ','न्व','न्वा','न्वि','न्वे','न्शा','न्श्यो','न्स','न्सा','न्सां','न्सी','न्सों',
                                'न्स्म','न्ह','न्हा','न्हां','न्ही','न्हीं','न्हू','न्हे','न्हो','न्हों','ऩ','ऩा','ऩे','प','पं','पा','पाँ','पां','पि','पिं',
                                'पी','पु','पू','पूँ','पूं','पे','पें','पै','पैं','पो','पों','पौ','प्ट','प्टी','प्टे','प्त','प्ता','प्ति','प्न','प्प',
                                'प्पा','प्पि','प्पी','प्पु','प्पू','प्या','प्यू','प्र','प्रं','प्रा','प्राँ','प्रां','प्रि','प्रिं','प्री','प्रू','प्रे','प्रै','प्रो','प्रौ',
                                'प्ल','प्ला','प्लि','प्ले','प्लै','प्लो','प्वा','प्श','प्स','प्सी','प्स्यू','फ','फँ','फं','फा','फाँ','फां','फि','फिं','फी',
                                'फु','फुं','फू','फे','फें','फै','फैं','फो','फों','फौ','फ्ट','फ्टि','फ्टिं','फ्टी','फ्त','फ्ता','फ्तों','फ्फ','फ्फि','फ्फी',
                                'फ्यू','फ्र','फ्राँ','फ्रां','फ्रि','फ्री','फ्रू','फ्रें','फ्रैं','फ्ला','फ्लि','फ्लै','फ्लो','ब','बं','बा','बाँ','बां','बि','बिं',
                                'बी','बु','बुं','बू','बूं','बे','बें','बै','बैं','बो','बों','बौ','ब्ज','ब्जा','ब्जि','ब्जी','ब्द','ब्दा','ब्दी','ब्दु',
                                'ब्दों','ब्ध','ब्धि','ब्ब','ब्बा','ब्बी','ब्बू','ब्बे','ब्बों','ब्या','ब्यू','ब्यौ','ब्र','ब्रा','ब्रां','ब्रि','ब्री','ब्रे','ब्रै','ब्रो',
                                'ब्रों','ब्ल','ब्ला','ब्लि','ब्लू','ब्ले','ब्लै','ब्लो','ब्लौ','ब्वे','ब्स','ब्सि','ब्ज़ी','भ','भं','भा','भाँ','भां','भि','भिं',
                                'भी','भीं','भु','भू','भे','भै','भो','भौ','भौं','भ्य','भ्या','भ्र','भ्रा','म','मँ','मं','मा','माँ','मां','मि',
                                'मी','मीं','मु','मुँ','मुं','मू','मूँ','मूं','मे','मेँ','में','मै','मैँ','मैं','मो','मों','मौ','म्ड','म्ति','म्न',
                                'म्प','म्पा','म्पि','म्पू','म्पो','म्प्र','म्प्रे','म्प्ले','म्प्लें','म्फ','म्फे','म्ब','म्बं','म्बा','म्बी','म्बे','म्बो','म्बों','म्ब्यु','म्ब्रि',
                                'म्भ','म्भा','म्भी','म्भो','म्म','म्मा','म्मि','म्मी','म्मीं','म्मू','म्मे','म्मो','म्य','म्यु','म्यू','म्यो','म्र','म्रा','म्र्ड','म्ल',
                                'म्वे','म्स','म्स्की','म्ह','म्हा','म्ही','म्हीं','य','यं','यः','या','याँ','यां','यि','यी','यीँ','यीं','यु','युं','यू',
                                'यूँ','यूं','ये','यें','यो','योँ','यों','यौ','य्य','य्या','र','रं','रा','रां','राः','रि','रिं','री','रीः','रु',
                                'रुँ','रुं','रू','रूँ','रूं','रे','रें','रेा','रै','रैं','रो','रों','रौ','रौं','र्अ','र्इ','र्ऌ','र्क','र्कि','र्की',
                                'र्के','र्कों','र्क्स','र्ख','र्खि','र्ग','र्गं','र्गा','र्गि','र्गी','र्गु','र्गो','र्गों','र्ग्यु','र्ग्रे','र्घ','र्घा','र्घ्य','र्च','र्चा',
                                'र्चि','र्ची','र्चु','र्चे','र्च्छा','र्च्यू','र्छा','र्ज','र्जा','र्जि','र्जी','र्जे','र्जें','र्ज्य','र्ञा','र्ट','र्टि','र्टिं','र्टी','र्टू',
                                'र्टे','र्टों','र्ट्स','र्ड','र्डि','र्ड्स','र्ण','र्णि','र्णी','र्णो','र्ण्य','र्त','र्तं','र्ता','र्ति','र्ती','र्ते','र्तो','र्त्त','र्त्य',
                                'र्त्र','र्त्री','र्त्स','र्थ','र्थि','र्थी','र्थे','र्थो','र्थों','र्थ्य','र्द','र्दा','र्दि','र्दी','र्दे','र्द्ध','र्द्र','र्द्व','र्ध','र्धा',
                                'र्ध्म','र्ध्य','र्ध्या','र्ध्व','र्न','र्ना','र्नि','र्निं','र्नी','र्नो','र्प','र्पि','र्पो','र्फ','र्फ्यू','र्ब','र्बा','र्बि','र्बे','र्ब्र',
                                'र्भ','र्भा','र्भि','र्भो','र्म','र्मा','र्मि','र्मिं','र्मी','र्मु','र्मू','र्मे','र्में','र्मों','र्म्यु','र्य','र्या','र्यी','र्यु','र्र',
                                'र्रा','र्रि','र्रों','र्र्थो','र्ल','र्लिं','र्ली','र्ले','र्व','र्वा','र्वां','र्वि','र्वी','र्वे','र्वो','र्वों','र्श','र्शा','र्शि','र्शी',
                                'र्शों','र्श्व','र्ष','र्षा','र्षि','र्षी','र्षे','र्षो','र्षों','र्ष्णे','र्स','र्सि','र्से','र्सें','र्क़','र्ज़','ऱ','ल','लं','ला',
                                'लां','लि','लिं','ली','लीं','लु','लू','लूँ','लूं','ले','लें','लै','लैं','लो','लों','लौ','ल्क','ल्कि','ल्की','ल्कु',
                                'ल्के','ल्को','ल्कों','ल्क्य','ल्गा','ल्ट','ल्टी','ल्ट्रा','ल्ड','ल्डिं','ल्डे','ल्डो','ल्त','ल्ता','ल्ती','ल्द','ल्दी','ल्प','ल्पि','ल्पी',
                                'ल्पों','ल्फ','ल्फि','ल्फिं','ल्फी','ल्फ्रे','ल्ब','ल्भ','ल्म','ल्मा','ल्मी','ल्मू','ल्में','ल्म्स','ल्य','ल्या','ल्यू','ल्यों','ल्र्स','ल्ल',
                                'ल्लं','ल्ला','ल्लि','ल्ली','ल्लू','ल्ले','ल्लै','ल्लो','ल्लों','ल्लौ','ल्व','ल्वा','ल्वि','ल्वे','ल्स','ल्सि','ल्हा','ळ','ळी','ळे',
                                'ऴ','ऴि','व','वं','वा','वाँ','वां','वि','विं','वी','वीं','वु','वे','वें','वै','वो','वों','व्य','व्यं','व्या',
                                'व्यु','व्यू','व्र','व्व','व्वा','व्स','व्ह','व्हा','श','शँ','शं','शा','शां','शि','शिं','शी','शु','शुं','शू','शे',
                                'शें','शै','शैं','शो','शों','शौ','श्क','श्कि','श्कों','श्च','श्चा','श्चि','श्छ','श्ड','श्त','श्ता','श्ती','श्ते','श्दी','श्न',
                                'श्नों','श्फी','श्म','श्मा','श्मी','श्मे','श्य','श्या','श्यु','श्यू','श्यों','श्यौ','श्र','श्रं','श्रा','श्रि','श्री','श्रु','श्रे','श्रो',
                                'श्र्व','श्ली','श्ले','श्लो','श्व','श्वं','श्वा','श्वां','श्वि','श्वी','श्वे','ष','षा','षां','षि','षी','षु','षे','षो','षों',
                                'ष्क','ष्का','ष्क्रि','ष्चि','ष्ट','ष्टा','ष्टि','ष्टी','ष्ट्य','ष्ट्र','ष्ट्री','ष्ट्रों','ष्ठ','ष्ठा','ष्ठी','ष्ण','ष्णा','ष्णु','ष्णो','ष्ते',
                                'ष्प','ष्पा','ष्प्र','ष्म','ष्य','ष्यो','ष्यों','ष्व','ष्ष','स','सँ','सं','सा','साँ','सां','सि','सिं','सी','सीं','सु',
                                'सुँ','सुं','सू','सूं','से','सें','सै','सैं','सो','सों','सौ','सौं','स्क','स्कं','स्का','स्कि','स्की','स्कु','स्कू','स्के',
                                'स्कै','स्को','स्कों','स्क्री','स्खा','स्खों','स्जि','स्ट','स्टं','स्टा','स्टि','स्टिं','स्टी','स्टू','स्टे','स्टें','स्टै','स्टैं','स्टो','स्ट्र',
                                'स्ट्रि','स्ट्री','स्ट्रू','स्ट्रे','स्ट्रो','स्ड','स्त','स्ता','स्ति','स्ती','स्तु','स्ते','स्तों','स्तौ','स्त्य','स्त्र','स्त्रा','स्त्राँ','स्त्राी','स्त्रि',
                                'स्त्रिा','स्त्री','स्त्रो','स्त्रों','स्त्वि','स्थ','स्था','स्थि','स्थू','स्थ्य','स्दी','स्ना','स्नि','स्नी','स्ने','स्नै','स्प','स्पं','स्पा','स्पि',
                                'स्पी','स्पे','स्पें','स्पै','स्पो','स्प्रे','स्फे','स्फो','स्बा','स्बों','स्ब्डिी','स्म','स्मा','स्मि','स्मे','स्य','स्या','स्यों','स्र','स्ल',
                                'स्ला','स्लि','स्लिं','स्लो','स्व','स्वं','स्वा','स्वि','स्वी','स्वे','स्स','स्सं','स्सा','स्सी','स्सीं','स्से','स्सों','स्स्व','स्स्वा','स्।',
                                'ह','हँ','हं','हा','हाँ','हां','हि','हिं','ही','हीँ','हीं','हु','हुँ','हुं','हू','हूँ','हूं','हे','हें','है',
                                'हैँ','हैं','हो','हों','हौ','हौं','ह्ट','ह्ण','ह्न','ह्बू','ह्म','ह्मा','ह्य','ह्या','ह्र','ह्रा','ह्ला','ह्वा','़','़ं',
                                '़ा','़ाँ','़ि','़िं','़ी','़ु','़ू','़े','़ें','़ै','़ो','़ों','़ौ','़्का','़्ट','़्त','़्फ','़्या','़्रें','़्वा',
                                'ऽ','ि्क','ि्र','ू्र','ृ','ृं','ॄ','ॄं','ॅ','ॅा','ॆ','े्र','ै्र','ॉ','ॉँ','ॉं','ॊ','्','ॐ','॑',
                                '॒','॓','॔','क़','क़ा','क़ी','क़े','क़्त','ख़','ख़ा','ख़ि','ख़ु','ख़ै','ग़','ज़','ज़ा','ज़ि','ज़िं','ज़ी','ज़ु',
                                'ज़े','ज़ें','ज़ो','ज़्बा','ज़्म','ड़','ड़ा','ड़ि','ड़ी','ड़े','ड़ें','ड़ो','ड़ों','ढ़','ढ़ा','ढ़ि','ढ़ी','ढ़े','ढ़ें','ढ़ो',
                                'फ़','फ़ा','फ़ि','फ़ी','फ़ु','फ़े','फ़ें','फ़ै','फ़ो','फ़ौ','फ़्ते','फ़्न','फ़्लै','य़ा','य़ों','ॠ','ॡ','ॢ','।','॥',
                                '०','१','२','३','४','५','६','७','८','९','॰','ॱ','ॲ','ॻ','ॼ','ॽ','ॾ','ॿ']
    # vocab 
    unicodes               =    ['']+sorted(_unicodes+numbers+punctuations)
    components             =    ['']+sorted(_components+numbers+punctuations)
    valid                  =    ['']+sorted(dict_graphemes+numbers+punctuations)
#------------------------------------------------------------------------------------------------------------------------------------------------------
#######################################################################################################################################################
#------------------------------------------------------------------------------------------------------------------------------------------------------

#----------------------------------------- add all language info-------------------------------------------------------------
languages={}
languages["bangla"]=bangla
languages["malyalam"]=malyalam
languages["tamil"]=tamil
languages["gujrati"]=gujrati
languages["panjabi"]=panjabi
languages["odiya"]=odiya
languages["hindi"]=hindi


